
&НаСервере
Процедура СписокОбновитьНаСервере() Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрНайти(ИмяСобытия, "Матч") > 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	ИначеЕсли СтрНайти(ИмяСобытия, "Чемпионат") > 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Список.АвтоматическоеСохранениеПользовательскихНастроек Тогда
		Если ЗначениеЗаполнено(Элементы.Список.Период) Тогда
			Элементы.Список.Период = Новый СтандартныйПериод;
			СписокОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
		Если Параметры.Отбор.Свойство("Тур")
		И ТипЗнч(Параметры.Отбор.Тур) = Тип("СправочникСсылка.Туры")
		Тогда
			Элементы.Тур.Видимость = Ложь;
		КонецЕсли;
	ИначеЕсли Параметры.ТекущаяСтрока <> Неопределено Тогда
		ОбщегоНазначения.БезАвтоНастроек(ЭтаФорма, Список);
	КонецЕсли;
КонецПроцедуры
