
&НаСервере
Процедура СписокОбновить()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрНайти(ИмяСобытия, "Матч") > 0 Тогда
		СписокОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Список.АвтоматическоеСохранениеПользовательскихНастроек Тогда
		Если ЗначениеЗаполнено(Элементы.Список.Период) Тогда
			Элементы.Список.Период = Новый СтандартныйПериод;
			СписокОбновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
	КонецЕсли;
КонецПроцедуры
