
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Игроки") Тогда
		ПараметрыФормы.Вставить("Игрок", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		ПараметрыФормы.Вставить("Команда", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Туры") Тогда
		ПараметрыФормы.Вставить("Тур", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") Тогда
		ПараметрыФормы.Вставить("Чемпионат", ПараметрКоманды);
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Галерея.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды);
КонецПроцедуры
