
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Город", Объект.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Если ЗначениеЗаполнено(Объект.Владелец) Тогда
			//
		ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Страна") Тогда
			Объект.Владелец = Параметры.ЗначенияЗаполнения.Страна;
		ИначеЕсли Параметры.ПараметрыВыбора.Свойство("Страна") Тогда
			Объект.Владелец = Параметры.ПараметрыВыбора.Страна;
		ИначеЕсли ТипЗнч(Параметры.Основание) = Тип("СправочникСсылка.Страны") Тогда
			Объект.Владелец = Параметры.Основание;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НаименованиеПриИзмененииНаСервере()
	Если Объект.Ссылка.Пустая()
	И НЕ ПустаяСтрока(Объект.Наименование)
	И СтрНайти(Объект.Наименование, ",") > 0
	Тогда
		мСлова = Разделить(Объект.Наименование, ",");
		Объект.Наименование	= мСлова.Получить(0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	НаименованиеПриИзмененииНаСервере();
КонецПроцедуры
