
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Игрок) Тогда
		СхемаКомпоновкиДанных	= ПолучитьМакет("СхемаИгрок");
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Игрок",	Игрок);
	Иначе
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Команда",	Команда);
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
КонецПроцедуры
