
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Команда) Тогда
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка",	Команда);
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	Иначе
	    СтандартнаяОбработка = Ложь;
		
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;

		СхемаКомпоновкиДанных = ПолучитьМакет("ОсновнаяСхемаКомпоновкиДанных");
		СхемаКомпоновкиДанных.НаборыДанных.Получить(0).Запрос = ЗапросУстановить();
		
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		Если ЗначениеЗаполнено(Игрок) Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка",	Игрок);
		ИначеЕсли ЗначениеЗаполнено(Тур) Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка",	Тур);
		ИначеЕсли ЗначениеЗаполнено(Чемпионат) Тогда
			КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Ссылка",	Чемпионат);
		КонецЕсли;
		
		МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
	    ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	    ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки,, ДанныеРасшифровки);
	    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	    ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
	КонецЕсли;
КонецПроцедуры

Функция ЗапросУстановить()
	Если ЗначениеЗаполнено(Игрок) Тогда
		Возврат "ВЫБРАТЬ
		        |	Ссылки.Ссылка КАК Ссылка,
		        |	Ссылки.Порядок КАК Порядок,
		        |	Ссылки.Дата КАК Дата
		        |ПОМЕСТИТЬ Ссылки
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		Игроки.Ссылка КАК Ссылка,
		        |		1 КАК Порядок,
		        |		Игроки.ДатаРождения КАК Дата
		        |	ИЗ
		        |		Справочник.Игроки КАК Игроки
		        |	ГДЕ
		        |		Игроки.Ссылка = &Ссылка
		        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Игроки.Изображение) >= 64
		        |	
		        |	ОБЪЕДИНИТЬ ВСЕ
		        |	
		        |	ВЫБРАТЬ
		        |		ТурнирнаяТаблица.Тур,
		        |		77,
		        |		ТурнирнаяТаблица.Период
		        |	ИЗ
		        |		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		        |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		        |				И ТурнирнаяТаблица.КоличествоОчков > Противник.КоличествоОчков
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		        |			ПО ТурнирнаяТаблица.Регистратор = МатчСоставыКоманд.Ссылка
		        |				И ТурнирнаяТаблица.Команда = МатчСоставыКоманд.Команда
		        |	ГДЕ
		        |		МатчСоставыКоманд.Игрок = &Ссылка
		        |		И ТурнирнаяТаблица.Тур В
		        |				(ВЫБРАТЬ
		        |					ТурнирнаяТаблица.Тур
		        |				ИЗ
		        |					РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |				ГДЕ
		        |					ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ИСТИНА
		        |					И РАЗМЕРХРАНИМЫХДАННЫХ(ТурнирнаяТаблица.Тур.Изображение) >= 64
		        |				СГРУППИРОВАТЬ ПО
		        |					ТурнирнаяТаблица.Тур
		        |				ИМЕЮЩИЕ
		        |					КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) = 1)
		        |	
		        |	ОБЪЕДИНИТЬ ВСЕ
		        |	
		        |	ВЫБРАТЬ
		        |		ТурнирнаяТаблица.Регистратор,
		        |		90 - ТурнирнаяТаблица.КоличествоОчков,
		        |		ТурнирнаяТаблица.Период
		        |	ИЗ
		        |		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		        |			ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		        |			ПО ТурнирнаяТаблица.Регистратор = МатчСоставыКоманд.Ссылка
		        |				И ТурнирнаяТаблица.Команда = МатчСоставыКоманд.Команда
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		        |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		        |				И ТурнирнаяТаблица.КоличествоОчков >= Противник.КоличествоОчков
		        |				И ТурнирнаяТаблица.Команда <> Противник.Команда
		        |	ГДЕ
		        |		МатчСоставыКоманд.Игрок = &Ссылка
		        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Матч.Изображение) >= 64
		        |	
		        |	ОБЪЕДИНИТЬ ВСЕ
		        |	
		        |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		        |		ПеремещенияИгроков.Команда,
		        |		99,
		        |		МАКСИМУМ(ПеремещенияИгроков.Период)
		        |	ИЗ
		        |		РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		        |			ПО ПеремещенияИгроков.Команда = Команды.Ссылка
		        |	ГДЕ
		        |		ПеремещенияИгроков.Игрок = &Ссылка
		        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) >= 64
		        |	
		        |	СГРУППИРОВАТЬ ПО
		        |		ПеремещенияИгроков.Команда) КАК Ссылки
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ ПЕРВЫЕ 9999
		        |	Ссылки.Ссылка КАК Ссылка,
		        |	АВТОНОМЕРЗАПИСИ() КАК Номер,
		        |	Ссылки.Порядок КАК Порядок,
		        |	Ссылки.Дата КАК Дата
		        |ПОМЕСТИТЬ Данные
		        |ИЗ
		        |	Ссылки КАК Ссылки
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Порядок
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Данные.Ссылка КАК Ссылка,
		        |	Данные.Ссылка.Изображение КАК Изображение,
		        |	ВложенныйЗапрос.Ссылка КАК Ссылка1,
		        |	ВложенныйЗапрос.Ссылка.Изображение КАК Изображение1,
		        |	Данные.Порядок КАК Порядок,
		        |	Данные.Дата КАК Дата
		        |ИЗ
		        |	Данные КАК Данные
		        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		        |			Данные.Номер - 1 КАК Номер,
		        |			Данные.Порядок КАК Порядок,
		        |			Данные.Ссылка КАК Ссылка
		        |		ИЗ
		        |			Данные КАК Данные
		        |		ГДЕ
		        |			Данные.Номер / 2 = ЦЕЛ(Данные.Номер / 2)) КАК ВложенныйЗапрос
		        |		ПО Данные.Номер = ВложенныйЗапрос.Номер
		        |ГДЕ
		        |	Данные.Номер / 2 > ЦЕЛ(Данные.Номер / 2)";
	ИначеЕсли ЗначениеЗаполнено(Тур) Тогда
		Возврат "ВЫБРАТЬ
		        |	Ссылки.Ссылка КАК Ссылка,
		        |	Ссылки.Порядок КАК Порядок,
		        |	Ссылки.Дата КАК Дата
		        |ПОМЕСТИТЬ Ссылки
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		Туры.Ссылка КАК Ссылка,
		        |		77 КАК Порядок,
		        |		Туры.ДатаНачала КАК Дата
		        |	ИЗ
		        |		Справочник.Туры КАК Туры
		        |	ГДЕ
		        |		Туры.Ссылка = &Ссылка
		        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Туры.Изображение) >= 64
		        |	
		        |	ОБЪЕДИНИТЬ ВСЕ
		        |	
		        |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		        |		ТурнирнаяТаблица.Регистратор,
		        |		90,
		        |		ТурнирнаяТаблица.Период
		        |	ИЗ
		        |		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		        |			ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		        |	ГДЕ
		        |		ТурнирнаяТаблица.Тур = &Ссылка
		        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Матч.Изображение) >= 64) КАК Ссылки
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ ПЕРВЫЕ 9999
		        |	Ссылки.Ссылка КАК Ссылка,
		        |	АВТОНОМЕРЗАПИСИ() КАК Номер,
		        |	Ссылки.Порядок КАК Порядок,
		        |	Ссылки.Дата КАК Дата
		        |ПОМЕСТИТЬ Данные
		        |ИЗ
		        |	Ссылки КАК Ссылки
		        |
		        |УПОРЯДОЧИТЬ ПО
		        |	Порядок,
		        |	Дата УБЫВ
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Данные.Ссылка КАК Ссылка,
		        |	Данные.Ссылка.Изображение КАК Изображение,
		        |	ВложенныйЗапрос.Ссылка КАК Ссылка1,
		        |	ВложенныйЗапрос.Ссылка.Изображение КАК Изображение1,
		        |	Данные.Порядок КАК Порядок,
		        |	Данные.Дата КАК Дата
		        |ИЗ
		        |	Данные КАК Данные
		        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		        |			Данные.Номер - 1 КАК Номер,
		        |			Данные.Порядок КАК Порядок,
		        |			Данные.Ссылка КАК Ссылка
		        |		ИЗ
		        |			Данные КАК Данные
		        |		ГДЕ
		        |			Данные.Номер / 2 = ЦЕЛ(Данные.Номер / 2)) КАК ВложенныйЗапрос
		        |		ПО Данные.Номер = ВложенныйЗапрос.Номер
		        |ГДЕ
		        |	Данные.Номер / 2 > ЦЕЛ(Данные.Номер / 2)";
	КонецЕсли;
	Возврат "ВЫБРАТЬ
	        |	Ссылки.Ссылка КАК Ссылка,
	        |	Ссылки.Порядок КАК Порядок,
	        |	Ссылки.Дата КАК Дата
	        |ПОМЕСТИТЬ Ссылки
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		Туры.Ссылка КАК Ссылка,
	        |		77 КАК Порядок,
	        |		Туры.ДатаНачала КАК Дата
	        |	ИЗ
	        |		Справочник.Туры КАК Туры
	        |	ГДЕ
	        |		Туры.Владелец = &Ссылка
	        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Туры.Изображение) >= 64
	        |	
	        |	ОБЪЕДИНИТЬ ВСЕ
	        |	
	        |	ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |		ТурнирнаяТаблица.Регистратор,
	        |		90,
	        |		ТурнирнаяТаблица.Период
	        |	ИЗ
	        |		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	        |			ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
	        |	ГДЕ
	        |		ТурнирнаяТаблица.Тур.Владелец = &Ссылка
	        |		И РАЗМЕРХРАНИМЫХДАННЫХ(Матч.Изображение) >= 64) КАК Ссылки
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ ПЕРВЫЕ 9999
	        |	Ссылки.Ссылка КАК Ссылка,
	        |	АВТОНОМЕРЗАПИСИ() КАК Номер,
	        |	Ссылки.Порядок КАК Порядок,
	        |	Ссылки.Дата КАК Дата
	        |ПОМЕСТИТЬ Данные
	        |ИЗ
	        |	Ссылки КАК Ссылки
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	Порядок,
	        |	Дата УБЫВ
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Данные.Ссылка КАК Ссылка,
	        |	Данные.Ссылка.Изображение КАК Изображение,
	        |	ВложенныйЗапрос.Ссылка КАК Ссылка1,
	        |	ВложенныйЗапрос.Ссылка.Изображение КАК Изображение1,
	        |	Данные.Порядок КАК Порядок,
	        |	Данные.Дата КАК Дата
	        |ИЗ
	        |	Данные КАК Данные
	        |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			Данные.Номер - 1 КАК Номер,
	        |			Данные.Порядок КАК Порядок,
	        |			Данные.Ссылка КАК Ссылка
	        |		ИЗ
	        |			Данные КАК Данные
	        |		ГДЕ
	        |			Данные.Номер / 2 = ЦЕЛ(Данные.Номер / 2)) КАК ВложенныйЗапрос
	        |		ПО Данные.Номер = ВложенныйЗапрос.Номер
	        |ГДЕ
	        |	Данные.Номер / 2 > ЦЕЛ(Данные.Номер / 2)";
КонецФункции
