
&НаСервере
Процедура ПриОткрытииНаСервере()
	Было	= Новый Соответствие;
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Страны.Код КАК Код
	      	               |ИЗ
	      	               |	Справочник.Страны КАК Страны");
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Было.Вставить(Выборка.Код, Выборка.Код);
	КонецЦикла;
	Макет	= Справочники.Страны.ПолучитьМакет("Макет");
	Для НомерСтроки = 1 По Макет.КоличествоСтрок() Цикл
		Слово = Макет.ПолучитьСтроку(НомерСтроки);
		Если Было.Получить(Лев(Слово, 3)) = Неопределено Тогда
			Коды.Добавить(Лев(Слово, 3), Слово);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПодбор(Команда)
	ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Коды, Элементы.Код);
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений") Тогда
		ЗаполнитьЗначенияСвойств(Объект, Новый Структура("Код,Наименование", Элемент.Значение, СокрЛП(Сред(Элемент.Представление, 4))));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		ПриОткрытииНаСервере();
	Иначе
		Элементы.ФормаКомандаПодбор.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры
