
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Если Отчет.Команды.Количество() = 0 Тогда
			Отчет.Команды.Загрузить(КомандыПолучить());
		КонецЕсли;
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет.Команды.Выгрузить().ВыгрузитьКолонку("Команда"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КомандыПолучить()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Команды.Ссылка КАК Команда
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	                      |		ПО Команды.Город = Города.Ссылка
	                      |ГДЕ
	                      |	Команды.Наименование В(&Наименование)
	                      |	И Города.Владелец = &Страна");
	Запрос.УстановитьПараметр("Наименование",		Разделить("Арсенал,Ливерпуль,Манчестер Сити,Манчестер Юнайтед,Тоттенхэм,Челси", ","));
	Запрос.УстановитьПараметр("Страна",				Англия());
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать();
КонецПроцедуры

&НаСервере
Функция Англия()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Страны.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Страны КАК Страны
	                      |ГДЕ
	                      |	Страны.Код = &Код");
	Запрос.УстановитьПараметр("Код",				КодАнглия());
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Страны.ПустаяСсылка();
КонецФункции

&НаСервере
Функция КодАнглия()
	Возврат "ENG";
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Лига	= СерверныйФункции.ЛигаСтраны(Англия());
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры
