
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ГрафикиПолучить(КакЭлементы=Ложь)
	мГрафики = Новый Массив;
	Если КакЭлементы Тогда
		мГрафики.Добавить(Элементы.ГрафикРаздельно1);
		мГрафики.Добавить(Элементы.ГрафикРаздельно2);
		мГрафики.Добавить(Элементы.ГрафикРаздельно3);
		мГрафики.Добавить(Элементы.ГрафикРаздельно4);
		мГрафики.Добавить(Элементы.ГрафикРаздельно5);
		мГрафики.Добавить(Элементы.ГрафикРаздельно6);
	Иначе
		мГрафики.Добавить(ГрафикРаздельно1);
		мГрафики.Добавить(ГрафикРаздельно2);
		мГрафики.Добавить(ГрафикРаздельно3);
		мГрафики.Добавить(ГрафикРаздельно4);
		мГрафики.Добавить(ГрафикРаздельно5);
		мГрафики.Добавить(ГрафикРаздельно6);
	КонецЕсли;
	Возврат мГрафики;
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	Если Элементы.ГруппаГрафики.Видимость Тогда
		СерверныйФункции.ГрафикОбновить(График, Отчет.Данные);
		
		мГрафики	= ГрафикиПолучить(Истина);
		_Команды	= Отчет.Чемпионат.Владелец.Команды;
		Для Итератор = 0 По 5 Цикл
			мГрафики.Получить(Итератор).Видимость	= (Итератор < _Команды.Количество());
		КонецЦикла;
		
		мГрафики	= ГрафикиПолучить();
		Итератор	= 0;
		Для Каждого ТекСтрока Из _Команды Цикл
			мГрафики.Получить(Итератор).ОбластьЗаголовка.Текст	= ТекСтрока.Команда;
			СерверныйФункции.ГрафикОбновить(мГрафики.Получить(Итератор), Отчет.Данные.НайтиСтроки(Новый Структура("Команда", ТекСтрока.Команда)));
			Если Итератор = мГрафики.ВГраница() Тогда Прервать; КонецЕсли;
			Итератор	= Итератор + 1;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипГрафикаЗаполнить();
	ТипГрафикаПриИзменении();
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") И Параметр = Отчет.Чемпионат Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Лиги.ЗагрузитьЗначения(ЛигиПолучить());
	Если Параметры.Свойство("Чемпионат") Тогда
		Отчет.Чемпионат	= Параметры.Чемпионат;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		
	ИначеЕсли Параметры.Свойство("Лига") И Параметры.Лига.ОлимпийскаяСистема Тогда
		Отказ	= Истина;
	ИначеЕсли Параметры.Свойство("Лига") Тогда
		Отчет.Чемпионат	= ЧемпионатЛигиПоследний(Параметры.Лига);
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		
	ИначеЕсли НЕ Параметры.Свойство("График") Тогда
		Элементы.ГруппаГрафики.Видимость	= Ложь;
	КонецЕсли;
	
	СерииЗаполнить();
КонецПроцедуры

&НаСервере
Процедура СерииЗаполнить()
	СерверныйФункции.СерииЗаполнить(График);
	Для Каждого Граф Из ГрафикиПолучить() Цикл
		СерверныйФункции.СерииЗаполнить(Граф);
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧемпионатЛигиПоследний(Лига)
	Возврат СерверныйФункции.ЧемпионатЛигиПоследний(Лига);
КонецФункции

&НаСервереБезКонтекста
Функция ЛигиПолучить()
	Возврат СерверныйФункции.ЛигиНациональные();
КонецФункции

&НаКлиенте
Процедура ТипГрафикаЗаполнить()
	Элементы.ТипГрафика.СписокВыбора.Добавить(0, ТипДиаграммы.ГистограммаСНакоплением);
	Элементы.ТипГрафика.СписокВыбора.Добавить(1, ТипДиаграммы.РадарныйГрафикСОбластямиИНакоплением);
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаПриИзменении(Элемент=Неопределено)
	Если ТипГрафика = 1 Тогда
		График.ТипДиаграммы	= ТипДиаграммы.РадарныйГрафикСОбластямиИНакоплением;
	Иначе
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
	КонецЕсли;
КонецПроцедуры
