
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		КомандыЗагрузить();
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет.Команды.Выгрузить().ВыгрузитьКолонку("Команда"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандыЗагрузить()
	Если Отчет.Команды.Количество() = 0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Команды.Ссылка КАК Команда
		                      |ИЗ
		                      |	Справочник.Команды КАК Команды
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
		                      |			ПО Города.Владелец = Страны.Ссылка
		                      |		ПО Команды.Город = Города.Ссылка
		                      |ГДЕ
		                      |	Команды.Наименование В(&Наименование)
		                      |	И Страны.Код = &Код");
		Запрос.УстановитьПараметр("Наименование",		Разделить("Арсенал,Ливерпуль,Манчестер Сити,Манчестер Юнайтед,Тоттенхэм,Челси", ","));
		Запрос.УстановитьПараметр("Код",				"ENG");
		Отчет.Команды.Загрузить(Запрос.Выполнить().Выгрузить());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать();
КонецПроцедуры
