
&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПолучить(Лига, ТипГрафика)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания УБЫВ" + ";
						   |");
	Если ТипГрафика = 0 Или ТипГрафика = 9 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 10 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		                              |	И ТурнирнаяТаблица.КоличествоОчков >= 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 2 Или ТипГрафика = 11 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		                              |	И ТурнирнаяТаблица.КоличествоОчков = 1
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 3 Или ТипГрафика = 12 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		                              |	И ТурнирнаяТаблица.КоличествоОчков = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 4 Или ТипГрафика = 13 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 5 Или ТипГрафика = 14 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 6 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) >= 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 15 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) >= 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 7 Или ТипГрафика = 16 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |	И ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 8 Или ТипГрафика = 17 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур.Владелец В
		                              |			(ВЫБРАТЬ
		                              |				Чемпионаты.Чемпионат
		                              |			ИЗ
		                              |				Чемпионаты)
		                              |	И Противники.КоличествоГолов = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка УБЫВ,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	КонецЕсли;
	Если ТипГрафика = 15 Тогда
		//
	ИначеЕсли ТипГрафика >= 9 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Количество УБЫВ", "Количество");
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	График.Очистить();
	График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ТипГрафика >= 16, 2, 10);
	График.ОбластьЗаголовка.Текст = ?(ТипГрафика = 15, "Меньше - лучше", "");
	
	Максимально	= 0;
	Значения	= Новый Массив;
	ЗначениеК	= ?(ТипГрафика >= 9, 2, Макс(2, Отчет.Лига.КоличествоРотация));
	Количество	= 0;
	Точки		= Новый Соответствие;
	Серии		= Новый Соответствие;
	
	Чемпионаты	= ДанныеПолучить(Отчет.Лига, ТипГрафика);
	Пока Чемпионаты.Следующий() Цикл
		Значения.Очистить();
		Выборка	= Чемпионаты.Выбрать();
		Пока Выборка.Следующий() И Значения.Количество() < 2 Или Выборка.Количество = Количество Цикл
			Максимально = Макс(Максимально, Выборка.Количество);
			Значения.Добавить(Выборка.Количество);
			
			Количество = Выборка.Количество;
		КонецЦикла;
		
		Выборка.Сбросить();
		Пока Выборка.Следующий() И Значения.Найти(Выборка.Количество) <> Неопределено Цикл
			Точка	= Точки.Получить(Выборка.Чемпионат);
			Если Точка = Неопределено Тогда
				Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
				Точка.Расшифровка = Выборка.Чемпионат;
				
				Точки.Вставить(Выборка.Чемпионат, Точка);
			КонецЕсли;
			Серия	= Серии.Получить(Выборка.Серия);
			Если Серия = Неопределено Тогда
				Серия = График.УстановитьСерию(Выборка.Серия);
				Цвет	= Цвет(Выборка.Серия);
				Если ЗначениеЗаполнено(Цвет) Тогда
					Серия.Цвет				= Цвет;
					Серия.ПриоритетЦвета	= Истина;
				КонецЕсли;
				Серия.Расшифровка	= Выборка.Серия;
				
				Серии.Вставить(Выборка.Серия, Серия);
			КонецЕсли;
			График.УстановитьЗначение(Точка, Серия, Выборка.Количество);
		КонецЦикла;
	КонецЦикла;
	График.ОсьЗначений.МаксимальноеЗначение = Окр(Максимально + 5, -1);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
	
	Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Максимальное количество очков");
	Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Максимальное количество побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Максимальное количество ничьих");
	Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Максимальное количество проигрышей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Максимальное количество голов (забито)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(5, "Максимальное количество голов (пропущено)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(6, "Лучшая разница голов");
	Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Максимальное количество 'верховых' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(8, "Максимальное количество 'сухих' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Минимальное количество очков");
	Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Минимальное количество побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Минимальное количество ничьих");
	Элементы.ТипГрафика.СписокВыбора.Добавить(12, "Минимальное количество проигрышей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(13, "Минимальное количество голов (забито)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(14, "Минимальное количество голов (пропущено)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(15, "Худшая разница голов");
	Элементы.ТипГрафика.СписокВыбора.Добавить(16, "Минимальное количество 'верховых' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(17, "Минимальное количество 'сухих' матчей");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Отчет.Лига = МояЛига();
	КонецЕсли;
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Отчет.ТурнирнаяТаблица.Форма");
		Форма.Отчет.Чемпионат = Расшифровка;
		Если Форма.Открыта() Тогда
			Форма.КомандаСформировать();
		КонецЕсли;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции
