
&НаКлиенте
Процедура ТипГрафикаЗагрузить()
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если Элементы.ТипГрафика.СписокВыбора.НайтиПоЗначению(23) <> Неопределено
		Или Элементы.ТипГрафика.СписокВыбора.Количество() = 0
		Тогда
			Элементы.ТипГрафика.СписокВыбора.Очистить();
			Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Количество очков");
			Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Количество 'верховых' побед");
			Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Количество 'низовых' побед");
			Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Количество 'сухих' побед");
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Количество голов забито | пропущено",, БиблиотекаКартинок.Goal);
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Количество 'верховых' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Количество 'сухих' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Разница голов",, БиблиотекаКартинок.Goal);
			
			Элементы.ТипГрафика.СписокВыбора.Добавить(24, "Место в турнирной таблице");
			Элементы.ТипГрафика.СписокВыбора.Добавить(25, "Соотношение очки / матч");
			Элементы.ТипГрафика.СписокВыбора.Добавить(26, "Средняя результативность",, БиблиотекаКартинок.Goal);
			Элементы.ТипГрафика.СписокВыбора.Добавить(27, "Количество голов дома | выезд",, БиблиотекаКартинок.Goal);
			Элементы.ТипГрафика.СписокВыбора.Добавить(28, "Количество побед | ничьих | проигрышей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(29, "Количество 'верховых | низовых' матчей");
			Элементы.ТипГрафика.СписокВыбора.Добавить(30, "Посещаемость");
		КонецЕсли;
	ИначеЕсли Элементы.ТипГрафика.СписокВыбора.НайтиПоЗначению(23) = Неопределено Тогда
		Элементы.ТипГрафика.СписокВыбора.Очистить();
		Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Максимальное количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Максимальное количество побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Максимальное количество 'верховых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Максимальное количество 'низовых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Максимальное количество 'сухих' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(5, "Максимальное количество ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(6, "Максимальное количество проигрышей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Максимальное количество голов (забито)",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(8, "Максимальное количество голов (пропущено)",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Максимальное количество 'верховых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Максимальное количество 'сухих' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Лучшая разница голов",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(12, "Минимальное количество очков");
		Элементы.ТипГрафика.СписокВыбора.Добавить(13, "Минимальное количество побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(14, "Минимальное количество 'верховых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(15, "Максимальное количество 'низовых' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(16, "Максимальное количество 'сухих' побед");
		Элементы.ТипГрафика.СписокВыбора.Добавить(17, "Минимальное количество ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(18, "Минимальное количество проигрышей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(19, "Минимальное количество голов (забито)",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(20, "Минимальное количество голов (пропущено)",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(21, "Минимальное количество 'верховых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(22, "Минимальное количество 'сухих' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(23, "Худшая разница голов",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(24, "Место в турнирной таблице");
		Элементы.ТипГрафика.СписокВыбора.Добавить(25, "Соотношение очки / матч");
		Элементы.ТипГрафика.СписокВыбора.Добавить(26, "Средняя результативность",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(27, "Количество голов дома | выезд",, БиблиотекаКартинок.Goal);
		Элементы.ТипГрафика.СписокВыбора.Добавить(28, "Количество побед | ничьих");
		Элементы.ТипГрафика.СписокВыбора.Добавить(29, "Количество 'верховых | низовых' матчей");
		Элементы.ТипГрафика.СписокВыбора.Добавить(30, "Посещаемость");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПолучить(ТипГрафика, Лига, Команда)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= ЦЕЛ(0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * (КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) - 1))
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Тур КАК Тур,
	      	               |	Чемпионаты.Чемпионат КАК Чемпионат,
	      	               |	Чемпионаты.Точка КАК Точка
	      	               |ПОМЕСТИТЬ Туры
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	      	               |			ПО Туры.Владелец = Чемпионаты.Чемпионат
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка" + ";
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
						   |");
	Если ТипГрафика = 0 Или ТипГрафика = 12 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 13 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 2 Или ТипГрафика = 14 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 3 Или ТипГрафика = 15 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов <= 2
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 4 Или ТипГрафика = 16 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |	И Противники.КоличествоГолов = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 5 Или ТипГрафика = 17 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 6 Или ТипГрафика = 18 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоОчков = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 7 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов), 0) КАК КоличествоЗабито,
		                              |	ЕСТЬNULL(СУММА(Противники.КоличествоГолов), 0) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |			ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |				И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |			И (ТурнирнаяТаблица.Команда = &Команда)
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			МИНИМУМ(Туры.Точка) КАК Точка
		                              |		ИЗ
		                              |			Туры КАК Туры
		                              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |					И (ТурнирнаяТаблица.Команда = &Команда)) КАК ТурыМини
		                              |		ПО Туры.Точка >= ТурыМини.Точка
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			МАКСИМУМ(Туры.Точка) КАК Точка
		                              |		ИЗ
		                              |			Туры КАК Туры
		                              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |					И (ТурнирнаяТаблица.Команда = &Команда)) КАК ТурыМакс
		                              |		ПО Туры.Точка <= ТурыМакс.Точка
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 7 Или ТипГрафика = 19 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 8 Или ТипГрафика = 20 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 9 Или ТипГрафика = 21 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 10 Или ТипГрафика = 22 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |			ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |				И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |ГДЕ
		                              |	Противники.КоличествоГолов = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 11 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 11 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 23 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 24 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ТурнирнаяТаблица.Команда = &Команда КАК Пометка,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков > ЕСТЬNULL(Противники.КоличествоОчков, 0)
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Выигрыш,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = ЕСТЬNULL(Противники.КоличествоОчков, -1)
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Ничья,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков < ЕСТЬNULL(Противники.КоличествоОчков, -1)
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Проигрыш,
		                              |	ЕСТЬNULL(СУММА(Противники.КоличествоГолов), 0) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) - ЕСТЬNULL(СУММА(Противники.КоличествоГолов), 0) УБЫВ,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) УБЫВ,
		                              |	Выигрыш УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	МАКСИМУМ(Пометка)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли (ТипГрафика = 25 Или ТипГрафика = 26) И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоОчков), 0) КАК КоличествоОчков,
		                              |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов), 0) КАК КоличествоГолов,
		                              |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор), 0) КАК Количество
		                              |ПОМЕСТИТЬ ТурнирнаяТаблица
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |			И (ТурнирнаяТаблица.Команда = &Команда)
		                              |			И (ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч)
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			МИНИМУМ(Туры.Точка) КАК Точка
		                              |		ИЗ
		                              |			Туры КАК Туры
		                              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |					И (ТурнирнаяТаблица.Команда = &Команда)) КАК ТурыМини
		                              |		ПО Туры.Точка >= ТурыМини.Точка
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                              |			МАКСИМУМ(Туры.Точка) КАК Точка
		                              |		ИЗ
		                              |			Туры КАК Туры
		                              |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |					И (ТурнирнаяТаблица.Команда = &Команда)) КАК ТурыМакс
		                              |		ПО Туры.Точка <= ТурыМакс.Точка
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |;
		                              |
		                              |////////////////////////////////////////////////////////////////////////////////
		                              |ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Чемпионат КАК Чемпионат,
		                              |	ТурнирнаяТаблица.Точка КАК Точка,
		                              |	ИСТИНА КАК Пометка,
		                              |	ВЫБОР
		                              |		КОГДА ТурнирнаяТаблица.Количество = 0
		                              |			ТОГДА 0
		                              |		ИНАЧЕ ОКР(ТурнирнаяТаблица.КоличествоОчков / ТурнирнаяТаблица.Количество, 2)
		                              |	КОНЕЦ КАК КоличествоОчков,
		                              |	ВЫБОР
		                              |		КОГДА ТурнирнаяТаблица.Количество = 0
		                              |			ТОГДА 0
		                              |		ИНАЧЕ ОКР(ТурнирнаяТаблица.КоличествоГолов / ТурнирнаяТаблица.Количество, 2)
		                              |	КОНЕЦ КАК КоличествоГолов
		                              |ИЗ
		                              |	ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 25 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ОКР(СУММА(ТурнирнаяТаблица.КоличествоОчков) / СУММА(1), 2) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 26 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	ОКР(СУММА(ТурнирнаяТаблица.КоличествоГолов) / СУММА(1), 2) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	МАКСИМУМ(Точка),
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 27 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |			ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |				И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |			И (ТурнирнаяТаблица.Команда = &Команда)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 27 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА 0
		                              |			ИНАЧЕ ТурнирнаяТаблица.КоличествоГолов
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 28 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Количество,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |			ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |				И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |			И (ТурнирнаяТаблица.Команда = &Команда)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 28 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 29 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов < 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |			ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |				И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |		ПО Туры.Тур = ТурнирнаяТаблица.Тур
		                              |			И (ТурнирнаяТаблица.Команда = &Команда)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 29 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		                              |		ПО ТурнирнаяТаблица.Тур = Туры.Тур
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 30 И ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ЕСТЬNULL(Матч.КоличествоЗрителей, 0)) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей ЕСТЬ NULL
		                              |				ТОГДА ЕСТЬNULL(Стадионы.КоличествоЗрителей, 0)
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей > Матч.КоличествоЗрителей
		                              |				ТОГДА Матч.Стадион.КоличествоЗрителей - Матч.КоличествоЗрителей
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
		                              |				ПО ТурнирнаяТаблица.Команда = Стадионы.Владелец
		                              |			ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		                              |				И (ТурнирнаяТаблица.Команда = &Команда)
		                              |				И (ТурнирнаяТаблица.НомерСтроки = 1)
		                              |		ПО Туры.Тур = Матч.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 30 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	Туры.Чемпионат КАК Чемпионат,
		                              |	Туры.Точка КАК Точка,
		                              |	СУММА(ЕСТЬNULL(Матч.КоличествоЗрителей, 0)) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей ЕСТЬ NULL
		                              |				ТОГДА ЕСТЬNULL(Стадионы.КоличествоЗрителей, 0)
		                              |			КОГДА Матч.Стадион.КоличествоЗрителей > Матч.КоличествоЗрителей
		                              |				ТОГДА Матч.Стадион.КоличествоЗрителей - Матч.КоличествоЗрителей
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	Туры КАК Туры
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		                              |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |				ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
		                              |				ПО ТурнирнаяТаблица.Команда = Стадионы.Владелец
		                              |			ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		                              |				И (ТурнирнаяТаблица.НомерСтроки = 1)
		                              |		ПО Туры.Тур = Матч.Тур
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	Туры.Чемпионат,
		                              |	Туры.Точка
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	КонецЕсли;
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "11", "21");
	ИначеЕсли ТипГрафика >= 23 Тогда
		//
	ИначеЕсли ТипГрафика >= 12 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Количество УБЫВ", "Количество");
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",			Лига);
	Запрос.УстановитьПараметр("Команда",		Команда);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	Отчет.Данные.Очистить();
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда Возврат; КонецЕсли;
	
	График.ВидПодписей	= ВидПодписейКДиаграмме.Нет;
	График.ОбластьЗаголовка.Текст = ?(Разделить("18 20 23 24").Найти(ФорматЧГ(ТипГрафика)) = Неопределено, "", "Меньше - лучше");
	График.ОбластьЛегенды.Расположение = ?(ЗначениеЗаполнено(Отчет.Команда) И СтрНайти("0,2,3,4,9,10,11,24,25,26", ТипГрафика) > 0, РасположениеЛегендыДиаграммы.Нет, РасположениеЛегендыДиаграммы.Авто);
	График.ОбластьПостроения.ШкалаЗначений.ТекстЗаголовка = ?(ТипГрафика = 30, "Зрители", "");
	Если ТипГрафика >= 27 Тогда
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ТипГрафика = 27, 50, ?(ТипГрафика = 28 Или ТипГрафика = 29, 20, 0));
		График.ВидПодписей	= ВидПодписейКДиаграмме.Процент;
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда)
	И ТипГрафика = 7
	Тогда
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = 10;
		График.ВидПодписей	= ВидПодписейКДиаграмме.Процент;
	Иначе
		График.ТипДиаграммы	= ТипДиаграммы.Гистограмма;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ТипГрафика = 25, 0.5, ?(СтрНайти("0,7,8,11,12,19,20,23", ТипГрафика) > 0, 10, 2));
	КонецЕсли;
	
	Чемпионаты	= ДанныеПолучить(ТипГрафика, Отчет.Лига, Отчет.Команда);
	Максимально	= 0;
	Если Чемпионаты.Количество() = 0 Тогда
		Возврат;
	ИначеЕсли ТипГрафика >= 27 Тогда
		Если ТипГрафика = 27 Тогда
			Хозяева	= График.УстановитьСерию("Хозяева");
			Гости	= График.УстановитьСерию("Гости");
		ИначеЕсли ТипГрафика = 28 И ЗначениеЗаполнено(Отчет.Команда) Тогда
			СерверныйФункции.СерииЗаполнить(График);
		ИначеЕсли ТипГрафика = 28 Тогда
			Хозяева	= График.УстановитьСерию("Ничья");
			Гости	= График.УстановитьСерию("Победа");
		ИначеЕсли ТипГрафика = 29 Тогда
			Хозяева	= График.УстановитьСерию("ТБ 2.5");
			Гости	= График.УстановитьСерию("ТМ 2.5");
		Иначе
			Хозяева	= График.УстановитьСерию("Факт");
			Гости	= График.УстановитьСерию("План");
		КонецЕсли;
		Пока Чемпионаты.Следующий() Цикл
			Если График.Точки.Количество() > 0 Тогда
			ИначеЕсли НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
			ИначеЕсли ТипГрафика = 27 И Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено = 0 Тогда Продолжить;
			ИначеЕсли ТипГрафика = 28 И Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено + Чемпионаты.Количество = 0 Тогда Продолжить;
			ИначеЕсли ТипГрафика = 29 И Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено = 0 Тогда Продолжить;
			ИначеЕсли ТипГрафика = 30 И Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено = 0 Тогда Продолжить;
			КонецЕсли;
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			Если ТипГрафика = 28 И ЗначениеЗаполнено(Отчет.Команда) Тогда
				График.УстановитьЗначение(Точка, 0, Чемпионаты.КоличествоПропущено);
				График.УстановитьЗначение(Точка, 1, Чемпионаты.Количество);
				График.УстановитьЗначение(Точка, 2, Чемпионаты.КоличествоЗабито);
				
				Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено + Чемпионаты.Количество);
			Иначе
				График.УстановитьЗначение(Точка, Хозяева, Чемпионаты.КоличествоЗабито);
				График.УстановитьЗначение(Точка, Гости, Чемпионаты.КоличествоПропущено);
				
				Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда)
	И ТипГрафика = 7
	Тогда
		СерверныйФункции.СерииЗаполнить(График, Истина);
		Пока Чемпионаты.Следующий() Цикл
			//Если График.Точки.Количество() = 0 И Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено = 0 Тогда Продолжить; КонецЕсли;
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			График.УстановитьЗначение(Точка, 0, Чемпионаты.КоличествоЗабито);
			График.УстановитьЗначение(Точка, 1, Чемпионаты.КоличествоПропущено);
			
			Максимально = Макс(Максимально, Чемпионаты.КоличествоЗабито + Чемпионаты.КоличествоПропущено);
		КонецЦикла;
		
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда)
	И (ТипГрафика = 25 Или ТипГрафика = 26)
	Тогда
		Серия = График.УстановитьСерию(Отчет.Команда);
		Цвет	= Цвет(Отчет.Команда);
		Если ЗначениеЗаполнено(Цвет) Тогда
			Серия.Цвет				= Цвет;
		КонецЕсли;
		Пока Чемпионаты.Следующий() Цикл
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			График.УстановитьЗначение(Точка, 0, ?(ТипГрафика = 25, Чемпионаты.КоличествоОчков, Чемпионаты.КоличествоГолов));
			
			Максимально = Макс(Максимально, ?(ТипГрафика = 25, Чемпионаты.КоличествоОчков, Чемпионаты.КоличествоГолов));
		КонецЦикла;
		
	Иначе
		Значения	= Новый Массив;
		Точки		= Новый Соответствие;
		Серии		= Новый Соответствие;
		
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Новый Структура("Серия", Отчет.Команда));
			Пока Чемпионаты.Следующий() Цикл
				Если График.Точки.Количество() > 0 Тогда
				ИначеЕсли ТипГрафика = 0 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 2 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 3 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 4 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 9 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 10 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 11 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				ИначеЕсли ТипГрафика = 24 И НЕ Чемпионаты.Пометка Тогда Продолжить;
				КонецЕсли;
				Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
				Точка.Расшифровка = Чемпионаты.Чемпионат;
				
				Точки.Вставить(Чемпионаты.Чемпионат, Точка);
			КонецЦикла;
		Иначе
			ЗначениеК	= ?(ТипГрафика <= 11 Или ТипГрафика >= 23, 2, 1);
			Пока Чемпионаты.Следующий() Цикл
				Значения.Очистить();
				Количество	= 0;
				
				Выборка	= Чемпионаты.Выбрать();
				Пока Выборка.Следующий() И Значения.Количество() < ЗначениеК Или Выборка.Количество = Количество Цикл
					Значения.Добавить(Выборка.Количество);
					Количество = Выборка.Количество;
					
					Если Отчет.Данные.НайтиСтроки(Новый Структура("Серия", Выборка.Серия)).Количество() = 0 Тогда
						ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
					КонецЕсли;
					Точка	= Точки.Получить(Выборка.Чемпионат);
					Если Точка = Неопределено Тогда
						Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
						Точка.Расшифровка = Выборка.Чемпионат;
						
						Точки.Вставить(Выборка.Чемпионат, Точка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			Отчет.Данные.Сортировать("Серия");
		КонецЕсли;
		
		Для Каждого ТекСтрока Из Отчет.Данные Цикл
			Серия = График.УстановитьСерию(ТекСтрока.Серия);
			Цвет	= Цвет(ТекСтрока.Серия);
			Если ЗначениеЗаполнено(Цвет) Тогда
				Серия.Цвет				= Цвет;
				Серия.ПриоритетЦвета	= Истина;
			КонецЕсли;
			Серия.Расшифровка	= ТекСтрока.Серия;
			
			Серии.Вставить(ТекСтрока.Серия, Серия);
		КонецЦикла;
		
		Чемпионаты.Сбросить();
		Пока Чемпионаты.Следующий() Цикл
			Количество	= 0;
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() Цикл
				Количество	= Количество + 1;
				Серия	= Серии.Получить(Выборка.Серия);
				Если Серия = Неопределено Тогда Продолжить;
				КонецЕсли;
				
				График.УстановитьЗначение(Точки.Получить(Выборка.Чемпионат), Серия, ?(ТипГрафика = 24, Количество, Выборка.Количество));
				
				Максимально = Макс(Максимально, ?(ТипГрафика = 24, Количество, Выборка.Количество));
				
				Если ЗначениеЗаполнено(Отчет.Команда) Тогда Прервать; КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	График.ОсьЗначений.МаксимальноеЗначение = ?(Максимально <= 40, Максимально, ?(ТипГрафика = 30, Окр(Максимально + 500, -3), Окр(Максимально + 5, -1)));
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЛигиЗагрузить()
	//Лиги.Очистить();
	//Элементы.Лига.СписокВыбора.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец КАК Ссылка
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) УБЫВ");
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Элементы.Лига.СписокВыбора.Количество() < 11 Тогда
			Элементы.Лига.СписокВыбора.Добавить(Выборка.Ссылка);
		КонецЕсли;
		Лиги.Добавить(Выборка.Ссылка);
	КонецЦикла;
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Лига.СписокВыбора);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЛигиЗагрузить();
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Лига = МояЛига();
		Если Лиги.НайтиПоЗначению(Лига) <> Неопределено Тогда
			Отчет.Лига = Лига;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		КлубыЗагрузить();
	КонецЕсли;
	ТипГрафикаЗагрузить();
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Отчет.ТурнирнаяТаблица.Форма");
		Форма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		Форма.Отчет.Чемпионат = Расшифровка;
		Если Форма.Открыта() Тогда
			Форма.КомандаСформировать();
		КонецЕсли;
		Форма.Открыть();
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды")
	И НЕ ЗначениеЗаполнено(Отчет.Команда)
	Тогда
		СтандартнаяОбработка = Ложь;
		
		Отчет.Команда = Расшифровка;
		Сформировать();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции

&НаКлиенте
Процедура КомандаОчистка(Элемент, СтандартнаяОбработка)
	Клубы.Очистить();
	
	ТипГрафикаЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлубыПолучить(Лига)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 21
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец В
	      	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |				Чемпионаты.Чемпионат
	      	               |			ИЗ
	      	               |				Чемпионаты)");
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура КомандаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		Если Клубы.Количество() = 0 Тогда
			мКоманды = КлубыПолучить(Отчет.Лига);
			//КлубыЗагрузить(мКоманды);
		Иначе
			мКоманды = Клубы.ВыгрузитьЗначения();
		КонецЕсли;
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Справочник.Команды.ФормаВыбора", Новый Структура("Отбор", Новый Структура("Ссылка", мКоманды)), Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КлубыЗагрузить(мКоманды=Неопределено)
	Если Клубы.Количество() = 0 Или ТипЗнч(мКоманды) = Тип("Массив") Тогда
		Если мКоманды = Неопределено Тогда мКоманды = КлубыПолучить(Отчет.Лига); КонецЕсли;
		Клубы.ЗагрузитьЗначения(мКоманды);
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(СерверныйФункции.КомандыЛиги(Отчет.Лига, Истина));
		ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	Отчет.Команда = Неопределено;
	Клубы.Очистить();
	КлубыЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ТипГрафикаЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ТипГрафикаЗагрузить();
КонецПроцедуры
