
&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервереБезКонтекста
Функция ДанныеПолучить(Лига, ТипГрафика)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 0.62 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Тур КАК Тур
	      	               |ПОМЕСТИТЬ Туры
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец В
	      	               |			(ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |				Чемпионаты.Чемпионат
	      	               |			ИЗ
	      	               |				Чемпионаты)
	      	               |	И ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ЛОЖЬ" + ";
						   |");
	Если ТипГрафика = 0 Или ТипГрафика = 12 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 13 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 2 Или ТипГрафика = 14 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 3 Или ТипГрафика = 15 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоГолов <= 2
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 4 Или ТипГрафика = 16 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И Противники.КоличествоГолов = 0
		                              |	И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 5 Или ТипГрафика = 17 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 6 Или ТипГрафика = 18 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоОчков = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 7 Или ТипГрафика = 19 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 8 Или ТипГрафика = 20 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 11 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов - Противники.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 23 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |ИМЕЮЩИЕ
		                              |	СУММА(Противники.КоличествоГолов - ТурнирнаяТаблица.КоличествоГолов) > 0
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 9 Или ТипГрафика = 21 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.КоличествоГолов >= 3
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 10 Или ТипГрафика = 22 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(1) КАК Количество
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И Противники.КоличествоГолов = 0
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат";
	ИначеЕсли ТипГрафика = 24 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	ТурнирнаяТаблица.Команда КАК Серия,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК Количество,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА Противник.КоличествоОчков = 0
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Выигрыш,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Ничья,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК Проигрыш,
		                              |	ЕСТЬNULL(СУММА(Противник.КоличествоГолов), 0) КАК КоличествоПропущено,
		                              |	СУММА(ТурнирнаяТаблица.КоличествоГолов) - ЕСТЬNULL(СУММА(Противник.КоличествоГолов), 0) КАК Разница
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ТурнирнаяТаблица.Команда,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка,
		                              |	Количество УБЫВ,
		                              |	Разница УБЫВ,
		                              |	КоличествоЗабито УБЫВ,
		                              |	Выигрыш УБЫВ,
		                              |	Серия
		                              |ИТОГИ
		                              |	СУММА(Количество)
		                              |ПО
		                              |	Чемпионат
		                              |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 25 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		                              |				ТОГДА 0
		                              |			ИНАЧЕ ТурнирнаяТаблица.КоличествоГолов
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 26 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противники.КоличествоОчков
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	ИначеЕсли ТипГрафика = 27 Тогда
		Запрос.Текст = Запрос.Текст + "ВЫБРАТЬ
		                              |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 1
		                              |			ИНАЧЕ 0
		                              |		КОНЕЦ) КАК КоличествоЗабито,
		                              |	СУММА(ВЫБОР
		                              |			КОГДА ТурнирнаяТаблица.КоличествоГолов + Противники.КоличествоГолов >= 3
		                              |				ТОГДА 0
		                              |			ИНАЧЕ 1
		                              |		КОНЕЦ) КАК КоличествоПропущено
		                              |ИЗ
		                              |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                              |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		                              |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		                              |ГДЕ
		                              |	ТурнирнаяТаблица.Тур В
		                              |			(ВЫБРАТЬ
		                              |				Туры.Тур
		                              |			ИЗ
		                              |				Туры)
		                              |	И ТурнирнаяТаблица.НомерСтроки = 1
		                              |	И Противники.НомерСтроки = 2
		                              |
		                              |СГРУППИРОВАТЬ ПО
		                              |	ТурнирнаяТаблица.Тур.Владелец,
		                              |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		                              |
		                              |УПОРЯДОЧИТЬ ПО
		                              |	Точка";
	КонецЕсли;
	Если ТипГрафика >= 23 Тогда
		//
	ИначеЕсли ТипГрафика >= 12 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "Количество УБЫВ", "Количество");
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	График.Очистить();
	Если ТипГрафика >= 25 Тогда
		График.ТипДиаграммы	= ТипДиаграммы.ГистограммаСНакоплением;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ТипГрафика = 25, 100, 0);
		График.ОбластьЗаголовка.Текст = "";
		График.ВидПодписей	= ВидПодписейКДиаграмме.Процент;
	Иначе
		График.ТипДиаграммы	= ТипДиаграммы.Гистограмма;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(СтрНайти("0,7,8,11,12,19,20,23", ТипГрафика) > 0, 10, 2);
		График.ОбластьЗаголовка.Текст = ?(СтрНайти("18,20,23,24", ТипГрафика) = 0, "", "Меньше - лучше");
		График.ВидПодписей	= ВидПодписейКДиаграмме.Нет;
	КонецЕсли;
	
	Чемпионаты	= ДанныеПолучить(Отчет.Лига, ТипГрафика);
	Если ТипГрафика >= 25 Тогда
		Если ТипГрафика = 25 Тогда
			Хозяева	= График.УстановитьСерию("Хозяева");
			Гости	= График.УстановитьСерию("Гости");
		ИначеЕсли ТипГрафика = 26 Тогда
			Хозяева	= График.УстановитьСерию("Ничья");
			Гости	= График.УстановитьСерию("Победа");
		Иначе	//Если ТипГрафика = 27 Тогда
			Хозяева	= График.УстановитьСерию("ТБ 2.5");
			Гости	= График.УстановитьСерию("ТМ 2.5");
		КонецЕсли;
		Пока Чемпионаты.Следующий() Цикл
			Точка = График.УстановитьТочку(ФорматЧГ(Чемпионаты.Точка));
			Точка.Расшифровка = Чемпионаты.Чемпионат;
			График.УстановитьЗначение(Точка, Хозяева, Чемпионаты.КоличествоЗабито);
			График.УстановитьЗначение(Точка, Гости, Чемпионаты.КоличествоПропущено);
		КонецЦикла;
	Иначе
		Максимально	= 0;
		Значения	= Новый Массив;
		ЗначениеК	= ?(ТипГрафика <= 11 Или ТипГрафика = 23, 2, 1);
		Количество	= 0;
		Точки		= Новый Соответствие;
		Серии		= Новый Соответствие;
		
		Пока Чемпионаты.Следующий() Цикл
			Значения.Очистить();
			
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() И Значения.Количество() < ЗначениеК Или Выборка.Количество = Количество Цикл
				Значения.Добавить(Выборка.Количество);
				
				Если Отчет.Данные.НайтиСтроки(Новый Структура("Серия", Выборка.Серия)).Количество() = 0 Тогда
					ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
				КонецЕсли;
				Количество = Выборка.Количество;
			КонецЦикла;
		КонецЦикла;
		Чемпионаты.Сбросить();
		Отчет.Данные.Сортировать("Серия");
		Для Каждого ТекСтрока Из Отчет.Данные Цикл
			Серия = График.УстановитьСерию(ТекСтрока.Серия);
			Цвет	= Цвет(ТекСтрока.Серия);
			Если ЗначениеЗаполнено(Цвет) Тогда
				Серия.Цвет				= Цвет;
				Серия.ПриоритетЦвета	= Истина;
			КонецЕсли;
			Серия.Расшифровка	= ТекСтрока.Серия;
			
			Серии.Вставить(ТекСтрока.Серия, Серия);
		КонецЦикла;
		
		Пока Чемпионаты.Следующий() Цикл
			Количество	= 0;
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() Цикл
				Количество	= Количество + 1;
				Серия	= Серии.Получить(Выборка.Серия);
				Если Серия = Неопределено Тогда Продолжить; КонецЕсли;
				
				Точка	= Точки.Получить(Выборка.Чемпионат);
				Если Точка = Неопределено Тогда
					Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
					Точка.Расшифровка = Выборка.Чемпионат;
					
					Точки.Вставить(Выборка.Чемпионат, Точка);
				КонецЕсли;
				График.УстановитьЗначение(Точка, Серия, ?(ТипГрафика = 24, Количество, Выборка.Количество));
				
				Максимально = Макс(Максимально, ?(ТипГрафика = 24, Количество, Выборка.Количество));
			КонецЦикла;
		КонецЦикла;
		График.ОсьЗначений.МаксимальноеЗначение = Окр(Максимально + 5, -1);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
	
	Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Максимальное количество очков");
	Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Максимальное количество побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(2, "Максимальное количество 'верховых' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(3, "Максимальное количество 'низовых' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Максимальное количество 'сухих' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(5, "Максимальное количество ничьих");
	Элементы.ТипГрафика.СписокВыбора.Добавить(6, "Максимальное количество проигрышей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(7, "Максимальное количество голов (забито)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(8, "Максимальное количество голов (пропущено)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(9, "Максимальное количество 'верховых' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(10, "Максимальное количество 'сухих' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(11, "Лучшая разница голов");
	Элементы.ТипГрафика.СписокВыбора.Добавить(12, "Минимальное количество очков");
	Элементы.ТипГрафика.СписокВыбора.Добавить(13, "Минимальное количество побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(14, "Минимальное количество 'верховых' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(15, "Максимальное количество 'низовых' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(16, "Максимальное количество 'сухих' побед");
	Элементы.ТипГрафика.СписокВыбора.Добавить(17, "Минимальное количество ничьих");
	Элементы.ТипГрафика.СписокВыбора.Добавить(18, "Минимальное количество проигрышей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(19, "Минимальное количество голов (забито)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(20, "Минимальное количество голов (пропущено)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(21, "Минимальное количество 'верховых' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(22, "Минимальное количество 'сухих' матчей");
	Элементы.ТипГрафика.СписокВыбора.Добавить(23, "Худшая разница голов");
	Элементы.ТипГрафика.СписокВыбора.Добавить(24, "Место в турнирной таблице");
	Элементы.ТипГрафика.СписокВыбора.Добавить(25, "Количество голов (дома/выезд)");
	Элементы.ТипГрафика.СписокВыбора.Добавить(26, "Количество побед/ничьих");
	Элементы.ТипГрафика.СписокВыбора.Добавить(27, "Количество 'верховых/низовых' матчей");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Отчет.Лига = МояЛига();
	КонецЕсли;
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		СтандартнаяОбработка = Ложь;
		
		Форма = ПолучитьФорму("Отчет.ТурнирнаяТаблица.Форма");
		Форма.Отчет.Чемпионат = Расшифровка;
		Если Форма.Открыта() Тогда
			Форма.КомандаСформировать();
		КонецЕсли;
		Форма.Открыть();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции
