
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НачатьПолучениеКаталогаВременныхФайлов(Новый ОписаниеОповещения("КаталогаФайловУстановить", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура Закрытие() Экспорт
	Если Открыта() Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КаталогаФайловУстановить(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры=Неопределено) Экспорт
	КаталогаФайловУстановитьНаСервере(ИмяКаталогаВременныхФайлов);
	ПодключитьОбработчикОжидания("Закрытие", 1);
КонецПроцедуры

&НаСервере
Процедура КаталогаФайловУстановитьНаСервере(ИмяКаталогаВременныхФайлов)
	ПараметрыСеанса.КаталогаФайлов	= ИмяКаталогаВременныхФайлов;
КонецПроцедуры
