
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ФотоПолучитьНаСервере()
	Элемент	= Кеш.НайтиПоЗначению(Текущий);
	Если Элемент = Неопределено Тогда
		Изображение	= СерверныйФункции.ИзображениеПолучить(Текущий);
		Кеш.Добавить(Текущий, Изображение);
	Иначе
		Изображение	= Элемент.Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	ТекущиеДанные	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Изображение	= "";
		Текущий = Неопределено;
	ИначеЕсли Текущий = ТекущиеДанные.Ссылка Тогда
		Если Кеш.НайтиПоЗначению(Текущий) = Неопределено Тогда
			ФотоПолучитьНаСервере();
		КонецЕсли;
	Иначе
		Текущий = ТекущиеДанные.Ссылка;
		ФотоПолучитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки") Тогда
		Виктим = Кеш.НайтиПоЗначению(Параметр);
		Если Виктим <> Неопределено Тогда
			Кеш.Удалить(Виктим);
		КонецЕсли;
		Если Текущий = Параметр Тогда
			ФотоПолучить();
			Элементы.Изображение.Обновить();
		КонецЕсли;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
