
&НаСервере
Процедура СформироватьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьУстановить();
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка	= Ложь;
	Значение	= РезультатРасшифровки(Расшифровка);
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Команды") Тогда
		НаКлиенте.Показать(Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	ЭлементПриИзменении(Элемент);
	ДоступностьУстановить();
КонецПроцедуры

&НаСервере
Процедура ДоступностьУстановить()
	Элементы.Топ.Доступность	= (НЕ Отчет.Лига.ОлимпийскаяСистема);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите лигу", Отказ,, "Отчет.Лига");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	ОбщегоНазначения.СостояниеОтобразить(Элементы.Результат.ОтображениеСостояния);
КонецПроцедуры
