
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Ссылка = Следующий(ПараметрКоманды);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОткрытьФорму("Справочник.Туры.ФормаОбъекта", Новый Структура("Ключ", Ссылка), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Следующий(Ссылка)
	Отчет	= Справочники.Туры.ПустаяСсылка();
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	Туры.Ссылка КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Туры КАК Туры
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры1
	      	               |		ПО Туры.Владелец = Туры1.Владелец
	      	               |ГДЕ
	      	               |	Туры1.Ссылка = &Ссылка
	      	               |	И Туры1.Код < Туры.Код
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Туры.Код,
	      	               |	Туры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Ссылка",				Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Отчет = Выборка.Ссылка;
	КонецЕсли;
	Возврат Отчет;
КонецФункции
