
&НаКлиенте
Процедура ТикТак() Экспорт
	Таймер = Финиш - ТекущаяДата();
	Если Финиш <= ТекущаяДата() Тогда
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Если СтрСравнить(Вычислить(Элемент.Имя), Вопросы.НайтиПоЗначению(ТекущийВопрос).Представление) = 0 Тогда
		ПравильныхОтветов	= ПравильныхОтветов + 1;
	КонецЕсли;
	ОсталосьВопросов	= ОсталосьВопросов - 1;
	
	Было.Добавить(ТекущийВопрос);
	
	Если ОсталосьВопросов = 0 Тогда
		Стоп();
	ИначеЕсли ВопросУстановить() Тогда
		Таймер 	= Финиш - ТекущаяДата();
		ОтветыОбновить();
	Иначе
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеПолучить(Ссылка, КакЕсть=Ложь)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка, КакЕсть);
КонецФункции

&НаСервере
Функция ВопросУстановить()
	ВопросСледующий = Неопределено;
	Если НЕ ЗначениеЗаполнено(ВопросСледующий) Тогда
		Для Каждого Элемент Из Вопросы Цикл
			Если ПустаяСтрока(Элемент.Представление) Тогда
				ВопросСледующий = Элемент.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВопросСледующий) Тогда
		ТекущийВопрос	= ВопросСледующий;
		ВопросТекст		= ТекущийВопрос.ПолноеНаименование();
	Иначе
		ТекущийВопрос	= Неопределено;
		ВопросТекст		= "";
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ТекущийВопрос);
КонецФункции

&НаСервере
Процедура ОтветыОбновить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Ответ0	= "";
	Ответ1	= "";
	Ответ2	= "";
	Ответ3	= "";
	Ответ4	= "";
	Ответ5	= "";
	ОтветыКнопки = Новый Массив;
	ОтветыКнопки.Добавить(Элементы.Ответ0);
	ОтветыКнопки.Добавить(Элементы.Ответ1);
	ОтветыКнопки.Добавить(Элементы.Ответ2);
	ОтветыКнопки.Добавить(Элементы.Ответ3);
	ОтветыКнопки.Добавить(Элементы.Ответ4);
	ОтветыКнопки.Добавить(Элементы.Ответ5);
	Для Каждого ЭлементХ Из ОтветыКнопки Цикл
		ЭлементХ.Видимость	= Ложь;
	КонецЦикла;
	
	Вопросник	= ГС.СлучайноеЧисло(0, 5);
	Пронто		= Новый Массив;
	Для НомерСтроки = 0 По 5 Цикл
		Кнопка		= ОтветыКнопки.Получить(НомерСтроки);
		Реквизит	= Кнопка.ПутьКДанным;
		Если Вопросник = НомерСтроки Тогда
			Изо	= ИзображениеПолучить(ТекущийВопрос);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Реквизит, Изо));
			Элемент = Вопросы.НайтиПоЗначению(ТекущийВопрос);
			Элемент.Представление	= Изо;
		Иначе
			Виктим		= Неопределено;
			Ответы.СортироватьПоПредставлению();
			Итератор	= Ответы.Количество();
			Пока Виктим = Неопределено Цикл
				Для Каждого Элемент Из Ответы Цикл
					Если Пронто.Найти(Элемент.Значение) <> Неопределено Тогда
						//
					ИначеЕсли Итератор <= Вопросник Тогда
						Виктим	= Элемент;
						Прервать;
					КонецЕсли;
					Итератор = Итератор - 1.7 * Макс(1, Секунда(ТекущаяДатаСеанса()));
				КонецЦикла;
			КонецЦикла;
			Изо	= ИзображениеПолучить(Виктим.Значение);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Реквизит, Изо));
			Виктим.Представление = Изо;
			
			Пронто.Добавить(Виктим.Значение);
		КонецЕсли;
		Кнопка.Видимость		= Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтарт(Команда)
	Старт();
	ВидимостьУстановить();
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить()
	Элементы.СтраницаНачало.Видимость	= (Шаг < 1);
	Элементы.СтраницаТест.Видимость		= (Шаг = 1);
	Элементы.СтраницаФиниш.Видимость	= (Шаг > 1);
КонецПроцедуры

&НаКлиенте
Процедура Старт()
	Если Было.Количество() > 99 Тогда
		Было.Очистить();
		Было.Добавить(МояКоманда());
	КонецЕсли;
	Вопросы.Очистить();
	Ответы.Очистить();
	Если ВопросыОтветыПолучить() Тогда
		Шаг	= 1;
		Вопрошать();

		ПравильныхОтветов	= 0;
		КоличествоВопросов	= Вопросы.Количество();
		ОсталосьВопросов	= КоличествоВопросов;
		Элементы.ОсталосьВопросов.МаксимальноеЗначение	= КоличествоВопросов;
		Таймер				= Макс(60, КоличествоВопросов * 10.1);
		Элементы.Таймер.МаксимальноеЗначение			= Таймер;
		Финиш				= ТекущаяДата() + Таймер;
		
		ПодключитьОбработчикОжидания("ТикТак", 5);
	Иначе
		Сообщить("Ошибка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Стоп()
	ОтключитьОбработчикОжидания("ТикТак");
	Шаг		= 2;
	ВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура Вопрошать() Экспорт
	Если Шаг = 1 Тогда
		Если ВопросУстановить() Тогда
			ОтветыОбновить();
		Иначе
			Шаг = 9;
		КонецЕсли;
	КонецЕсли;
	ВидимостьУстановить();
КонецПроцедуры

&НаСервере
Функция ВопросыОтветыПолучить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 99
	                      |	Команды.Ссылка КАК Ссылка,
	                      |	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ТурнирнаяТаблица.Период, МЕСЯЦ)), &Дата) КАК Период
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Команды.Ссылка = ТурнирнаяТаблица.Команда
	                      |ГДЕ
	                      |	Команды.ПометкаУдаления = ЛОЖЬ
	                      |	И РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) >= 64
	                      |	И НЕ Команды.Ссылка В (&Исключения)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Команды.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	
	Запрос.УстановитьПараметр("Дата",				ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Исключения",			Было.ВыгрузитьЗначения());
	Если ГС.СлучайноеЧисло(0, 2) = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "");
	КонецЕсли;
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Картинка = ИзображениеПолучить(Выборка.Ссылка, Истина);
		//Если Картинка.Вид = ВидКартинки.Пустая Тогда
		//	Продолжить;
		//КонецЕсли;
		Если Вопросы.Количество() < 10 Тогда
			Вопросы.Добавить(Выборка.Ссылка);
		Иначе
			Ответы.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат (Ответы.Количество() > 0);
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Шаг = 1 Тогда
		Отказ	= Истина;
		Стоп();
	ИначеЕсли Шаг = 2 Тогда
		Отказ	= Истина;
		Шаг		= 0;
		ВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
