
&НаКлиенте
Процедура ТикТак() Экспорт
	Таймер = Финиш - ТекущаяДата();
	Если Финиш <= ТекущаяДата() Тогда
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтветНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	
	Было.Добавить(ТекущийВопрос);
	
	Если СтрСравнить(Вычислить(Элемент.Имя), Вопросы.НайтиПоЗначению(ТекущийВопрос).Представление) = 0 Тогда
		ПравильныхОтветов	= ПравильныхОтветов + 1;
	КонецЕсли;
	ОсталосьВопросов	= ОсталосьВопросов - 1;
	
	Если ОсталосьВопросов = 0 Тогда
		Стоп();
	ИначеЕсли ВопросУстановить() Тогда
		Таймер 	= Финиш - ТекущаяДата();
		ОтветыОбновить();
	Иначе
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеПолучить(Ссылка, КакЕсть=Ложь)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка, КакЕсть);
КонецФункции

&НаСервере
Функция ВопросУстановить()
	ВопросСледующий = Неопределено;
	Если НЕ ЗначениеЗаполнено(ВопросСледующий) Тогда
		Для Каждого Элемент Из Вопросы Цикл
			Если ПустаяСтрока(Элемент.Представление) Тогда
				ВопросСледующий = Элемент.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(ВопросСледующий) Тогда
		ТекущийВопрос	= ВопросСледующий;
		ВопросТекст		= ТекущийВопрос.ПолноеНаименование();
	Иначе
		ТекущийВопрос	= Неопределено;
		ВопросТекст		= "";
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ТекущийВопрос);
КонецФункции

&НаСервере
Процедура ОтветыОбновить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Реквизиты = Новый Массив;
	Реквизиты.Добавить("Ответ0");
	Реквизиты.Добавить("Ответ1");
	Реквизиты.Добавить("Ответ2");
	Реквизиты.Добавить("Ответ3");
	Реквизиты.Добавить("Ответ4");
	Реквизиты.Добавить("Ответ5");
	
	Вопросник	= ГС.СлучайноеЧисло(0, Реквизиты.ВГраница());
	Пронто		= Новый Массив;
	Для НомерСтроки = 0 По Реквизиты.ВГраница() Цикл
		Реквизит	= Реквизиты.Получить(НомерСтроки);
		Если Вопросник = НомерСтроки Тогда
			Изо	= ИзображениеПолучить(ТекущийВопрос);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Реквизит, Изо));
			Элемент = Вопросы.НайтиПоЗначению(ТекущийВопрос);
			Элемент.Представление	= Изо;
		Иначе
			Виктим		= Неопределено;
			Ответы.СортироватьПоПредставлению();
			Итератор	= Ответы.Количество();
			Пока Виктим = Неопределено Цикл
				Для Каждого Элемент Из Ответы Цикл
					Если Пронто.Найти(Элемент.Значение) <> Неопределено Тогда
						//
					ИначеЕсли Итератор <= Вопросник Тогда
						Виктим	= Элемент;
						Прервать;
					КонецЕсли;
					Итератор = Итератор - 1.7 * Макс(1, Секунда(ТекущаяДатаСеанса()));
				КонецЦикла;
			КонецЦикла;
			Изо	= ИзображениеПолучить(Виктим.Значение);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Реквизит, Изо));
			Виктим.Представление = Изо;
			
			Пронто.Добавить(Виктим.Значение);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтарт(Команда)
	Старт();
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить(ЭтоСтарт=Ложь)
	Элементы.СтраницаНачало.Видимость	= (Шаг < 1);
	Элементы.СтраницаТест.Видимость		= (Шаг = 1);
	Элементы.СтраницаФиниш.Видимость	= (Шаг > 1);
	Если ЭтоСтарт Тогда
		ДатаНачало	= ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Старт()
	Если Было.Количество() > 99 Тогда
		Было.Очистить();
		Было.Добавить(МояКоманда());
	КонецЕсли;
	Вопросы.Очистить();
	Ответы.Очистить();
	Если ВопросыОтветыПолучить() Тогда
		Шаг	= 1;
		Вопрошать();

		ПравильныхОтветов	= 0;
		КоличествоВопросов	= Вопросы.Количество();
		ОсталосьВопросов	= КоличествоВопросов;
		Элементы.ОсталосьВопросов.МаксимальноеЗначение	= КоличествоВопросов;
		Таймер				= Макс(60, КоличествоВопросов * 10.1);
		Элементы.Таймер.МаксимальноеЗначение			= Таймер;
		Финиш				= ТекущаяДата() + Таймер;
		
		ПодключитьОбработчикОжидания("ТикТак", 5);
		
		ВидимостьУстановить(Истина);
	Иначе
		Сообщить("Ошибка");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Стоп(Прервано=Ложь)
	ОтключитьОбработчикОжидания("ТикТак");
	ЗатраченоВремени	= ЗатраченоВремени();
	Шаг				= ?(Прервано, 3, 2);
	ВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура Вопрошать() Экспорт
	Если Шаг = 1 Тогда
		Если ВопросУстановить() Тогда
			ОтветыОбновить();
		Иначе
			Шаг = 9;
		КонецЕсли;
	КонецЕсли;
	ВидимостьУстановить();
КонецПроцедуры

&НаСервере
Функция ВопросыОтветыПолучить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 55
	                      |	Команды.Ссылка КАК Ссылка,
	                      |	Команды.Ссылка = &Команда КАК МояКоманда,
	                      |	ЕСТЬNULL(МАКСИМУМ(НАЧАЛОПЕРИОДА(ТурнирнаяТаблица.Период, МЕСЯЦ)), &Дата) КАК Период
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Команды.Ссылка = ТурнирнаяТаблица.Команда
	                      |ГДЕ
	                      |	Команды.ПометкаУдаления = ЛОЖЬ
	                      |	И РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) >= 64
	                      |	И НЕ Команды.Ссылка В (&Исключения)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Команды.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("Дата",				ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Команда",			МояКоманда());
	Запрос.УстановитьПараметр("Исключения",			Было.ВыгрузитьЗначения());
	Если ГС.СлучайноеЧисло(0, 2) = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "УБЫВ", "");
	КонецЕсли;
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		//Картинка = ИзображениеПолучить(Выборка.Ссылка, Истина);
		//Если Картинка.Вид = ВидКартинки.Пустая Тогда
		//	Продолжить;
		//КонецЕсли;
		Если Вопросы.Количество() < 10 И НЕ Выборка.МояКоманда Тогда
			Вопросы.Добавить(Выборка.Ссылка);
		Иначе
			Ответы.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Возврат (Ответы.Количество() > 10);
КонецФункции

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Шаг = 1 Тогда
		Отказ		= Истина;
		Стоп(Истина);
	ИначеЕсли Шаг = 2 Тогда
		Отказ	= Истина;
		Шаг		= 0;
		ВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Функция РазницаВоВремени(Знач Количество, Знач Шаг=2)
	Шаг = Шаг - 1;
	Ответ = "";
	Если Количество = 0 Или Шаг < 0 Тогда
	ИначеЕсли Количество < 60 Тогда
		Ответ = Строка(Количество) + " сек";
	ИначеЕсли Количество < 3600 Тогда
		Ответ = Строка(Цел(Количество/60)) + " мин " + РазницаВоВремени(Количество-Цел(Количество/60)*60, Шаг);
	Иначе
		Ответ = Строка(Цел(Количество/3600)) + " час " + РазницаВоВремени(Количество-Цел(Количество/3600)*3600, Шаг);
	КонецЕсли;
	Возврат СокрП(Ответ);
КонецФункции

&НаСервере
Функция ЗатраченоВремени()
	Возврат РазницаВоВремени(ТекущаяДатаСеанса() - ДатаНачало);
КонецФункции
