
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		ОткрытьФорму("РегистрНакопления.ТурнирнаяТаблица.ФормаСписка", Новый Структура("Отбор", Новый Структура("Команда", ПараметрКоманды)), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Туры") Тогда
		ОткрытьФорму("РегистрНакопления.ТурнирнаяТаблица.ФормаСписка", Новый Структура("Отбор", Новый Структура("Тур", ПараметрКоманды)), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
КонецПроцедуры
