
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.Амплуа) И ЗначениеЗаполнено(Запись.Игрок) Тогда
		Запись.Амплуа 		= Запись.Игрок.Амплуа;
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Команда) Тогда
		ВидСпорта = СерверныйФункции.ВидСпорта(Запись.Команда);
	Иначе
		Запись.Номер = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры
