
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период)
	И ЗначениеЗаполнено(Запись.Период)
	Тогда
		Запись.Период = ТекущаяДатаСеанса();
		Если НЕ ЗначениеЗаполнено(Запись.Амплуа)
		И НЕ ЗначениеЗаполнено(Запись.Игрок)
		И НЕ ЗначениеЗаполнено(Запись.Команда)
		Тогда
			МояКоманда	= МояКоманда();
			Если ЗначениеЗаполнено(МояКоманда) Тогда
				ВидСпорта	= МояКоманда.Владелец;
				Элементы.Команда.СписокВыбора.Добавить(МояКоманда);
			КонецЕсли;
		КонецЕсли;
		Элементы.ВидСпорта.Видимость = Истина;
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Игрок) Тогда
		ВидСпорта = СерверныйФункции.ВидСпорта(Запись.ИсходныйКлючЗаписи.Игрок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Амплуа) И ЗначениеЗаполнено(Запись.Игрок) Тогда
		Запись.Амплуа = Запись.Игрок.Амплуа;
		Модифицированность = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АмплуаПриИзмененииНаСервере();
	ИгрокПриИзмененииНаСервере();
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Команда) Тогда
		ОбщегоНазначения.УстановитьЗначение(ВидСпорта, СерверныйФункции.ВидСпорта(Запись.Команда));
	Иначе
		ОбщегоНазначения.УстановитьЗначение(Запись.Номер, 0);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ИгрокПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Игрок) Тогда
		ВидСпорта		= Запись.Игрок.Амплуа.Владелец;
		Запись.Амплуа	= Запись.Игрок.Амплуа;
		АмплуаПриИзмененииНаСервере();
	КонецЕсли;
	ОбщегоНазначения.УстановитьЗначение(Изображение, СерверныйФункции.ИзображениеПолучить(Запись.Игрок));
КонецПроцедуры

&НаКлиенте
Процедура ИгрокПриИзменении(Элемент)
	ИгрокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = Запись.Игрок
	Тогда
		ПодключитьОбработчикОжидания("ИзображениеОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеОбновить() Экспорт
	ИгрокПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НаКлиенте.Оповещение("Игрок", Запись.Игрок);
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервереБезКонтекста
Функция АмплуаПолучить(ВидСпорта)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Амплуа.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Амплуа КАК Амплуа
	                      |ГДЕ
	                      |	Амплуа.Владелец = &ВидСпорта
	                      |	И Амплуа.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ВидСпорта",	ВидСпорта);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаСервере
Процедура АмплуаЗаполнить()
	Амплуа.ЗагрузитьЗначения(АмплуаПолучить(ВидСпорта));
КонецПроцедуры

&НаСервере
Процедура АмплуаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Амплуа) Тогда
		Если ?(Амплуа.Количество() = 1, Амплуа.НайтиПоЗначению(Запись.Амплуа) = Неопределено, Истина) Тогда
			Амплуа.Очистить();
			Амплуа.Добавить(Запись.Амплуа);
		КонецЕсли;
	Иначе
		АмплуаЗаполнить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура АмплуаПриИзменении(Элемент)
	АмплуаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидСпортаПриИзменении(Элемент)
	Если Элементы.Команда.СписокВыбора.Количество() > 0 Тогда
		Элементы.Команда.СписокВыбора.Очистить();
	КонецЕсли;
КонецПроцедуры
