
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Период)
	И ЗначениеЗаполнено(Запись.Период)
	Тогда
		Запись.Период 		= ТекущаяДатаСеанса();
	КонецЕсли;
	Если ЗначениеЗаполнено(Запись.ИсходныйКлючЗаписи.Игрок) Тогда
		ВидСпорта = СерверныйФункции.ВидСпорта(Запись.ИсходныйКлючЗаписи.Игрок);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.Амплуа) И ЗначениеЗаполнено(Запись.Игрок) Тогда
		Запись.Амплуа 		= Запись.Игрок.Амплуа;
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИгрокПриИзменении();
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(Запись.Команда) Тогда
		Если НЕ ЗначениеЗаполнено(ВидСпорта) Тогда
			ВидСпорта = СерверныйФункции.ВидСпорта(Запись.Команда);
		КонецЕсли;
	Иначе
		Запись.Номер = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка);
КонецФункции

&НаКлиенте
Процедура ИгрокПриИзменении(Элемент=Неопределено)
	Изображение	= ИзображениеПолучить(Запись.Игрок);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = Запись.Игрок
	Тогда
		ПодключитьОбработчикОжидания("ИзображениеОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеОбновить() Экспорт
	ИгрокПриИзменении();
КонецПроцедуры
