
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ФормаКоманднаяПанель);
		Отчет.Команда = Параметры.Команда;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Попытка
		СкомпоноватьРезультат();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Значение	= РезультатРасшифровки(Расшифровка);
	Игроки.ЗагрузитьЗначения(ИгрокиПолучить(Отчет.Команда, Значение));
	Если Игроки.Количество() = 1 Тогда
		НаКлиенте.Показать(Игроки.Получить(0).Значение, СтандартнаяОбработка);
	Иначе
		СтандартнаяОбработка = Ложь;
		Игроки.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораИгрока", ЭтотОбъект), "Выберите игрока");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораИгрока(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИгрокиПолучить(Клуб, Страна)
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, Игрок.Страна = &Страна) КАК ПеремещенияИгроков
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Игрок
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Команда",			Клуб);
	Запрос.УстановитьПараметр("Страна",				Страна);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
