
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СнятиеОчков", Чемпионат());
КонецПроцедуры

&НаСервере
Функция ЧемпионатПолучитьПоследнее()
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее(Объект.Команда);
КонецФункции

&НаСервере
Функция Чемпионат()
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Чемпионат	= Объект.Тур.Владелец;
		Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
			Чемпионат = ЧемпионатПолучитьПоследнее();
		КонецЕсли;
	КонецЕсли;
	Возврат Чемпионат;
КонецФункции

&НаКлиенте
Процедура ТурПриИзменении(Элемент=Неопределено)
	КомандыТура.ЗагрузитьЗначения(КомандыТура());
КонецПроцедуры

&НаСервере
Функция КомандыТура()
	мКоманды	= СерверныйФункции.КомандыТура(Объект.Тур, Истина);
	Если мКоманды.Количество() = 0 И Объект.Тур.ОлимпийскаяСистема Тогда
		мКоманды = СерверныйФункции.КомандыЧемпионата(Чемпионат());
	КонецЕсли;
	Возврат мКоманды;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТурПриИзменении();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТурыПолучить(Дата, Команда=Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК СправочникКоманды
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	                      |				ПО СправочникКоманды.Город = Города.Ссылка
	                      |			ПО ЧемпионатыКоманды.Команда = СправочникКоманды.Ссылка
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
	                      |				ПО Лига.Страна = Страны.Ссылка
	                      |			ПО Чемпионаты.Владелец = Лига.Ссылка
	                      |		ПО Туры.Владелец = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	&Дата МЕЖДУ НАЧАЛОПЕРИОДА(Туры.ДатаНачала, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(Туры.ДатаОкончания, НЕДЕЛЯ)
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И Лига.Страна = Города.Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.ДатаНачала");
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Туры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК СправочникКоманды
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |				ПО СправочникКоманды.Город = Города.Ссылка
		               |			ПО ЧемпионатыКоманды.Команда = СправочникКоманды.Ссылка
		               |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
		               |				ПО Лига.Страна = Страны.Ссылка
		               |			ПО Чемпионаты.Владелец = Лига.Ссылка
		               |		ПО Туры.Владелец = Чемпионаты.Ссылка
		               |ГДЕ
		               |	&Дата МЕЖДУ НАЧАЛОПЕРИОДА(Туры.ДатаНачала, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(Туры.ДатаОкончания, НЕДЕЛЯ)
		               |	И Туры.ПометкаУдаления = ЛОЖЬ
		               |	И Лига.Страна = Города.Владелец
		               |	И ЧемпионатыКоманды.Команда В(&Команда)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Туры.ДатаНачала";
		Запрос.УстановитьПараметр("Команда",		Команда);
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",			НачалоДня(Дата));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ТурНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Туры.ЗагрузитьЗначения(ТурыПолучить(Объект.Дата, Объект.Команда));

	Элемент.СписокВыбора.ЗагрузитьЗначения(Туры.ВыгрузитьЗначения());
КонецПроцедуры

&НаСервере
Функция Тур(Команда)
	Возврат РеквизитФормыВЗначение("Объект").Тур(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	Если НЕ ЗначениеЗаполнено(Объект.Тур) Тогда
		Объект.Тур		= Тур(Объект.Команда);
	КонецЕсли;
КонецПроцедуры
