
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("СнятиеОчков", Чемпионат());
КонецПроцедуры

&НаСервере
Функция КомандыПолучить()
	Возврат Объект.Команды.Выгрузить().ВыгрузитьКолонку("Команда");
КонецФункции

&НаСервере
Функция Чемпионат()
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Чемпионат	= Объект.Тур.Владелец;
		Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
			Чемпионат = СерверныйФункции.ЧемпионатПолучитьПоследнее(КомандыПолучить());
		КонецЕсли;
	КонецЕсли;
	Возврат Чемпионат;
КонецФункции

&НаКлиенте
Процедура ТурПриИзменении(Элемент=Неопределено)
	КомандыТура.ЗагрузитьЗначения(КомандыТура());
КонецПроцедуры

&НаСервере
Функция КомандыТура()
	мКоманды	= СерверныйФункции.КомандыТура(Объект.Тур);
	Если мКоманды.Количество() = 0 И Объект.Тур.ОлимпийскаяСистема Тогда
		мКоманды = СерверныйФункции.КомандыЧемпионата(Чемпионат());
	КонецЕсли;
	Возврат мКоманды;
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТурПриИзменении();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТурыПолучить(Дата, Команда=Неопределено)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК СправочникКоманды
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	                      |				ПО СправочникКоманды.Город = Города.Ссылка
	                      |			ПО ЧемпионатыКоманды.Команда = СправочникКоманды.Ссылка
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
	                      |				ПО Лига.Страна = Страны.Ссылка
	                      |			ПО Чемпионаты.Владелец = Лига.Ссылка
	                      |		ПО Туры.Владелец = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	&Дата МЕЖДУ НАЧАЛОПЕРИОДА(Туры.ДатаНачала, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(Туры.ДатаОкончания, НЕДЕЛЯ)
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И Лига.Страна = Города.Владелец
	                      |	И ЧемпионатыКоманды.Команда В(&Команда)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.ДатаНачала");
	Если Команда = Неопределено Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Туры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК СправочникКоманды
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |				ПО СправочникКоманды.Город = Города.Ссылка
		               |			ПО ЧемпионатыКоманды.Команда = СправочникКоманды.Ссылка
		               |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
		               |				ПО Лига.Страна = Страны.Ссылка
		               |			ПО Чемпионаты.Владелец = Лига.Ссылка
		               |		ПО Туры.Владелец = Чемпионаты.Ссылка
		               |ГДЕ
		               |	&Дата МЕЖДУ НАЧАЛОПЕРИОДА(Туры.ДатаНачала, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(Туры.ДатаОкончания, НЕДЕЛЯ)
		               |	И Туры.ПометкаУдаления = ЛОЖЬ
		               |	И Лига.Страна = Города.Владелец
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Туры.ДатаНачала";
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",			НачалоДня(Дата));
	Запрос.УстановитьПараметр("Команда",		Команда);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ТурНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Объект.Команды.Количество() = 0 Тогда
		Туры.ЗагрузитьЗначения(ТурыПолучить(Объект.Дата));
	Иначе
		мКоманды = Новый Массив;
		Для Каждого ТекСтрока Из Объект.Команды Цикл
			мКоманды.Добавить(ТекСтрока.Команда);
		КонецЦикла;
		Туры.ЗагрузитьЗначения(ТурыПолучить(Объект.Дата, мКоманды));
	КонецЕсли;
	Элемент.СписокВыбора.ЗагрузитьЗначения(Туры.ВыгрузитьЗначения());
КонецПроцедуры

&НаКлиенте
Процедура КомандыПриИзменении(Элемент)
	Если Элементы.Команды.ТекущиеДанные = Неопределено Тогда
		//
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Тур) Тогда
		Объект.Тур		= СерверныйФункции.Тур(Элементы.Команды.ТекущиеДанные.Команда, Объект.Дата);
	КонецЕсли;
КонецПроцедуры
