
Функция Сутки(Количество=1) Экспорт
	Возврат 86400 * Количество;
КонецФункции

Функция Часов(Количество=1) Экспорт
	Возврат 3600 * Количество;
КонецФункции

Функция СтрДата(Дата, Полный=Ложь) Экспорт
	Возврат Формат(Дата, ?(Полный, "ДФ=yyyyMMddHHmmss", "ДФ=yyyyMMdd"));
КонецФункции

Функция СтрокаКакМесяц(Слово) Экспорт
	Ответ = 0;
	Если ПустаяСтрока(Слово) Тогда
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "янв") = 0 Тогда
		Ответ = 1;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "фев") = 0 Тогда
		Ответ = 2;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "мар") = 0 Тогда
		Ответ = 3;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "апр") = 0 Тогда
		Ответ = 4;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "мая") = 0 Тогда
		Ответ = 5;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "июн") = 0 Тогда
		Ответ = 6;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "июл") = 0 Тогда
		Ответ = 7;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "авг") = 0 Тогда
		Ответ = 8;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "сен") = 0 Тогда
		Ответ = 9;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "окт") = 0 Тогда
		Ответ = 10;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "ноя") = 0 Тогда
		Ответ = 11;
	ИначеЕсли СтрСравнить(Лев(СокрЛ(Слово), 3), "дек") = 0 Тогда
		Ответ = 12;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СтрокаКакЧисло(Значение) Экспорт
	СтрокаБезНулей = СтрУдалить(СтрУдалить(Значение, " "), "0");
	Если ПустаяСтрока(СтрокаБезНулей) Или СтрокаБезНулей = "-" Тогда
		Возврат 0;
	КонецЕсли;
	
	ТипЧисло  = Новый ОписаниеТипов("Число");
	Ответ = ТипЧисло.ПривестиЗначение(Значение);
	
	Возврат Ответ;
КонецФункции

Функция СтрокаКакДата(Слово) Экспорт
	Ответ = Дата(1,1,1);
	Попытка
		Если СтрДлина(Слово) = 10 Тогда
			Ответ = Дата(Прав(Слово, 4) + Сред(Слово, 4, 2) + Лев(Слово, 2));
		ИначеЕсли СтрДлина(Слово) = 8 Тогда
			Если СтрЧислоВхождений(Слово, ".") = 2 Тогда
				Попытка
					Ответ = Дата(ВекКакСтрока(Прав(Слово, 2)) + Прав(Слово, 2) + Сред(Слово, 4, 2) + Лев(Слово, 2));
				Исключение КонецПопытки;
			Иначе
				Попытка
					Ответ = Дата(Слово);
				Исключение
					Ответ = Дата(ВекКакСтрока(Прав(Слово, 2)) + Прав(Слово, 2) + Сред(Слово, 4, 2) + Лев(Слово, 2));
				КонецПопытки;
			КонецЕсли;
		ИначеЕсли СтрДлина(Слово) = 16 Тогда
			Ответ = Дата(СтрУдалить(СтрУдалить(Слово, "T"), "Z"));
		Иначе
			Слова = Разделить(Слово, ".");
			Если Слова.Количество() = 3 Тогда
				Ответ = Дата(Слова.Получить(2) + Прав("0" + Слова.Получить(1), 2) + Прав("0" + Слова.Получить(0), 2));
			КонецЕсли;
		КонецЕсли;
	Исключение КонецПопытки;
	Возврат Ответ;
КонецФункции

Функция СтрНайти2(Строка, СтрокаПоиска) Экспорт
	Возврат СтрНайти(НРег(Строка), НРег(СтрокаПоиска));
КонецФункции

Функция СтрУдалить(Слово, Подстрока=":") Экспорт
	Возврат СтрЗаменить(Слово, Подстрока, "");
КонецФункции

Функция ВекКакСтрока(Слово)
	Ответ = Цел(Год(ТекущаяДата()) / 100);
	Если СтрокаКакЧисло(Слово) > (Год(ТекущаяДата()) / 100 - Ответ) * 100 Тогда
		Ответ = Ответ - 1;
	КонецЕсли;
	Возврат ФорматЧГ(Ответ);
КонецФункции

Функция СтрокаНачинаетсяЧислом(Слово) Экспорт
	Если НЕ ПустаяСтрока(Слово) Тогда
		Возврат (СтрНайти("1234567890", Лев(СокрЛ(Слово), 1)) > 0);
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция СтрокаПохожаНаДату(Слово) Экспорт
	Если НЕ СтрокаНачинаетсяЧислом(Слово) Тогда
		//
	ИначеЕсли СтрДлина(Слово) > 30 Тогда
		//
	ИначеЕсли СтрНайти2(Слово, "янв") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "фев") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "мар") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "апр") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "мая") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "июн") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "июл") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "авг") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "сен") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "окт") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "ноя") > 0 Тогда
		Возврат Истина;
	ИначеЕсли СтрНайти2(Слово, "дек") > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция СтрокаСодержитЧисло(Слово) Экспорт
	Если НЕ ПустаяСтрока(Слово) Тогда
		Для Число = 0 По 9 Цикл
			Если СтрНайти(Слово, Формат(Число, "ЧН=0; ЧГ=0")) > 0 Тогда
				Возврат Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

Функция Возраст(Дата) Экспорт
	Возврат ?(ГОД(Дата) >= 1900, СтрокаСЧислом(";%1 год;%1 года;%1 года;%1 лет;", Макс(0, Год(ТекущаяДата()) - Год(Дата) - ?(ДеньГода(ТекущаяДата()) >= ДеньГода(Дата), 0, 1)), ВидЧисловогоЗначения.Количественное), "");
КонецФункции

Функция Разделить(Знач Слово, Разделитель=" ", СокрЛП=Ложь) Экспорт
	Ответ	= СтрРазделить(Слово, Разделитель, Ложь);
	Если СокрЛП Тогда
		Слова = Новый Массив;
		Для Каждого Слово Из Ответ Цикл
			Если НЕ ПустаяСтрока(Слово) Тогда Слова.Добавить(СокрЛП(Слово)); КонецЕсли;
		КонецЦикла;
		Возврат Слова;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ЭтоУРЛ(Слово) Экспорт
	Ответ = Ложь;
	Если ПустаяСтрока(Слово) Тогда
		//
	ИначеЕсли НачинаетсяНа(Слово, "https://") Тогда
		Ответ = Истина;
	ИначеЕсли НачинаетсяНа(Слово, "http://") Тогда
		Ответ = Истина;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция НачинаетсяНа(Слово, Начало)
	Возврат (СтрСравнить(Лев(СокрЛ(Слово), СтрДлина(Начало)), Начало) = 0);
КонецФункции

Функция ИмяФайла(Знач Слово) Экспорт
	Если СтрНайти(Слово, "/") > 0 Тогда
		Слова = Разделить(Слово, "/");
	ИначеЕсли СтрНайти(Слово, "\") > 0 Тогда
		Слова = Разделить(Слово, "\");
	Иначе
		Возврат Слово;
	КонецЕсли;
	Для Каждого Слово Из Слова Цикл
	КонецЦикла;
	Возврат Слово;
КонецФункции

Функция ФорматД(Дата, ФорматнаяСтрока="ДФ=dd.MM") Экспорт
	Возврат Формат(Дата, ФорматнаяСтрока);
КонецФункции

Функция ФорматЧГ(ЧислоИлиДата) Экспорт
	Если ТипЗнч(ЧислоИлиДата) = Тип("Дата") Тогда
		Возврат ФорматЧГ(Год(ЧислоИлиДата));
	КонецЕсли;
	Возврат Формат(ЧислоИлиДата, "ЧН=0; ЧГ=0");
КонецФункции

Функция Разрыв(Один=Ложь) Экспорт
	Возврат ?(Один, Символы.ПС, Символы.ПС + Символы.ПС);
КонецФункции

Функция ЧислоПолучить(Слова, Перебором=Ложь) Экспорт
	Если СтрокаСодержитЧисло(Слова) Тогда
		Если Перебором Тогда
			Оно = "";
			Для Буква = 1 По СтрДлина(Слова) Цикл
				Если СтрНайти("0123456789", Сред(Слова, Буква, 1)) = 0 Тогда
					Если НЕ ПустаяСтрока(Оно) Тогда
						Прервать;
					КонецЕсли;
				Иначе
					Оно = Оно + Сред(Слова, Буква, 1);
				КонецЕсли;
			КонецЦикла;
			Возврат СтрокаКакЧисло(Оно);
		Иначе
			Для Каждого Слово Из Разделить(Слова) Цикл
				Оно	= СтрокаКакЧисло(СтрУдалить(Слово, ","));
				Если Оно > 0 Тогда Возврат Оно; КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат 0;
КонецФункции

Функция ЧислоЧетное(Знач Число) Экспорт
	Возврат (Число = Цел(Число / 2) * 2);
КонецФункции

Функция Обернуть(Слово, Знак="%") Экспорт
	Возврат Знак + СокрЛП(Слово) + Знак;
КонецФункции
