
&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ТекущаяСтраницаИмя	= ТекущаяСтраница.Имя;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
		Элементы.Страницы.ОтображениеСтраниц	= ОтображениеСтраницФормы.Нет;
		Элементы.ГруппаПоследнее.Видимость		= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элемент	= Элементы.Найти(ТекущаяСтраницаИмя);
	Если Элемент = Неопределено Тогда
		ТекущаяСтраницаИмя	= Элементы.Страницы.ТекущаяСтраница.Имя;
	Иначе
		Элементы.Страницы.ТекущаяСтраница = Элемент;
	КонецЕсли;
КонецПроцедуры
