
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Команда) Тогда
		СхемаКомпоновкиДанных	= ПолучитьМакет("СхемаКоманда");
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
		КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Команда",	Команда);
	Иначе
		Настройки = КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Лига",	Лига);
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Топ",	?(Лига.ОлимпийскаяСистема, Ложь, Топ));
		КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
	КонецЕсли;
КонецПроцедуры
