
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Команда) Тогда
		СхемаКомпоновкиДанных	= ПолучитьМакет("СхемаКоманда");
		Для Каждого Элемент Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыДанных.Элементы Цикл
			Если СтрСравнить(Элемент.Параметр, "Команда") = 0 Тогда
				Элемент.Значение 		= Команда;
				Элемент.Использование	= Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	КонецЕсли;
КонецПроцедуры

Процедура СхемаУстановить() Экспорт
	СхемаКомпоновкиДанных	= ПолучитьМакет("СхемаКоманда");
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры
