
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Тур) Тогда
		Тур = Тур(Команда);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТурнирнаяТаблица.Записывать = Истина;
	ЗаполнитьЗначенияСвойств(Движения.ТурнирнаяТаблица.Добавить(), Новый Структура("Период,Команда,Тур,КоличествоОчков", НачалоДня(Дата), Команда, Тур, КоличествоОчков));
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Команды") Тогда
		Команда	= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Туры") Тогда
		Тур	= ДанныеЗаполнения;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	КоличествоОчков		= 0;
КонецПроцедуры

Функция Тур(Тим) Экспорт
	мКоманды = Новый Массив;
	мКоманды.Добавить(Тим);
	Возврат СерверныйФункции.Тур(мКоманды, Дата);
КонецФункции
