
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Тур) Тогда
		мКоманды = Новый Массив;
		Для Каждого тСтрока Из Команды Цикл
			мКоманды.Добавить(тСтрока.Команда);
		КонецЦикла;
		Тур = СерверныйФункции.Тур(мКоманды, Дата);
	КонецЕсли;
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Команды.Свернуть("Команда", "КоличествоОчков");
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТурнирнаяТаблица.Записывать = Истина;
	Для Каждого ТекСтрокаКоманды Из Команды Цикл
		ЗаполнитьЗначенияСвойств(Движения.ТурнирнаяТаблица.Добавить(), Новый Структура("Период,Команда,Тур,КоличествоОчков", НачалоДня(Дата), ТекСтрокаКоманды.Команда, Тур, ТекСтрокаКоманды.КоличествоОчков));
	КонецЦикла;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Команды") Тогда
		ЗаполнитьЗначенияСвойств(Команды.Добавить(), Новый Структура("Команда", ДанныеЗаполнения));
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Комментарий			= "";
	Для Каждого ТекСтрокаКоманды Из Команды Цикл
		ТекСтрокаКоманды.КоличествоОчков = 0;
	КонецЦикла;
КонецПроцедуры
