
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если НЕ ЗначениеЗаполнено(Тур) Тогда
		мКоманды = Новый Массив;
		Для Каждого тСтрока Из Команды Цикл
			мКоманды.Добавить(тСтрока.Команда);
		КонецЦикла;
		Тур = СерверныйФункции.Тур(мКоманды, Дата);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ТурнирнаяТаблица Расход
	Движения.ТурнирнаяТаблица.Записывать = Истина;
	Для Каждого ТекСтрокаКоманды Из Команды Цикл
		Движение = Движения.ТурнирнаяТаблица.Добавить();
		Движение.Период = Дата;
		Движение.Команда = ТекСтрокаКоманды.Команда;
		Движение.Тур = Тур;
		Движение.КоличествоОчков = -ТекСтрокаКоманды.КоличествоОчков;
	КонецЦикла;
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
