
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Изображение	= ИзображениеПолучить(Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка);
КонецФункции

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога();
КонецФункции

&НаКлиенте
Процедура ВыбратьИзображение(Команда)
	Если СтрСравнить(Команда.Имя, "ВыбратьИзображение") = 0 Тогда
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект),,,, ПараметрыДиалога());
	ИначеЕсли СтрСравнить(Команда.Имя, "УдалитьИзображение") = 0 Тогда
		Изображение = ИзображениеДефолтПолучить();
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеДефолтПолучить()
	Возврат СерверныйФункции.ИзображениеДефолтПолучить();
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(Результат.СсылкаНаФайл.Расширение)
		И Результат.СсылкаНаФайл.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный()
		Тогда
			Изображение = Результат.Адрес;
			Модифицированность	= Истина;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Данный тип файла не поддерживается");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") И НЕ ПустаяСтрока(Результат) Тогда
		Данные				= Новый ДвоичныеДанные(Результат);
		Если Данные.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный() Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		СерверныйФункции.ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Изображение, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент=Неопределено)
	Возраст = Возраст(Объект.ДатаРождения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаРожденияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ЭтоУРЛ(ПараметрыПеретаскивания.Значение) Тогда
		НачатьКопированиеФайла(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект), ПараметрыПеретаскивания.Значение, СерверныйФункции.КаталогаФайлов() + ИмяФайла(ПараметрыПеретаскивания.Значение));
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(ПараметрыПеретаскивания.Значение.Расширение) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя), УникальныйИдентификатор);
			Модифицированность	= Истина;
			СтандартнаяОбработка= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НаКлиенте.Оповещение("Игрок", Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИгрока(Игрок)
	Возврат СерверныйФункции.ДанныеИгрока(Игрок);
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеИгрока	= ДанныеИгрока(ТекущийОбъект.Ссылка);
	ТекущаяКоманда	= ДанныеИгрока.Команда;
	ТекущийНомер	= ДанныеИгрока.Номер;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Год(ТекущаяДатаСеанса()) - Год(Объект.ДатаРождения) < 15 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Дата неверна", Отказ, Объект.Ссылка, "Объект.ДатаРождения");
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧемпионыПолучить(Игрок)
	Рисунки = Новый Массив;
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Чемпионаты.Владелец КАК Ссылка,
	      	               |	Чемпионаты.Владелец.Код КАК Код,
	      	               |	Чемпионаты.Владелец.Наименование КАК Наименование,
	      	               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
	      	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
	      	               |	Чемпионаты.ДатаОкончания КАК Период,
	      	               |	Итоги.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрСведений.Итоги КАК Итоги
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	      	               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
	      	               |		ПО Итоги.Команда = ПеремещенияИгроков.Команда
	      	               |			И (КОНЕЦПЕРИОДА(Итоги.Период, ГОД) >= ПеремещенияИгроков.Период)
	      	               |ГДЕ
	      	               |	Итоги.Место = 1
	      	               |	И ПеремещенияИгроков.Игрок = &Игрок
	      	               |	И ПеремещенияИгроков.Период < Чемпионаты.ДатаОкончания
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЕстьКартинка УБЫВ,
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Игрок",			Игрок);
	Выборка = Запрос.Выполнить().Выбрать();
	Отбор	= Новый Структура("Игрок", Игрок);
	Пока Выборка.Следующий() Цикл
		Перемещение = РегистрыСведений.ПеремещенияИгроков.ПолучитьПоследнее(Выборка.Период, Отбор);
		Если Перемещение.Команда = Выборка.Команда Тогда
			Элемент = Новый Структура("Ссылка,Код,Наименование,ЕстьКартинка,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, Выборка);
			Если Выборка.ЕстьКартинка Тогда
				Элемент.Представление	= ИзображениеПолучить(Выборка.Ссылка);
			КонецЕсли;
			Рисунки.Добавить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Рисунки;
КонецФункции

&НаСервере
Процедура ЭлементыОчистить()
	Пока Элементы.ГруппаЧемпионы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		Элементы.Удалить(Элементы.ГруппаЧемпионы.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЧемпионыОбновитьНаСервере()
	Чемпионы.Очистить();
	ЭлементыОчистить();
	
	Лиги	= Новый Соответствие;
	Список	= ЧемпионыПолучить(Объект.Ссылка);
	Для Каждого Чемпион Из Список Цикл
		Количество = Лиги.Получить(Чемпион.Ссылка);
		Если Количество = Неопределено Тогда
			Лиги.Вставить(Чемпион.Ссылка, 1);
			ЭлементСписка = Чемпионы.Добавить(Чемпион.Ссылка, Чемпион.Представление);
			
			Элемент = Элементы.Добавить("Декорация" + Чемпион.Код, Тип("ПолеФормы"), Элементы.ГруппаЧемпионы);
			Если Чемпион.ЕстьКартинка Тогда
				Элемент.Вид			= ВидПоляФормы.ПолеКартинки;
				Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Представление", Чемпионы.Количество() - 1);
				Элемент.Заголовок	= СтрШаблон("%1 (%2)", Чемпион.Наименование, 1);
			Иначе
				Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Значение", Чемпионы.Количество() - 1);
				Элемент.Заголовок	= СтрШаблон("(%1)", 1);
			КонецЕсли;
			Элемент.АвтоМаксимальнаяВысота	= Ложь;
			Элемент.МаксимальнаяВысота		= 8;
			Элемент.АвтоМаксимальнаяШирина	= Ложь;
			Элемент.МаксимальнаяШирина		= 20;
			Элемент.Подсказка	= Чемпион.Представление;
			Элемент.РасширеннаяПодсказка.Заголовок = Чемпион.Ссылка;
			Элемент.Гиперссылка		= Истина;
			Элемент.ТолькоПросмотр	= Истина;
			Элемент.УстановитьДействие("Нажатие", "ДекорацияНажатие");
		Иначе
			Количество = Количество + 1;
			Лиги.Вставить(Чемпион.Ссылка, Количество);
			
			Элемент = Элементы.Найти("Декорация" + Чемпион.Код);
			Если Чемпион.ЕстьКартинка Тогда
				Элемент.Заголовок	= СтрШаблон("%1 (%2)", Чемпион.Наименование, Количество);
			Иначе
				Элемент.Заголовок	= СтрШаблон("(%1)", Количество);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ТрофеиОбновить(Команда)
	ЧемпионыОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.СтраницаТрофеи = ТекущаяСтраница Тогда
		Если Чемпионы.Количество() = 0 Тогда
			ЧемпионыОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
