
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ Объект.Ссылка.Пустая() Тогда
		Изображение	= ИзображениеПолучить(Объект.Ссылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ВидСпорта = ВидСпорта(Параметры.ЗначениеКопирования);
	ИначеЕсли ЗначениеЗаполнено(Параметры.Основание) Тогда
		ВидСпорта = ВидСпорта(Параметры.Основание);
	Иначе
		ВидСпорта = НаСервереПовторно.Футбол();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка, КакЕсть=Ложь)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка, КакЕсть);
КонецФункции

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога();
КонецФункции

&НаКлиенте
Процедура ВыбратьИзображение(Команда)
	Если СтрСравнить(Команда.Имя, "ВыбратьИзображение") = 0 Тогда
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект),,,, ПараметрыДиалога());
	ИначеЕсли СтрСравнить(Команда.Имя, "УдалитьИзображение") = 0 Тогда
		Изображение = ИзображениеДефолтПолучить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИзображениеДефолтПолучить()
	Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
КонецФункции

&НаКлиенте
Функция РазмерНорм(Размер)
	Возврат (Размер >= ОбщегоНазначения.РазмерКартинкиМинимальный());
КонецФункции

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(Результат.СсылкаНаФайл.Расширение)
		И РазмерНорм(Результат.СсылкаНаФайл.Размер())
		Тогда
			Изображение = Результат.Адрес;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Данный тип файла не поддерживается");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") И НЕ ПустаяСтрока(Результат) Тогда
		Данные				= Новый ДвоичныеДанные(Результат);
		Если РазмерНорм(Данные.Размер()) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		СерверныйФункции.ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Изображение, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаРожденияПриИзменении(Элемент=Неопределено)
	Возраст = Возраст(Объект.ДатаРождения);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатаРожденияПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ЭтоУРЛ(ПараметрыПеретаскивания.Значение) Тогда
		НачатьКопированиеФайла(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект), ПараметрыПеретаскивания.Значение, СерверныйФункции.КаталогаФайлов() + ИмяФайла(ПараметрыПеретаскивания.Значение));
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(ПараметрыПеретаскивания.Значение.Расширение) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя), УникальныйИдентификатор);
			Модифицированность	= Истина;
			СтандартнаяОбработка= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	НаКлиенте.Оповещение("Игрок", Объект.Ссылка);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ДанныеИгрока(Игрок)
	Возврат СерверныйФункции.ДанныеИгрока(Игрок);
КонецФункции

&НаСервереБезКонтекста
Функция ВидСпорта(Ссылка)
	Возврат СерверныйФункции.ВидСпорта(Ссылка);
КонецФункции

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДанныеИгрока	= ДанныеИгрока(ТекущийОбъект.Ссылка);
	Элементы.ТекущаяКоманда.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(ДанныеИгрока.Команда) Тогда
		Элементы.ТекущаяКоманда.СписокВыбора.Добавить(ДанныеИгрока.Команда,,, ИзображениеПолучить(ДанныеИгрока.Команда, Истина));
	КонецЕсли;
	ТекущаяКоманда	= ДанныеИгрока.Команда;
	ТекущийНомер	= Формат(ДанныеИгрока.Номер, "ЧН=N");
	Если ЗначениеЗаполнено(ДанныеИгрока.Команда) Тогда
		ВидСпорта = ВидСпорта(ДанныеИгрока.Команда);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Год(ТекущаяДатаСеанса()) - Год(Объект.ДатаРождения) < 15 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Дата неверна", Отказ, Объект.Ссылка, "Объект.ДатаРождения");
	КонецЕсли;
КонецПроцедуры
