
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор	= Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		Отбор.Вставить("Команда", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Туры") Тогда
		Отбор.Вставить("Тур", ПараметрКоманды);
	Иначе
		Отбор.Вставить("Тур", ТурыЧемпионата(ПараметрКоманды));
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("РегистрНакопления.ТурнирнаяТаблица.ФормаСписка", Новый Структура("Отбор", Отбор), ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция ТурыЧемпионата(Чемпионат)
	Возврат СерверныйФункции.ТурыЧемпионата(Чемпионат);
КонецФункции
