
&НаКлиенте
Процедура График2ОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СписокЗначений") Тогда
		СтандартнаяОбработка = Ложь;
		Если Расшифровка.Количество() = 1 Тогда
			ПослеВыбораКоманды(Расшифровка.Получить(0).Значение);
		Иначе
			Расшифровка.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораКоманды", ЭтотОбъект), "Игроки");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораКоманды(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура КомандыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = (Объект.Команды.Количество() > 1);
КонецПроцедуры

&НаКлиенте
Процедура КомандыПослеУдаления(Элемент)
	ТЧОчистить();
КонецПроцедуры

&НаСервере
Процедура ТЧОчистить()
	ПредыдущиеВстречи.Очистить();
	ПредыдущиеМатчи.Очистить();
	Игроки.Очистить();
	Сезон.Очистить();
	
	График2Команда = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура КомандыОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервере
Процедура СоставыЗагрузитьНаСервере()
	Если Объект.СоставыКоманд.Количество() = 0 Тогда Возврат; КонецЕсли;
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	СоставКоманды.Игрок КАК Игрок,
	      	               |	СоставКоманды.Команда КАК Команда
	      	               |ПОМЕСТИТЬ СоставКоманды
	      	               |ИЗ
	      	               |	&ТЧ КАК СоставКоманды
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	Игроки.Ссылка КАК Ссылка,
	      	               |	Игроки.Амплуа КАК Амплуа,
	      	               |	ВЫБОР
	      	               |		КОГДА Игроки.Фаза1 <= 23 / 4
	      	               |			ТОГДА Игроки.Фаза1 * 25 / 23
	      	               |		КОГДА Игроки.Фаза1 <= 23 / 2
	      	               |			ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
	      	               |		КОГДА Игроки.Фаза1 <= 23 / 4 * 3
	      	               |			ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
	      	               |		ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
	      	               |	КОНЕЦ КАК Фаза1,
	      	               |	ВЫБОР
	      	               |		КОГДА Игроки.Фаза2 <= 28 / 4
	      	               |			ТОГДА Игроки.Фаза2 * 25 / 28
	      	               |		КОГДА Игроки.Фаза2 <= 28 / 2
	      	               |			ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
	      	               |		КОГДА Игроки.Фаза2 <= 28 / 4 * 3
	      	               |			ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
	      	               |		ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
	      	               |	КОНЕЦ КАК Фаза2,
	      	               |	ВЫБОР
	      	               |		КОГДА Игроки.Фаза3 <= 33 / 4
	      	               |			ТОГДА Игроки.Фаза3 * 25 / 33
	      	               |		КОГДА Игроки.Фаза3 <= 33 / 2
	      	               |			ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
	      	               |		КОГДА Игроки.Фаза3 <= 33 / 4 * 3
	      	               |			ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
	      	               |		ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
	      	               |	КОНЕЦ КАК Фаза3
	      	               |ИЗ
	      	               |	(ВЫБРАТЬ
	      	               |		СоставКоманды.Команда = &Хозяева КАК ЭтоХозяева,
	      	               |		Игроки.Ссылка КАК Ссылка,
	      	               |		Игроки.Амплуа КАК Амплуа,
	      	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
	      	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
	      	               |		РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
	      	               |	ИЗ
	      	               |		Справочник.Игроки КАК Игроки
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СоставКоманды КАК СоставКоманды
	      	               |			ПО Игроки.Ссылка = СоставКоманды.Игрок) КАК Игроки
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Игроки.ЭтоХозяева УБЫВ,
	      	               |	Игроки.Амплуа.Код,
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Дата", 			НачалоДня(Объект.Дата));
	Запрос.УстановитьПараметр("ТЧ", 			Объект.СоставыКоманд.Выгрузить());
	Запрос.УстановитьПараметр("Хозяева",		Хозяева());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		мСтроки = Объект.СоставыКоманд.НайтиСтроки(Новый Структура("Игрок", Выборка.Ссылка));
		Для Каждого тСтрока Из мСтроки Цикл
			ЗаполнитьЗначенияСвойств(тСтрока, Выборка);
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура СоставыЗаполнитьНаСервере()
	Если Объект.Команды.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	Объект.СоставыКоманд.Очистить();
	ШалостьУдалась	= Ложь;
	Для Каждого ТекСтрока Из Объект.Команды Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Команда) Тогда
			ШалостьУдалась = Макс(ШалостьУдалась, СоставыКомандДобавить(СоставКоманды(ТекСтрока.Команда)));
		КонецЕсли;
	КонецЦикла;
	Если ШалостьУдалась Тогда
		СоставыЗагрузитьНаСервере();
		СоставыСортироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоставКоманды(Команда)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Участники.Игрок КАК Игрок,
	                      |	Участники.Команда КАК Команда
	                      |ИЗ
	                      |	Документ.Матч.СоставыКоманд КАК Участники
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаК, Игрок.ПометкаУдаления = ЛОЖЬ) КАК СоставКоманды
	                      |		ПО Участники.Игрок = СоставКоманды.Игрок
	                      |			И Участники.Команда = СоставКоманды.Команда
	                      |ГДЕ
	                      |	Участники.Ссылка В
	                      |			(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |				СоставКоманды.Ссылка КАК Ссылка
	                      |			ИЗ
	                      |				Документ.Матч.СоставыКоманд КАК СоставКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матч
	                      |					ПО
	                      |						СоставКоманды.Ссылка = Матч.Регистратор
	                      |							И СоставКоманды.Команда = Матч.Команда
	                      |			ГДЕ
	                      |				Матч.Период МЕЖДУ &ДатаН И &ДатаК
	                      |				И СоставКоманды.Команда = &Команда
	                      |			УПОРЯДОЧИТЬ ПО
	                      |				ВЫБОР
	                      |					КОГДА Матч.Тур.Владелец = &Чемпионат
	                      |						ТОГДА 0
	                      |					ИНАЧЕ 99
	                      |				КОНЕЦ + РАЗНОСТЬДАТ(Матч.Период, &ДатаК, ДЕНЬ))
	                      |	И Участники.Команда = &Команда");
	Запрос.УстановитьПараметр("ДатаК", 		КонецДня(Объект.Дата - Сутки()));
	Запрос.УстановитьПараметр("ДатаН", 		ДобавитьМесяц(Объект.Дата, -3));
	Запрос.УстановитьПараметр("Команда",	Команда);
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() < 11 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СоставКоманды.Игрок КАК Игрок,
		               |	СоставКоманды.Команда КАК Команда
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаК, Игрок.ПометкаУдаления = ЛОЖЬ) КАК СоставКоманды
		               |ГДЕ
		               |	СоставКоманды.Команда = &Команда";
		Выборка = Запрос.Выполнить().Выбрать();
	КонецЕсли;
	Возврат Выборка;
КонецФункции

&НаСервере
Функция СоставыКомандДобавить(Выборка)
	ШалостьУдалась	= Ложь;
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Объект.СоставыКоманд.Добавить(), Выборка);
		ШалостьУдалась = Истина;
	КонецЦикла;
	Возврат ШалостьУдалась;
КонецФункции

&НаКлиенте
Процедура АнонсОбновить(Команда=Неопределено)
	Если КомандыДве(Команда <> Неопределено) Тогда
		Если Элементы.ГруппаАнонс.Видимость Тогда
			АнонсОбновитьНаСервере();
		Иначе
			АнонсОбновитьНаСервере2();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Чемпионат()
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Чемпионат	= СерверныйФункции.ЧемпионатНайти(Объект.Тур);
		Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
			Чемпионаты.ЗагрузитьЗначения(ЧемпионатыПолучить(Объект.Дата, КомандыПолучить()));
			Для Каждого Элемент Из Чемпионаты Цикл
				Чемпионат	= Элемент.Значение;
				Прервать;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	Возврат Чемпионат;
КонецФункции

&НаСервере
Процедура АнонсОбновитьПодсказки(КакЕсть=Ложь)
	Если КакЕсть Тогда
		Элементы.ИгрСНачалаСезонаХозяева.Подсказка	= "Количество игр";
		Элементы.ИгрСНачалаСезонаГости.Подсказка	= "Количество игр";
		Элементы.ОчкиХозяева.Подсказка				= "Количество очков";
		Элементы.ОчкиГости.Подсказка				= "Количество очков";
		Элементы.ПобедХозяева.Подсказка				= "Количество побед";
		Элементы.ПобедГости.Подсказка				= "Количество побед";
		Элементы.НичьихХозяева.Подсказка			= "Количество ничьих";
		Элементы.НичьихГости.Подсказка				= "Количество ничьих";
		Элементы.ПроигрышейХозяева.Подсказка		= "Количество проигрышей";
		Элементы.ПроигрышейГости.Подсказка			= "Количество проигрышей";
		Элементы.КоличествоГоловХозяева.Подсказка	= "Голов забито";
		Элементы.КоличествоГоловГости.Подсказка		= "Голов забито";
		Элементы.РезультативностьХозяева.Подсказка	= "Средняя результативность";
		Элементы.РезультативностьГости.Подсказка	= "Средняя результативность";
		Элементы.ПропущеноХозяева.Подсказка			= "Голов пропущено";
		Элементы.ПропущеноГости.Подсказка			= "Голов пропущено";
		Элементы.ПоследняяСерияДомашняя.Подсказка	= "Последняя беспроигрышная серия";
		Элементы.ПоследняяСерияГостевая.Подсказка	= "Последняя беспроигрышная серия";
	Иначе
		Элементы.ИгрСНачалаСезонаХозяева.Подсказка	= "Количество домашних игр";
		Элементы.ИгрСНачалаСезонаГости.Подсказка	= "Количество гостевых игр";
		Элементы.ОчкиХозяева.Подсказка				= "Количество очков в домашних играх";
		Элементы.ОчкиГости.Подсказка				= "Количество очков в гостевых играх";
		Элементы.ПобедХозяева.Подсказка				= "Количество домашних побед";
		Элементы.ПобедГости.Подсказка				= "Количество гостевых побед";
		Элементы.НичьихХозяева.Подсказка			= "Количество домашних ничьих";
		Элементы.НичьихГости.Подсказка				= "Количество гостевых ничьих";
		Элементы.ПроигрышейХозяева.Подсказка		= "Количество домашних проигрышей";
		Элементы.ПроигрышейГости.Подсказка			= "Количество гостевых проигрышей";
		Элементы.КоличествоГоловХозяева.Подсказка	= "Голов забито дома";
		Элементы.КоличествоГоловГости.Подсказка		= "Голов забито в гостях";
		Элементы.РезультативностьХозяева.Подсказка	= "Средняя домашняя результативность";
		Элементы.РезультативностьГости.Подсказка	= "Средняя гостевая результативность";
		Элементы.ПропущеноХозяева.Подсказка			= "Голов пропущено дома";
		Элементы.ПропущеноГости.Подсказка			= "Голов пропущено в гостях";
		Элементы.ПоследняяСерияДомашняя.Подсказка	= "Последняя беспроигрышная домашняя серия";
		Элементы.ПоследняяСерияГостевая.Подсказка	= "Последняя беспроигрышная гостевая серия";
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТекстЗапросаПоРезультатам(КакЕсть)
	Если КакЕсть Тогда
		Возврат "ВЫБРАТЬ
		        |	ТурнирнаяТаблица.Команда КАК Команда,
		        |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период,
		        |	ТурнирнаяТаблица.КоличествоОчков = 0 КАК Проигрыш,
		        |	МИНИМУМ(ТурнирнаяТаблица.Период) КАК ПериодМин
		        |ПОМЕСТИТЬ Даты
		        |ИЗ
		        |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		        |			ТурнирнаяТаблица.Команда КАК Команда,
		        |			ТурнирнаяТаблица.КоличествоОчков = 0 КАК Проигрыш
		        |		ИЗ
		        |			РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		        |				ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		        |		ГДЕ
		        |			ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		        |			И (ТурнирнаяТаблица.Период, ТурнирнаяТаблица.Команда) В
		        |					(ВЫБРАТЬ
		        |						МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период,
		        |						ТурнирнаяТаблица.Команда КАК Команда
		        |					ИЗ
		        |						РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |					ГДЕ
		        |						ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		        |						И ТурнирнаяТаблица.Команда В (&Команды)
		        |						И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		        |						И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		        |						И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		        |					СГРУППИРОВАТЬ ПО
		        |						ТурнирнаяТаблица.Команда)) КАК Статусы
		        |		ПО ТурнирнаяТаблица.Команда = Статусы.Команда
		        |ГДЕ
		        |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		        |	И ТурнирнаяТаблица.Команда В(&Команды)
		        |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		        |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		        |	И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		        |	И Статусы.Проигрыш = ЛОЖЬ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	ТурнирнаяТаблица.Команда,
		        |	ТурнирнаяТаблица.КоличествоОчков = 0
		        |;
		        |
		        |////////////////////////////////////////////////////////////////////////////////
		        |ВЫБРАТЬ
		        |	Периоды.Команда КАК Команда,
		        |	Периоды.Хозяева КАК Хозяева,
		        |	СУММА(ВЫБОР
		        |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		        |				ТОГДА 0
		        |			ИНАЧЕ 1
		        |		КОНЕЦ) КАК Количество
		        |ИЗ
		        |	(ВЫБРАТЬ
		        |		Даты.Команда КАК Команда,
		        |		ЕСТЬNULL(Проигрыши.Период, Даты.ПериодМин) КАК ПериодМин,
		        |		Даты.Период КАК ПериодМакс,
		        |		Даты.Команда = &Хозяева КАК Хозяева,
		        |		Даты.Проигрыш КАК Проигрыш
		        |	ИЗ
		        |		Даты КАК Даты
		        |			ЛЕВОЕ СОЕДИНЕНИЕ Даты КАК Проигрыши
		        |			ПО Даты.Команда = Проигрыши.Команда
		        |				И Даты.Период > Проигрыши.Период
		        |				И Даты.Проигрыш <> Проигрыши.Проигрыш
		        |	ГДЕ
		        |		Даты.Проигрыш = ЛОЖЬ) КАК Периоды
		        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		        |		ПО Периоды.Команда = ТурнирнаяТаблица.Команда
		        |ГДЕ
		        |	ТурнирнаяТаблица.Период МЕЖДУ Периоды.ПериодМин И Периоды.ПериодМакс
		        |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		        |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		        |	И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		        |
		        |СГРУППИРОВАТЬ ПО
		        |	Периоды.Команда,
		        |	Периоды.Хозяева";
	КонецЕсли;
	Возврат "ВЫБРАТЬ
	        |	ТурнирнаяТаблица.Команда КАК Команда,
	        |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период,
	        |	ТурнирнаяТаблица.КоличествоОчков = 0 КАК Проигрыш,
	        |	ТурнирнаяТаблица.НомерСтроки КАК НомерСтроки,
	        |	МИНИМУМ(ТурнирнаяТаблица.Период) КАК ПериодМин
	        |ПОМЕСТИТЬ Даты
	        |ИЗ
	        |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	        |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	        |			ТурнирнаяТаблица.Команда КАК Команда,
	        |			ТурнирнаяТаблица.КоличествоОчков = 0 КАК Проигрыш
	        |		ИЗ
	        |			РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	        |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	        |				ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	        |		ГДЕ
	        |			ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	        |			И ВЫБОР
	        |					КОГДА ТурнирнаяТаблица.Команда = &Хозяева
	        |						ТОГДА ТурнирнаяТаблица.НомерСтроки = 1
	        |					ИНАЧЕ ТурнирнаяТаблица.НомерСтроки = 2
	        |				КОНЕЦ
	        |			И (ТурнирнаяТаблица.Период, ТурнирнаяТаблица.Команда) В
	        |					(ВЫБРАТЬ
	        |						МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период,
	        |						ТурнирнаяТаблица.Команда КАК Команда
	        |					ИЗ
	        |						РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	        |					ГДЕ
	        |						ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	        |						И ТурнирнаяТаблица.Команда В (&Команды)
	        |						И ВЫБОР
	        |							КОГДА ТурнирнаяТаблица.Команда = &Хозяева
	        |								ТОГДА ТурнирнаяТаблица.НомерСтроки = 1
	        |							ИНАЧЕ ТурнирнаяТаблица.НомерСтроки = 2
	        |						КОНЕЦ
	        |						И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	        |						И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	        |						И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	        |					СГРУППИРОВАТЬ ПО
	        |						ТурнирнаяТаблица.Команда)) КАК Статусы
	        |		ПО ТурнирнаяТаблица.Команда = Статусы.Команда
	        |ГДЕ
	        |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	        |	И ТурнирнаяТаблица.Команда В(&Команды)
	        |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	        |	И ВЫБОР
	        |			КОГДА ТурнирнаяТаблица.Команда = &Хозяева
	        |				ТОГДА ТурнирнаяТаблица.НомерСтроки = 1
	        |			ИНАЧЕ ТурнирнаяТаблица.НомерСтроки = 2
	        |		КОНЕЦ
	        |	И Туры.Владелец = &Чемпионат
	        |	И Туры.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	        |	И Статусы.Проигрыш = ЛОЖЬ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ТурнирнаяТаблица.Команда,
	        |	ТурнирнаяТаблица.НомерСтроки,
	        |	ТурнирнаяТаблица.КоличествоОчков = 0
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Периоды.Команда КАК Команда,
	        |	Периоды.Хозяева КАК Хозяева,
	        |	СУММА(ВЫБОР
	        |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
	        |				ТОГДА 0
	        |			ИНАЧЕ 1
	        |		КОНЕЦ) КАК Количество
	        |ИЗ
	        |	(ВЫБРАТЬ
	        |		Даты.Команда КАК Команда,
	        |		ЕСТЬNULL(Проигрыши.Период, Даты.ПериодМин) КАК ПериодМин,
	        |		Даты.Период КАК ПериодМакс,
	        |		Даты.Команда = &Хозяева КАК Хозяева,
	        |		Даты.НомерСтроки КАК НомерСтроки,
	        |		Даты.Проигрыш КАК Проигрыш
	        |	ИЗ
	        |		Даты КАК Даты
	        |			ЛЕВОЕ СОЕДИНЕНИЕ Даты КАК Проигрыши
	        |			ПО Даты.Команда = Проигрыши.Команда
	        |				И Даты.Период > Проигрыши.Период
	        |				И Даты.Проигрыш <> Проигрыши.Проигрыш
	        |	ГДЕ
	        |		Даты.Проигрыш = ЛОЖЬ) КАК Периоды
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	        |			ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	        |		ПО Периоды.Команда = ТурнирнаяТаблица.Команда
	        |			И Периоды.НомерСтроки = ТурнирнаяТаблица.НомерСтроки
	        |ГДЕ
	        |	ТурнирнаяТаблица.Период МЕЖДУ Периоды.ПериодМин И Периоды.ПериодМакс
	        |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	        |	И Туры.Владелец = &Чемпионат
	        |	И Туры.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Периоды.Команда,
	        |	Периоды.Хозяева";
КонецФункции

&НаСервере
Функция ТекстЗапросаПоХронологии()
	Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	     	  |	ИСТИНА КАК Хозяева,
	     	  |	ТурнирнаяТаблица.Регистратор КАК Регистратор,
	     	  |	ТурнирнаяТаблица.Период КАК Период,
	     	  |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
	     	  |ПОМЕСТИТЬ ВТ
	     	  |ИЗ
	     	  |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	     	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	     	  |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	     	  |ГДЕ
	     	  |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	     	  |	И ТурнирнаяТаблица.Команда = &Хозяева
	     	  |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	     	  |	И Туры.Владелец = &Чемпионат
	     	  |
	     	  |ОБЪЕДИНИТЬ ВСЕ
	     	  |
	     	  |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	     	  |	ЛОЖЬ,
	     	  |	ТурнирнаяТаблица.Регистратор,
	     	  |	ТурнирнаяТаблица.Период,
	     	  |	ТурнирнаяТаблица.КоличествоОчков
	     	  |ИЗ
	     	  |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	     	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	     	  |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	     	  |ГДЕ
	     	  |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	     	  |	И ТурнирнаяТаблица.Команда = &Гости
	     	  |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	     	  |	И Туры.Владелец = &Чемпионат
	     	  |
	     	  |УПОРЯДОЧИТЬ ПО
	     	  |	Период УБЫВ
	     	  |;
	     	  |
	     	  |////////////////////////////////////////////////////////////////////////////////
	     	  |ВЫБРАТЬ
	     	  |	ВТ.Хозяева КАК Хозяева,
	     	  |	ВТ.Регистратор КАК Матч,
	     	  |	ВТ.Период КАК Период,
	     	  |	ВТ.КоличествоОчков КАК КоличествоОчков
	     	  |ИЗ
	     	  |	ВТ КАК ВТ
	     	  |
	     	  |УПОРЯДОЧИТЬ ПО
	     	  |	Хозяева УБЫВ,
	     	  |	Период";
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Текст = СтрУдалить(Текст, "И Туры.Владелец = &Чемпионат");
	КонецЕсли;
	Возврат СтрЗаменить(Текст, "5", Формат(КоличествоМатчейВАнонсе(), "ЧН=5; ЧГ=0"));
КонецФункции

&НаСервере
Процедура АнонсОбновитьНаСервере()
	Хозяева		= Хозяева();
	Если ПустаяСтрока(ИзображениеХозяева) Тогда
		ИзображениеХозяева	= ИзображениеПолучить(Хозяева);
	КонецЕсли;
	Гости		= Гости();
	Если ПустаяСтрока(ИзображениеГости) Тогда
		ИзображениеГости	= ИзображениеПолучить(Гости);
	КонецЕсли;
	
	ИгрСНачалаСезона	= 0;
	Очки				= 0;
	Побед				= 0;
	Ничьих				= 0;
	Проигрышей			= 0;
	КоличествоГолов		= 0;
	Результативность	= 0;
	РезультативностьХозяева	= 0;
	Пропущено			= 0;
	
	ИгрСНачалаСезонаГости	= 0;
	ОчкиГости				= 0;
	ПобедГости				= 0;
	НичьихГости				= 0;
	ПроигрышейГости			= 0;
	КоличествоГоловГости	= 0;
	РезультативностьГости	= 0;
	ПропущеноГости			= 0;
	
	ПоследняяСерия			= 0;
	ПоследняяСерияГостевая	= 0;
	
	Элементы.ИгрСНачалаСезона.МаксимальноеЗначение	= 0;
	Элементы.Очки.МаксимальноеЗначение				= 0;
	Элементы.Побед.МаксимальноеЗначение				= 0;
	Элементы.Ничьих.МаксимальноеЗначение			= 0;
	Элементы.Проигрышей.МаксимальноеЗначение		= 0;
	Элементы.КоличествоГолов.МаксимальноеЗначение	= 0;
	Элементы.Результативность.МаксимальноеЗначение	= 0;
	Элементы.Пропущено.МаксимальноеЗначение			= 0;
	Элементы.ПоследняяСерия.МаксимальноеЗначение	= 0;
	
	Тимз				= КомандыПолучить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.Команда КАК Команда,
	                      |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
	                      |	СУММА(1) КАК Количество,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоГолов,
	                      |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено,
	                      |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	                      |	И ВЫБОР
	                      |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
	                      |				ТОГДА ТурнирнаяТаблица.Команда = &Хозяева
	                      |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
	                      |				ТОГДА ТурнирнаяТаблица.Команда = &Гости
	                      |			ИНАЧЕ ЛОЖЬ
	                      |		КОНЕЦ
	                      |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда,
	                      |	ТурнирнаяТаблица.НомерСтроки,
	                      |	ТурнирнаяТаблица.КоличествоОчков
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Хозяева УБЫВ");
	Запрос.УстановитьПараметр("Команды",	Тимз);
	Запрос.УстановитьПараметр("Хозяева",	Хозяева);
	Запрос.УстановитьПараметр("Гости",		Гости);
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат());
	Запрос.УстановитьПараметр("ДатаК",		НачалоДня(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("ДатаН",		ДобавитьМесяц(Объект.Дата, -11));
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Запрос.Текст = СтрУдалить(Запрос.Текст, "И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат");
		Элементы.ДекорацияИгрСНачалаСезона.Заголовок	= "Игр за последний год";
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ИгрСНачалаСезона = ИгрСНачалаСезона + Выборка.Количество;
	КонецЦикла;
	КакЕсть	= АнонсВсеИгры Или (ИгрСНачалаСезона < 10);			// недостаточно игр с начала сезона
	ИгрСНачалаСезона	= 0;
	
	Если КакЕсть Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоГолов,
		               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		               |	И ТурнирнаяТаблица.Команда В(&Команды)
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Хозяева УБЫВ";
		Если НЕ ЗначениеЗаполнено(Чемпионат()) Тогда
			Запрос.Текст = СтрУдалить(Запрос.Текст, "И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат");
		КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		
		АнонсОбновитьПодсказки(Истина);
	Иначе
		Выборка.Сбросить();
		АнонсОбновитьПодсказки();
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		Элементы.ИгрСНачалаСезона.МаксимальноеЗначение	= Элементы.ИгрСНачалаСезона.МаксимальноеЗначение + Выборка.Количество;
		Элементы.Очки.МаксимальноеЗначение				= Элементы.Очки.МаксимальноеЗначение + Выборка.Количество * Выборка.КоличествоОчков;
		Если Выборка.Хозяева Тогда
			ИгрСНачалаСезона		= ИгрСНачалаСезона + Выборка.Количество;
			Очки					= Очки + Выборка.Количество * Выборка.КоличествоОчков;
		Иначе
			ИгрСНачалаСезонаГости	= ИгрСНачалаСезонаГости + Выборка.Количество;
			ОчкиГости				= ОчкиГости + Выборка.Количество * Выборка.КоличествоОчков;
		КонецЕсли;
		Если Выборка.КоличествоОчков = 0 Тогда
			Элементы.Проигрышей.МаксимальноеЗначение		= Элементы.Проигрышей.МаксимальноеЗначение + Выборка.Количество;
			Если Выборка.Хозяева Тогда
				Проигрышей			= Проигрышей + Выборка.Количество;
			Иначе
				ПроигрышейГости		= ПроигрышейГости + Выборка.Количество;
			КонецЕсли;
		ИначеЕсли Выборка.КоличествоОчков = 1 Тогда
			Элементы.Ничьих.МаксимальноеЗначение			= Элементы.Ничьих.МаксимальноеЗначение + Выборка.Количество;
			Если Выборка.Хозяева Тогда
				Ничьих				= Ничьих + Выборка.Количество;
			Иначе
				НичьихГости			= НичьихГости + Выборка.Количество;
			КонецЕсли;
		Иначе
			Элементы.Побед.МаксимальноеЗначение				= Элементы.Побед.МаксимальноеЗначение + Выборка.Количество;
			Если Выборка.Хозяева Тогда
				Побед				= Побед + Выборка.Количество;
			Иначе
				ПобедГости			= ПобедГости + Выборка.Количество;
			КонецЕсли;
		КонецЕсли;
		
		Элементы.КоличествоГолов.МаксимальноеЗначение	= Выборка.КоличествоГолов + Элементы.КоличествоГолов.МаксимальноеЗначение;
		Если Выборка.Хозяева Тогда
			КоличествоГолов				= КоличествоГолов + Выборка.КоличествоГолов;
		Иначе
			КоличествоГоловГости		= КоличествоГоловГости + Выборка.КоличествоГолов;
		КонецЕсли;
		
		Элементы.Пропущено.МаксимальноеЗначение	= Выборка.КоличествоПропущено + Элементы.Пропущено.МаксимальноеЗначение;
		Если Выборка.Хозяева Тогда
			Пропущено			= Пропущено + Выборка.КоличествоПропущено;
		Иначе
			ПропущеноГости		= ПропущеноГости + Выборка.КоличествоПропущено;
		КонецЕсли;
	КонецЦикла;
	РезультативностьХозяева	= ?(ИгрСНачалаСезона=0, 0, Окр(КоличествоГолов / ИгрСНачалаСезона, 1));
	РезультативностьГости	= ?(ИгрСНачалаСезонаГости=0, 0, Окр(КоличествоГоловГости / ИгрСНачалаСезонаГости, 1));
	Элементы.Результативность.МаксимальноеЗначение	= 10 * (РезультативностьХозяева + РезультативностьГости);
	Результативность		= 10 * РезультативностьХозяева;
	
	Если Объект.Тур.ОлимпийскаяСистема Тогда
		ОбщегоНазначения.УстановитьЗначение(Элементы.ДекорацияПоследняяСерия.Видимость,	Ложь);
		ОбщегоНазначения.УстановитьЗначение(Элементы.ГруппаПоследняяСерия.Видимость,	Ложь);
	Иначе
		ОбщегоНазначения.УстановитьЗначение(Элементы.ДекорацияПоследняяСерия.Видимость,	Истина);
		ОбщегоНазначения.УстановитьЗначение(Элементы.ГруппаПоследняяСерия.Видимость,	Истина);
		Запрос.Текст	= ТекстЗапросаПоРезультатам(КакЕсть);
		//Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		//	Запрос.Текст = СтрУдалить(Запрос.Текст, "И Туры.Владелец = &Чемпионат");
		//КонецЕсли;
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Элементы.ПоследняяСерия.МаксимальноеЗначение		= Элементы.ПоследняяСерия.МаксимальноеЗначение + Выборка.Количество;
			Если Выборка.Хозяева Тогда
				ПоследняяСерия			= Выборка.Количество;
			Иначе
				ПоследняяСерияГостевая	= Выборка.Количество;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ЭлементыУдалить();
	
	Запрос.Текст = ТекстЗапросаПоХронологии();
	Запрос.УстановитьПараметр("Гости",		Гости());
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МатчУстановить(?(Выборка.Хозяева, Элементы.ГруппаПредыдущие5Хозяева, Элементы.ГруппаПредыдущие5Гости), Выборка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЭлементыУдалить(Викимз=Неопределено)
	Если Викимз = Неопределено Тогда
		ЭлементыУдалить(Элементы.ГруппаПредыдущие5Хозяева.ПодчиненныеЭлементы);
		ЭлементыУдалить(Элементы.ГруппаПредыдущие5Гости.ПодчиненныеЭлементы);
		Гиперссылки.Очистить();
	Иначе
		Пока Викимз.Количество() > 0 Цикл
			Для Каждого Элемент Из Викимз Цикл
				Элементы.Удалить(Элемент);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МатчОткрыть(Элемент)
	НаКлиенте.ПоНавигационнойСсылкеПерейти(Гиперссылки.НайтиПоЗначению(Элемент.Имя).Представление);
КонецПроцедуры

&НаСервере
Процедура МатчУстановить(Родитель, Выборка)
	Элемент = Элементы.Добавить("_" + Лев(Новый УникальныйИдентификатор, 8), Тип("ДекорацияФормы"), Родитель);
	Элемент.Гиперссылка						= Истина;
	Элемент.Подсказка						= Выборка.Матч;
	Элемент.ПропускатьПриВводе				= Истина;
	Элемент.УстановитьДействие("Нажатие", "МатчОткрыть");
	Если Выборка.КоличествоОчков = 0 Тогда
		Элемент.Заголовок	= "L";
		Элемент.ЦветТекста	= ЦветаСтиля.ЦветОтрицательногоЧисла;
	ИначеЕсли Выборка.КоличествоОчков = 1 Тогда
		Элемент.Заголовок	= "D";
	Иначе
		Элемент.Заголовок	= "W";
		Элемент.ЦветТекста	= ЦветаСтиля.ЦветАкцента;
	КонецЕсли;
	Гиперссылки.Добавить(Элемент.Имя, ПолучитьНавигационнуюСсылку(Выборка.Матч));
КонецПроцедуры

&НаСервере
Процедура АнонсОбновитьНаСервере2()
	Сезон.Очистить();
	Предыдущие5.Очистить();
	Макет	= ПолучитьОбщийМакет("Матчи");
	Сколько	= КоличествоМатчейВАнонсе();
	
	Для Каждого тСтрока Из Объект.Команды Цикл
		Стат = СтатистикаИгр(тСтрока.Команда);
		Для Каждого ТекЭлемент Из Стат Цикл
			нСтрока = Сезон.Добавить();
			ЗаполнитьЗначенияСвойств(нСтрока, ТекЭлемент);
			нСтрока.Команда	= тСтрока.Команда;
		КонецЦикла;

		Выборка = МатчиПоследние5(тСтрока.Команда, Сколько);
		Итератор = 0;
		Для Каждого Детали Из Выборка Цикл
			Область = Макет.ПолучитьОбласть("История|CC");
			Область.Параметры.Заполнить(Детали);
			Предыдущие5.Вывести(Область);
		
			Итератор = Итератор + 1;
			Прервать;
		КонецЦикла;
		Если Итератор > 0 Тогда
			Для Каждого Детали Из Выборка Цикл
				Область = Макет.ПолучитьОбласть("История|" + Детали.Результат);
				Область.Параметры.Заполнить(Детали);
				Предыдущие5.Присоединить(Область);
				Итератор = Итератор + 1;
			КонецЦикла;
			Пока Итератор <= Сколько Цикл
				Предыдущие5.Присоединить(Макет.ПолучитьОбласть("История|EE"));
				Итератор = Итератор + 1;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Предыдущие5.ФиксацияСверху	= 2;
	Предыдущие5.ФиксацияСлева	= Сколько + 1;
КонецПроцедуры

&НаСервере
Функция УстановитьСерию(Граф, Элемент)
	Серия		= Граф.УстановитьСерию(Биоритмы.ФЭИ(Элемент));
	Серия.Цвет	= Биоритмы.Цвет(Элемент);
	Возврат Серия;
КонецФункции

&НаСервере
Процедура ГрафикОбновитьНаСервере()
	График.Очистить();
	Если КомандыДве(Истина) Тогда
		Серия1	= УстановитьСерию(График, 1);
		Серия2	= УстановитьСерию(График, 2);
		Серия3	= УстановитьСерию(График, 3);
		Выборка = ГрафикПолучитьНаСервере();
		Пока Выборка.Следующий() Цикл
			Точка	= График.УстановитьТочку(Выборка.Команда);
			График.УстановитьЗначение(Точка, Серия1, Выборка.Фаза1);
			График.УстановитьЗначение(Точка, Серия2, Выборка.Фаза2);
			График.УстановитьЗначение(Точка, Серия3, Выборка.Фаза3);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ГрафикПолучитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Перемещения.Команда КАК Команда,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза1 <= 23 / 4
	                      |				ТОГДА Игроки.Фаза1 * 25 / 23
	                      |			КОГДА Игроки.Фаза1 <= 23 / 2
	                      |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
	                      |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
	                      |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
	                      |		КОНЕЦ, 1) КАК Фаза1,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза2 <= 28 / 4
	                      |				ТОГДА Игроки.Фаза2 * 25 / 28
	                      |			КОГДА Игроки.Фаза2 <= 28 / 2
	                      |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
	                      |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
	                      |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
	                      |		КОНЕЦ, 1) КАК Фаза2,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза3 <= 33 / 4
	                      |				ТОГДА Игроки.Фаза3 * 25 / 33
	                      |			КОГДА Игроки.Фаза3 <= 33 / 2
	                      |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
	                      |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
	                      |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
	                      |		КОНЕЦ, 1) КАК Фаза3
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
	                      |			&Дата,
	                      |			Игрок В (&Игроки)
	                      |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			Игроки.Ссылка КАК Ссылка,
	                      |			Игроки.Амплуа КАК Амплуа,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
	                      |		ИЗ
	                      |			Справочник.Игроки КАК Игроки
	                      |		ГДЕ
	                      |			Игроки.Ссылка В(&Игроки)
	                      |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
	                      |		ПО Перемещения.Игрок = Игроки.Ссылка
	                      |ГДЕ
	                      |	Перемещения.Команда В(&Команда)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Перемещения.Команда = &Хозяева УБЫВ
	                      |ИТОГИ
	                      |	СУММА(Фаза1),
	                      |	СУММА(Фаза2),
	                      |	СУММА(Фаза3)
	                      |ПО
	                      |	Команда");
	Если ЗначениеЗаполнено(Амплуа) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Команда КАК Команда,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок В (&Игроки)
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.Ссылка В(&Игроки)
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда В(&Команда)
		               |	И ЕСТЬNULL(Перемещения.Игрок.Амплуа.Ссылка, Игроки.Амплуа) = &Амплуа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Перемещения.Команда = &Хозяева УБЫВ
		               |ИТОГИ
		               |	СУММА(Фаза1),
		               |	СУММА(Фаза2),
		               |	СУММА(Фаза3)
		               |ПО
		               |	Команда";
		Запрос.УстановитьПараметр("Амплуа",		Амплуа);
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",		Объект.Дата);
	Запрос.УстановитьПараметр("Команда",	Объект.Команды.Выгрузить(, "Команда").ВыгрузитьКолонку(0));
	Запрос.УстановитьПараметр("Хозяева",	Хозяева());
	мИгрок	= Объект.СоставыКоманд.Выгрузить(, "Игрок").ВыгрузитьКолонку(0);
	Запрос.УстановитьПараметр("Игроки",		мИгрок);
	Если мИгрок.Количество() > 0 Тогда
		//
	ИначеЕсли ЗначениеЗаполнено(Амплуа) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Команда КАК Команда,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок.ПометкаУдаления = ЛОЖЬ
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.ПометкаУдаления = ЛОЖЬ
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда В(&Команда)
		               |	И ЕСТЬNULL(Перемещения.Игрок.Амплуа.Ссылка, Игроки.Амплуа) = &Амплуа
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Перемещения.Команда = &Хозяева УБЫВ
		               |ИТОГИ
		               |	СУММА(Фаза1),
		               |	СУММА(Фаза2),
		               |	СУММА(Фаза3)
		               |ПО
		               |	Команда";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Команда КАК Команда,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок.ПометкаУдаления = ЛОЖЬ
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.ПометкаУдаления = ЛОЖЬ
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда В(&Команда)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Перемещения.Команда = &Хозяева УБЫВ
		               |ИТОГИ
		               |	СУММА(Фаза1),
		               |	СУММА(Фаза2),
		               |	СУММА(Фаза3)
		               |ПО
		               |	Команда";
	КонецЕсли;
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

&НаКлиенте
Процедура ГрафикОбновить(Команда)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоставыЗаполнить(Команда)
	Если КомандыДве(Истина) Тогда
		СоставыЗаполнитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КомандыДве(Сообщать=Ложь)
	Если Объект.Команды.Количество() = 2 Тогда Возврат Истина; КонецЕсли;
	Если Сообщать Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Сначала заполните таблицу 'Команды' ",, Объект.Ссылка, "Объект.Команды");
		Элементы.Страницы.ТекущаяСтраница = Элементы.ГруппаКоманды;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция КомандыПолучить()
	Ответ	= Новый Массив;
	Для Каждого ТекСтрока Из Объект.Команды Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Команда) Тогда
			Ответ.Добавить(ТекСтрока.Команда);
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	Если Элементы.ГруппаСравнение = ТекущаяСтраница Тогда
		Если График.КоличествоСерий <> 3 И Объект.СоставыКоманд.Количество() > 0 Тогда
			ГрафикОбновитьНаСервере();
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаАнонс = ТекущаяСтраница Тогда
		Если ИгрСНачалаСезона = 0 Тогда
			АнонсОбновить();
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаАнонс2 = ТекущаяСтраница Тогда
		Если Сезон.Количество() = 0 Тогда
			АнонсОбновить();
		КонецЕсли;
	ИначеЕсли Элементы.ГруппаБиоритмы = ТекущаяСтраница Тогда
		Если График2.КоличествоСерий = 0 И Объект.СоставыКоманд.Количество() > 0 Тогда
			График2Обновить();
		КонецЕсли;
		
	ИначеЕсли Элементы.ГруппаМатчи = ТекущаяСтраница Тогда
		Если ПредыдущиеВстречиКоличество = 0 Тогда
			ПредыдущиеВстречиОбновитьНаСервере();
			ПредыдущиеМатчиОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Хозяева()
	Возврат ?(Объект.Команды.Количество() = 0, Справочники.Команды.ПустаяСсылка(), Объект.Команды.Получить(0).Команда);
КонецФункции

&НаСервере
Функция Гости()
	Возврат ?(Объект.Команды.Количество() < 2, Справочники.Команды.ПустаяСсылка(), Объект.Команды.Получить(1).Команда);
КонецФункции

&НаСервере
Процедура СтадионПриИзмененииНаСервере()
	тКоманда = Объект.Стадион.Владелец;
	Если ЗначениеЗаполнено(тКоманда) И ТипЗнч(тКоманда) = Тип("СправочникСсылка.Команды") Тогда
		мКоманды = Объект.Команды.НайтиСтроки(Новый Структура("Команда", тКоманда));
		Если мКоманды.Количество() = 0 Тогда
			Если Объект.Команды.Количество() = 0 Тогда
				тСтрока = Объект.Команды.Добавить();
			Иначе
				тСтрока = Объект.Команды.Получить(0);
			КонецЕсли;
			тСтрока.Команда = тКоманда;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтадионПриИзменении(Элемент)
	СтадионПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоставыКомандИгрокПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
	ЗаполнитьЗначенияСвойств(Элементы.СоставыКоманд.ТекущиеДанные, ДанныеИгрока(Элементы.СоставыКоманд.ТекущиеДанные.Игрок));
КонецПроцедуры

&НаКлиенте
Процедура АмплуаПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидСпортаУстановить()
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		ОбщегоНазначения.УстановитьЗначение(ВидСпорта, СерверныйФункции.ВидСпорта(Чемпионат));
	ИначеЕсли ЗначениеЗаполнено(Объект.Тур) Тогда
		ОбщегоНазначения.УстановитьЗначение(ВидСпорта, СерверныйФункции.ВидСпорта(Объект.Тур));
	ИначеЕсли ЗначениеЗаполнено(Хозяева()) Тогда
		ОбщегоНазначения.УстановитьЗначение(ВидСпорта, СерверныйФункции.ВидСпорта(Хозяева()));
	Иначе
		ОбщегоНазначения.УстановитьЗначение(ВидСпорта, СерверныйФункции.ВидыСпорта());
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатУстановить()
	Если Объект.Проведен И НЕ ЗначениеЗаполнено(Объект.Тур) Тогда
		//
	ИначеЕсли ЗначениеЗаполнено(Объект.Тур) Тогда
		Чемпионат	= СерверныйФункции.ЧемпионатНайти(Объект.Тур);
	ИначеЕсли НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Ч	= Чемпионат();
	КонецЕсли;
	ВидСпортаУстановить();
КонецПроцедуры

&НаСервере
Функция МатчиВсеЗаписаны()
	Ответ	= Ложь;
	Если ЗначениеЗаполнено(Объект.Тур) Тогда
		КоличествоМатчей = СерверныйФункции.КоличествоМатчей(Объект.Тур);
		Если Объект.Тур.ОлимпийскаяСистема Тогда
			
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Изображение	= ИзображениеПолучить(Объект.Ссылка);
	
	Если Объект.Ссылка.Пустая() Тогда
		Если МатчиВсеЗаписаны() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Матчи все записаны", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата	= НачалоДня(ТекущаяДатаСеанса());
		КонецЕсли;
	КонецЕсли;
	Если СтарыйВидАнонсов() Тогда
		Элементы.ГруппаАнонс.Видимость	= Ложь;
	Иначе
		Элементы.ГруппаАнонс2.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеСтраницы() Экспорт
	Если Элементы.ГруппаАнонс.Доступность
	Или Элементы.ГруппаАнонс2.Доступность
	Тогда
		АнонсОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	ЧемпионатУстановить();
	ЧемпионатПриИзмененииНаСервере();
	ТурПриИзмененииНаСервере();
	КомандыПриИзмененииНаСервере();
	СоставыЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(Отказ);
	
	Если НЕ Объект.Ссылка.Пустая() И НЕ АнонсВсеИгры Тогда
		АнонсВсеИгры = НЕ ЗначениеЗаполнено(Чемпионат());
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	ПодключитьОбработчикОжидания("ОбновлениеСтраницы", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьУстановить(Перечитать=Ложь)
	Если Перечитать Тогда
		Прочитать();
	КонецЕсли;
	
	Если ЭтоДерби() Тогда
		Элементы.ЭтоДерби.Видимость					= Истина;
		Элементы.ОтчетДербиКомандаДерби.Доступность	= Истина;
	Иначе
		Элементы.ЭтоДерби.Видимость					= Ложь;
		Элементы.ОтчетДербиКомандаДерби.Доступность	= Ложь;
	КонецЕсли;
	Элементы.ГруппаАнонс.Доступность		= (НЕ Объект.Ссылка.Пустая());
	Элементы.ГруппаАнонс2.Доступность		= (НЕ Объект.Ссылка.Пустая());
	Элементы.ГруппаМатчи.Доступность		= (Объект.Команды.Количество() = 2);
	
	Элементы.КомандыПенальти.Видимость		= ?(ЗначениеЗаполнено(Объект.Тур), Объект.Тур.ОлимпийскаяСистема, Истина);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СоставыЗагрузитьНаСервере();
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервере
Процедура КомандыПриИзмененииНаСервере()
	ИзображениеХозяева	= "";
	ИзображениеГости	= "";
	Элементы.График2Команда.СписокВыбора.Очистить();
	
	СписокШиндлера	= Новый Массив;
	мКоманды = Новый Массив;
	
	Если КомандыДве() Тогда
		ЧемпионатУстановить();
	КонецЕсли;
	Для Каждого ТекСтрока Из Объект.Команды Цикл
		Если ЗначениеЗаполнено(ТекСтрока.Команда) Тогда
			мКоманды.Добавить(ТекСтрока.Команда);
			
			Если ТекСтрока.НомерСтроки = 1 Тогда
				СтадионыЗагрузитьНаСервере(ТекСтрока.Команда);
			КонецЕсли;
			
			Элементы.График2Команда.СписокВыбора.Добавить(ТекСтрока.Команда);
			Если НЕ ЗначениеЗаполнено(График2Команда) Тогда
				График2Команда = ТекСтрока.Команда;
			КонецЕсли;
			
		ИначеЕсли ТекСтрока.НомерСтроки = 1
		И Модифицированность
		И ЗначениеЗаполнено(Объект.Стадион)
		Тогда
			Объект.Стадион = Справочники.Стадионы.ПустаяСсылка();
		КонецЕсли;
	КонецЦикла;
	КартинкиЗагрузитьНаСервере();
	
	Для Каждого ТекСтрока Из Объект.СоставыКоманд Цикл
		Если мКоманды.Найти(ТекСтрока.Команда) = Неопределено Тогда
			СписокШиндлера.Добавить(ТекСтрока);
		КонецЕсли;
	КонецЦикла;
	
	Если Модифицированность Тогда
		Для Каждого ТекСтрока Из СписокШиндлера Цикл
			Объект.СоставыКоманд.Удалить(ТекСтрока);
		КонецЦикла;
	КонецЕсли;
	
	ТЧОчистить();
	Игроки.ЗагрузитьЗначения(ИгрокиПолучить());
КонецПроцедуры

&НаКлиенте
Процедура КомандыПриИзменении(Элемент=Неопределено)
	Если Объект.Команды.Количество() = 0 Тогда
		Если Модифицированность
		И ЗначениеЗаполнено(Объект.Стадион)
		Тогда
			Объект.Стадион		= Неопределено;
		КонецЕсли;
		
	ИначеЕсли Модифицированность
	И НЕ ЗначениеЗаполнено(Объект.Тур)
	И КомандыДве()
	Тогда
		Объект.Тур			= ТурПолучить();
	КонецЕсли;
	
	КомандыПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Функция СтадионНайти(Тим)
	Если ЗначениеЗаполнено(Объект.Тур) Тогда
		Ответ = РеквизитФормыВЗначение("Объект").СтадионНайти(Новый Структура("Команда,Тур", Тим, Объект.Тур));
	Иначе
		Ответ = РеквизитФормыВЗначение("Объект").СтадионНайти(Тим);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ИгрокиПолучить()
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Перемещения.Игрок КАК Игрок
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК Перемещения
	                      |ГДЕ
	                      |	Перемещения.Команда В(&Команды)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Игрок");
	Запрос.УстановитьПараметр("Дата",		Объект.Дата);
	Запрос.УстановитьПараметр("Команды",	КомандыПолучить());
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаСервере
Процедура ПредыдущиеВстречиОбновитьНаСервере()
	ПредыдущиеВстречиКоличество	= 0;
	ПредыдущиеВстречи.Очистить();
	Если Объект.Команды.Количество() <> 2 Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Матч.Дата КАК Дата,
	                      |	Матч.Счет КАК Счет,
	                      |	Матч.Ссылка КАК Матч,
	                      |	ЕСТЬNULL(Матч.Тур.Владелец, ""Товарищеский матч"") КАК Чемпионат,
	                      |	ТурнирнаяТаблица.Команда = &Хозяева
	                      |		И ТурнирнаяТаблица.НомерСтроки = 1 КАК Хозяева
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	                      |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	                      |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Команда = &Хозяева
	                      |	И Противник.Команда = &Гости
	                      |	И Матч.Дата <= &ДатаК
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Если МатчиФильтр = 1 И ЗначениеЗаполнено(Чемпионат()) И Чемпионат.Владелец.ОлимпийскаяСистема Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	Матч.Тур.Владелец КАК Чемпионат,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Хозяева
		               |	И Противник.Команда = &Гости
		               |	И Матч.Тур.Владелец.Владелец В
		               |			(ВЫБРАТЬ
		               |				Чемпионаты.Владелец
		               |			ИЗ
		               |				Справочник.Чемпионаты КАК Чемпионаты
		               |			ГДЕ
		               |				Чемпионаты.Ссылка = &Чемпионат)
		               |	И Матч.Дата <= &ДатаК
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	ИначеЕсли МатчиФильтр = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	Матч.Тур.Владелец КАК Чемпионат,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Хозяева
		               |	И Противник.Команда = &Гости
		               |	И Матч.Тур.Владелец = &Чемпионат
		               |	И Матч.Дата <= &ДатаК
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	ИначеЕсли МатчиФильтр = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	ЕСТЬNULL(Матч.Тур.Владелец, ""Товарищеский матч"") КАК Чемпионат,
		               |	ЛОЖЬ КАК Хозяева
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |		ПО Матч.Ссылка = ТурнирнаяТаблица.Регистратор
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Хозяева
		               |	И ТурнирнаяТаблица.НомерСтроки = 1
		               |	И Противник.Команда = &Гости
		               |	И Противник.НомерСтроки = 2
		               |	И Матч.Дата <= &ДатаК
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаК",			НачалоДня(Объект.Дата - Сутки()));
	Запрос.УстановитьПараметр("Команды",		КомандыПолучить());
	Запрос.УстановитьПараметр("Хозяева",		Хозяева());
	Запрос.УстановитьПараметр("Гости",			Гости());
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Макет = ПолучитьОбщийМакет("Матчи");
	ПредыдущиеВстречи.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Пока Выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть(?(Выборка.Хозяева, "Хозяева", "Детали"));
		Область.Параметры.Заполнить(Выборка);
		ПредыдущиеВстречи.Вывести(Область);
	КонецЦикла;
	ПредыдущиеВстречи.ФиксацияСверху	= 1;
	
	ПредыдущиеВстречиКоличество	= Выборка.Количество();
КонецПроцедуры

&НаСервере
Процедура ПредыдущиеМатчиОбновитьНаСервере()
	ПредыдущиеМатчи.Очистить();
	Если Объект.Команды.Количество() <> 2 Тогда Возврат; КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Матч.Дата КАК Дата,
	                      |	Матч.Счет КАК Счет,
	                      |	Матч.Ссылка КАК Матч,
	                      |	Туры.Владелец КАК Чемпионат,
	                      |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
	                      |	И ТурнирнаяТаблица.Команда В(&Команды)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Если МатчиФильтр = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	Туры.Владелец КАК Чемпионат,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		               |	И ТурнирнаяТаблица.Команда В(&Команды)
		               |	И Туры.Владелец = &Чемпионат
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	ИначеЕсли МатчиФильтр = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	Туры.Владелец КАК Чемпионат,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
					   |	И ТурнирнаяТаблица.Команда В(&Команды)
		               |	И ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.Команда = &Хозяева
		               |				ТОГДА ТурнирнаяТаблица.НомерСтроки = 1
		               |			ИНАЧЕ ТурнирнаяТаблица.НомерСтроки = 2
		               |		КОНЕЦ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	ИначеЕсли МатчиФильтр = 3 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Дата КАК Дата,
		               |	Матч.Счет КАК Счет,
		               |	Матч.Ссылка КАК Матч,
		               |	Туры.Владелец КАК Чемпионат,
		               |	ТурнирнаяТаблица.Команда = &Хозяева КАК Хозяева
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК ВсеКоманды
		               |		ПО ТурнирнаяТаблица.Команда = ВсеКоманды.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		               |	И ТурнирнаяТаблица.Команда В(&Команды)
		               |	И ВсеКоманды.Город В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				Города.Ссылка КАК Ссылка
		               |			ИЗ
		               |				Справочник.Команды КАК Команды
		               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |					ПО
		               |						Команды.Город = Города.Ссылка
		               |			ГДЕ
		               |				ТурнирнаяТаблица.Период МЕЖДУ &ДатаН И &ДатаК
		               |				И Команды.Ссылка В (&Команды))
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("ДатаК",			НачалоДня(Объект.Дата) - 1);
	Запрос.УстановитьПараметр("ДатаН",			НачалоМесяца(ДобавитьМесяц(Объект.Дата, -24)));
	Запрос.УстановитьПараметр("Команды",		КомандыПолучить());
	Запрос.УстановитьПараметр("Хозяева",		Хозяева());
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат());
	Выборка = Запрос.Выполнить().Выбрать();
	Макет = ПолучитьОбщийМакет("Матчи");
	ПредыдущиеМатчи.Вывести(Макет.ПолучитьОбласть("Шапка"));
	Было = Новый Соответствие;
	Пока Выборка.Следующий() Цикл
		Если Было.Получить(Выборка.Матч) = Неопределено Тогда
			Было.Вставить(Выборка.Матч, Выборка.Матч);
			
			Область = Макет.ПолучитьОбласть(?(Выборка.Хозяева, "Хозяева", "Детали"));
			Область.Параметры.Заполнить(Выборка);
			ПредыдущиеМатчи.Вывести(Область);
		КонецЕсли;
	КонецЦикла;
	ПредыдущиеМатчи.ФиксацияСверху	= 1;
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущиеВстречиОбновить(Команда)
	ПредыдущиеВстречиОбновитьНаСервере();
	ПредыдущиеМатчиОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура КартинкиЗагрузитьНаСервере()
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		ОбщегоНазначения.КартинкиЗагрузить(Элементы.КомандыКоманда.СписокВыбора, Кеш);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	КартинкиЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТурПриИзмененииНаСервере()
	КомандыТура.ЗагрузитьЗначения(КомандыТураПолучить());
	Элементы.КомандыКоманда.СписокВыбора.ЗагрузитьЗначения(КомандыТура.ВыгрузитьЗначения());
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ТурПриИзменении(Элемент)
	ТурПриИзмененииНаСервере();
	
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура СтадионыЗагрузитьНаСервере(Клуб=Неопределено)
	Если Клуб = Неопределено Тогда
		Если Объект.Команды.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		Клуб = Объект.Команды.Получить(0).Команда;
	КонецЕсли;
	
	Стадионы.Очистить();
	Стадион	= 	СтадионНайти(Клуб);
	Если ТипЗнч(Стадион) = Тип("Массив") Тогда
		Стадионы.ЗагрузитьЗначения(Стадион);
	ИначеЕсли ЗначениеЗаполнено(Стадион) Тогда
		Стадионы.Добавить(Стадион);
	КонецЕсли;
	Если Модифицированность И НЕ Объект.Проведен Тогда
		Если Стадионы.Количество() = 1 Тогда
			ОбщегоНазначения.УстановитьЗначение(Объект.Стадион, Стадионы.Получить(0).Значение);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СтадионыЗагрузить() Экспорт
	СтадионыЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("ДокументСсылка.Матч") Тогда
		Если Параметр = Объект.Ссылка Тогда
			Прочитать();
			КешОчистить();
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Команды") Тогда
		//КомандыЗагрузить();
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки") Тогда
		КешОчистить(Параметр);
		Если ТекущийИгрок = Параметр Тогда
			ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Стадионы") Тогда
		ПодключитьОбработчикОжидания("СтадионыЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставыКомандПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Команды.Количество() = 0 Тогда Отказ = Истина; КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	КомандыПриИзменении();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТурыПолучить(Дата, Чемпионат)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |			И (ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И &Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Ссылка
	                      |
	                      |ИМЕЮЩИЕ
	                      |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор), 0) * 2 < КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.Код");
	Запрос.УстановитьПараметр("Дата",			НачалоДня(Дата));
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ТурНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Туры.ЗагрузитьЗначения(ТурыПолучить(Объект.Дата, Чемпионат));
КонецПроцедуры

&НаСервере
Процедура График2ОбновитьНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Перемещения.Игрок КАК Точка,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза1 <= 23 / 4
	                      |				ТОГДА Игроки.Фаза1 * 25 / 23
	                      |			КОГДА Игроки.Фаза1 <= 23 / 2
	                      |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
	                      |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
	                      |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
	                      |		КОНЕЦ, 1) КАК Фаза1,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза2 <= 28 / 4
	                      |				ТОГДА Игроки.Фаза2 * 25 / 28
	                      |			КОГДА Игроки.Фаза2 <= 28 / 2
	                      |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
	                      |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
	                      |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
	                      |		КОНЕЦ, 1) КАК Фаза2,
	                      |	ОКР(ВЫБОР
	                      |			КОГДА Игроки.Фаза3 <= 33 / 4
	                      |				ТОГДА Игроки.Фаза3 * 25 / 33
	                      |			КОГДА Игроки.Фаза3 <= 33 / 2
	                      |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
	                      |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
	                      |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
	                      |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
	                      |		КОНЕЦ, 1) КАК Фаза3
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
	                      |			&Дата,
	                      |			Игрок В (&Игроки)
	                      |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |			Игроки.Ссылка КАК Ссылка,
	                      |			Игроки.Амплуа КАК Амплуа,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
	                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
	                      |		ИЗ
	                      |			Справочник.Игроки КАК Игроки
	                      |		ГДЕ
	                      |			Игроки.Ссылка В(&Игроки)
	                      |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
	                      |		ПО Перемещения.Игрок = Игроки.Ссылка
	                      |ГДЕ
	                      |	Перемещения.Команда = &Команда
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Код, Игроки.Амплуа.Код)");
	Если График2Группировать Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Ссылка, Игроки.Амплуа) КАК Точка,
		               |	Перемещения.Игрок КАК Игрок,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок В (&Игроки)
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.Ссылка В(&Игроки)
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Код, Игроки.Амплуа.Код),
		               |	Игрок
		               |ИТОГИ
		               |	СУММА(Фаза1),
		               |	СУММА(Фаза2),
		               |	СУММА(Фаза3)
		               |ПО
		               |	Точка
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",		Объект.Дата);
	Запрос.УстановитьПараметр("Команда",	График2Команда);
	мИгрок	= Объект.СоставыКоманд.Выгрузить(Новый Структура("Команда", График2Команда), "Игрок").ВыгрузитьКолонку(0);
	Запрос.УстановитьПараметр("Игроки",		мИгрок);
	Запрос.УстановитьПараметр("ДатаК", 		КонецДня(Объект.Дата - Сутки()));
	Запрос.УстановитьПараметр("ДатаН", 		НачалоМесяца(ДобавитьМесяц(Объект.Дата, -6)));
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Если мИгрок.Количество() > 0 Тогда
		//
	ИначеЕсли График2Группировать Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Ссылка, Игроки.Амплуа) КАК Точка,
		               |	Перемещения.Игрок КАК Игрок,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок.ПометкаУдаления = ЛОЖЬ
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.ПометкаУдаления = ЛОЖЬ
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |	И Перемещения.Игрок В
		               |			(ВЫБРАТЬ
		               |				Участники.Игрок
		               |			ИЗ
		               |				Документ.Матч.СоставыКоманд КАК Участники
		               |			ГДЕ
		               |				Участники.Ссылка В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						СоставКоманды.Ссылка КАК Ссылка
		               |					ИЗ
		               |						Документ.Матч.СоставыКоманд КАК СоставКоманды
		               |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матч
		               |							ПО
		               |								СоставКоманды.Ссылка = Матч.Регистратор
		               |									И СоставКоманды.Команда = Матч.Команда
		               |					ГДЕ
		               |						Матч.Период МЕЖДУ &ДатаН И &ДатаК
		               |						И СоставКоманды.Команда = &Команда
		               |					УПОРЯДОЧИТЬ ПО
		               |						ВЫБОР
		               |							КОГДА Матч.Тур.Владелец = &Чемпионат
		               |								ТОГДА 0
		               |							ИНАЧЕ 11
		               |						КОНЕЦ + РАЗНОСТЬДАТ(Матч.Период, &ДатаК, ДЕНЬ)))
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Код, Игроки.Амплуа.Код),
		               |	Игрок
		               |ИТОГИ
		               |	СУММА(Фаза1),
		               |	СУММА(Фаза2),
		               |	СУММА(Фаза3)
		               |ПО
		               |	Точка
		               |АВТОУПОРЯДОЧИВАНИЕ";
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Игрок КАК Точка,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза1 <= 23 / 4
		               |				ТОГДА Игроки.Фаза1 * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 2
		               |				ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		               |			КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		               |			ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		               |		КОНЕЦ, 1) КАК Фаза1,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза2 <= 28 / 4
		               |				ТОГДА Игроки.Фаза2 * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 2
		               |				ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		               |			КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		               |			ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		               |		КОНЕЦ, 1) КАК Фаза2,
		               |	ОКР(ВЫБОР
		               |			КОГДА Игроки.Фаза3 <= 33 / 4
		               |				ТОГДА Игроки.Фаза3 * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 2
		               |				ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		               |			КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		               |				ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		               |			ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		               |		КОНЕЦ, 1) КАК Фаза3
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(
		               |			&Дата,
		               |			Игрок.ПометкаУдаления = ЛОЖЬ
		               |				И ГОД(Игрок.ДатаРождения) >= 1900) КАК Перемещения
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Игроки.Ссылка КАК Ссылка,
		               |			Игроки.Амплуа КАК Амплуа,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		               |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		               |		ИЗ
		               |			Справочник.Игроки КАК Игроки
		               |		ГДЕ
		               |			Игроки.ПометкаУдаления = ЛОЖЬ
		               |			И ГОД(Игроки.ДатаРождения) >= 1900) КАК Игроки
		               |		ПО Перемещения.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |	И Перемещения.Игрок В
		               |			(ВЫБРАТЬ
		               |				Участники.Игрок
		               |			ИЗ
		               |				Документ.Матч.СоставыКоманд КАК Участники
		               |			ГДЕ
		               |				Участники.Ссылка В
		               |					(ВЫБРАТЬ ПЕРВЫЕ 1
		               |						СоставКоманды.Ссылка КАК Ссылка
		               |					ИЗ
		               |						Документ.Матч.СоставыКоманд КАК СоставКоманды
		               |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матч
		               |							ПО
		               |								СоставКоманды.Ссылка = Матч.Регистратор
		               |									И СоставКоманды.Команда = Матч.Команда
		               |					ГДЕ
		               |						Матч.Период МЕЖДУ &ДатаН И &ДатаК
		               |						И СоставКоманды.Команда = &Команда
		               |					УПОРЯДОЧИТЬ ПО
		               |						ВЫБОР
		               |							КОГДА Матч.Тур.Владелец = &Чемпионат
		               |								ТОГДА 0
		               |							ИНАЧЕ 11
		               |						КОНЕЦ + РАЗНОСТЬДАТ(Матч.Период, &ДатаК, ДЕНЬ)))
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕСТЬNULL(Перемещения.Игрок.Амплуа.Код, Игроки.Амплуа.Код),
		               |	Точка
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Ризалт = Запрос.Выполнить();
	Если НЕ Ризалт.Пустой() Тогда
		Серия1	= УстановитьСерию(График2, 1);
		Серия2	= УстановитьСерию(График2, 2);
		Серия3	= УстановитьСерию(График2, 3);
		Если График2Группировать Тогда
			Выборка = Ризалт.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока Выборка.Следующий() Цикл
				Точка	= График2.УстановитьТочку(Выборка.Точка);
				
				Расшифровка	= Новый СписокЗначений;
				ВыборкаИгроки	= Выборка.Выбрать();
				Пока ВыборкаИгроки.Следующий() Цикл
					Расшифровка.Добавить(ВыборкаИгроки.Игрок);
				КонецЦикла;
				Точка.Расшифровка = Расшифровка;
				График2.УстановитьЗначение(Точка, Серия1, Выборка.Фаза1);
				График2.УстановитьЗначение(Точка, Серия2, Выборка.Фаза2);
				График2.УстановитьЗначение(Точка, Серия3, Выборка.Фаза3);
			КонецЦикла;
		Иначе
			Выборка = Ризалт.Выбрать();
			Пока Выборка.Следующий() Цикл
				Точка	= График2.УстановитьТочку(Выборка.Точка);
				Точка.Расшифровка = Выборка.Точка;
				График2.УстановитьЗначение(Точка, Серия1, Выборка.Фаза1);
				График2.УстановитьЗначение(Точка, Серия2, Выборка.Фаза2);
				График2.УстановитьЗначение(Точка, Серия3, Выборка.Фаза3);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура График2Обновить(Команда=Неопределено)
	График2.Очистить();
	Если ЗначениеЗаполнено(График2Команда) Тогда
		График2ОбновитьНаСервере();
	ИначеЕсли Команда <> Неопределено Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Выберите команду",,, "График2Команда");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КомандыТураПолучить()
	Если ЗначениеЗаполнено(Объект.Тур) Тогда
		//Если Объект.Тур.ОлимпийскаяСистема И ЗначениеЗаполнено(Чемпионат()) Тогда
		//	мКоманды = СерверныйФункции.КомандыЧемпионата(Чемпионат());
		//Иначе
			мКоманды = СерверныйФункции.КомандыТура(Объект.Тур);
			Если мКоманды.Количество() = 0 Тогда
				мКоманды = Объект.Команды.Выгрузить(, "Команда").ВыгрузитьКолонку(0);
			КонецЕсли;
		//КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(Чемпионат()) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	Команды.Команда КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Чемпионаты.Команды КАК Команды
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица.Обороты(&ДатаН, &ДатаК, , Тур.Владелец = &Чемпионат) КАК ТурнирнаяТаблица
		                      |		ПО Команды.Команда = ТурнирнаяТаблица.Команда
		                      |ГДЕ
		                      |	Команды.Ссылка = &Чемпионат
		                      |	И ТурнирнаяТаблица.Команда ЕСТЬ NULL
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Ссылка
		                      |АВТОУПОРЯДОЧИВАНИЕ");
		Запрос.УстановитьПараметр("ДатаК", 			НачалоДня(Объект.Дата - Сутки()));
		Запрос.УстановитьПараметр("ДатаН", 			КонецДня(Объект.Дата + Сутки()));
		Запрос.УстановитьПараметр("Чемпионат",		Чемпионат());
		мКоманды	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Команды.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Команды КАК Команды
		                      |ГДЕ
		                      |	Команды.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Ссылка
		                      |АВТОУПОРЯДОЧИВАНИЕ");
		мКоманды	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;
	Возврат мКоманды;
КонецФункции

&НаСервере
Функция КоличествоМатчейВАнонсе()
	Возврат СерверныйФункции.КоличествоМатчейВАнонсе();
КонецФункции

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка);
КонецФункции

&НаСервере
Функция СтатистикаИгр(Тим)
	Возврат СерверныйФункции.СтатистикаИгр(Тим, Чемпионат());
КонецФункции

&НаСервере
Функция МатчиПоследние5(Тим, Сколько)
	Возврат СерверныйФункции.МатчиПоследние5(Тим, Чемпионат(), Объект.Дата, Сколько);
КонецФункции

&НаСервере
Функция ДанныеИгрока(Игрок)
	Ответ	= Новый Структура("Команда,Амплуа,Фаза1,Фаза2,Фаза3");
	Если ЗначениеЗаполнено(Игрок) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Перемещения.Команда КАК Команда,
		                      |	ЕСТЬNULL(Перемещения.Амплуа.Ссылка, Игроки.Амплуа) КАК Амплуа,
		                      |	ВЫБОР
		                      |		КОГДА Игроки.Фаза1 <= 23 / 4
		                      |			ТОГДА Игроки.Фаза1 * 25 / 23
		                      |		КОГДА Игроки.Фаза1 <= 23 / 2
		                      |			ТОГДА (23 / 4 - (Игроки.Фаза1 - 23 / 4)) * 25 / 23
		                      |		КОГДА Игроки.Фаза1 <= 23 / 4 * 3
		                      |			ТОГДА -(Игроки.Фаза1 - 23 / 2) * 25 / 23
		                      |		ИНАЧЕ -(23 / 4 - (Игроки.Фаза1 - 23 / 4 * 3)) * 25 / 23
		                      |	КОНЕЦ КАК Фаза1,
		                      |	ВЫБОР
		                      |		КОГДА Игроки.Фаза2 <= 28 / 4
		                      |			ТОГДА Игроки.Фаза2 * 25 / 28
		                      |		КОГДА Игроки.Фаза2 <= 28 / 2
		                      |			ТОГДА (28 / 4 - (Игроки.Фаза2 - 28 / 4)) * 25 / 28
		                      |		КОГДА Игроки.Фаза2 <= 28 / 4 * 3
		                      |			ТОГДА -(Игроки.Фаза2 - 28 / 2) * 25 / 28
		                      |		ИНАЧЕ -(28 / 4 - (Игроки.Фаза2 - 28 / 4 * 3)) * 25 / 28
		                      |	КОНЕЦ КАК Фаза2,
		                      |	ВЫБОР
		                      |		КОГДА Игроки.Фаза3 <= 33 / 4
		                      |			ТОГДА Игроки.Фаза3 * 25 / 33
		                      |		КОГДА Игроки.Фаза3 <= 33 / 2
		                      |			ТОГДА (33 / 4 - (Игроки.Фаза3 - 33 / 4)) * 25 / 33
		                      |		КОГДА Игроки.Фаза3 <= 33 / 4 * 3
		                      |			ТОГДА -(Игроки.Фаза3 - 33 / 2) * 25 / 33
		                      |		ИНАЧЕ -(33 / 4 - (Игроки.Фаза3 - 33 / 4 * 3)) * 25 / 33
		                      |	КОНЕЦ КАК Фаза3
		                      |ИЗ
		                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, Игрок = &Игрок) КАК Перемещения
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		                      |			Игроки.Ссылка КАК Ссылка,
		                      |			Игроки.Амплуа КАК Амплуа,
		                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 23 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 23) КАК Фаза1,
		                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 28 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 28) КАК Фаза2,
		                      |			РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) - 33 * ЦЕЛ(РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ДЕНЬ) / 33) КАК Фаза3
		                      |		ИЗ
		                      |			Справочник.Игроки КАК Игроки) КАК Игроки
		                      |		ПО Перемещения.Игрок = Игроки.Ссылка");
		Запрос.УстановитьПараметр("Игрок",			Игрок);
		Запрос.УстановитьПараметр("Дата",			Объект.Дата);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Ответ, Выборка);
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СтарыйВидАнонсов()
	Возврат СерверныйФункции.СтарыйВидАнонсов();
КонецФункции

&НаСервере
Функция ЭтоДерби()
	Ответ	= СерверныйФункции.ЭтоДерби(Объект.Ссылка);
	Город	= ?(Ответ, ГородНайти(), Неопределено);
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ТурПолучить()
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Ответ = СерверныйФункции.Тур(КомандыПолучить(), Объект.Дата);
		Если НЕ ЗначениеЗаполнено(Ответ) Тогда
			Ответ = СерверныйФункции.Тур(Чемпионат(), Объект.Дата);
		КонецЕсли;
	Иначе
		Ответ = Справочники.Туры.ПустаяСсылка();
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ИзображениеДефолтПолучить()
	Возврат СерверныйФункции.ИзображениеДефолтПолучить();
КонецФункции

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога();
КонецФункции

&НаКлиенте
Процедура ВыбратьИзображение(Команда)
	Если СтрСравнить(Команда.Имя, "ВыбратьИзображение") = 0 Тогда
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект),,,, ПараметрыДиалога());
	ИначеЕсли СтрСравнить(Команда.Имя, "УдалитьИзображение") = 0 Тогда
		Изображение = ИзображениеДефолтПолучить();
		Модифицированность	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборФайла(Результат, ДополнительныеПараметры=Неопределено) Экспорт
	Если ТипЗнч(Результат) = Тип("ОписаниеПомещенногоФайла") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(Результат.СсылкаНаФайл.Расширение)
		И Результат.СсылкаНаФайл.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный()
		Тогда
			Изображение = Результат.Адрес;
			Модифицированность	= Истина;
		Иначе
			ОбщегоНазначения.СообщитьОбОшибке("Данный тип файла не поддерживается");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Результат) = Тип("Строка") И НЕ ПустаяСтрока(Результат) Тогда
		Данные				= Новый ДвоичныеДанные(Результат);
		Если Данные.Размер() >= ОбщегоНазначения.РазмерКартинкиМинимальный() Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Данные, УникальныйИдентификатор);
			Модифицированность	= Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	Если ЭтоУРЛ(ПараметрыПеретаскивания.Значение) Тогда
		НачатьКопированиеФайла(Новый ОписаниеОповещения("ОбработатьВыборФайла", ЭтотОбъект), ПараметрыПеретаскивания.Значение, СерверныйФункции.КаталогаФайлов() + ИмяФайла(ПараметрыПеретаскивания.Значение));
	ИначеЕсли ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("СсылкаНаФайл") Тогда
		Если ОбщегоНазначения.РасширениеФайлаВерно(ПараметрыПеретаскивания.Значение.Расширение) Тогда
			Изображение			= ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ПараметрыПеретаскивания.Значение.Файл.ПолноеИмя), УникальныйИдентификатор);
			Модифицированность	= Истина;
			СтандартнаяОбработка= Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Модифицированность Тогда
		СерверныйФункции.ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Изображение, Отказ);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатПриИзмененииНаСервере()
	Туры.ЗагрузитьЗначения(ТурыПолучить(Объект.Дата, Чемпионат));
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	ЧемпионатПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧемпионатыПолучить(Дата, Данные)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Чемпионаты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Чемпионаты КАК Чемпионаты
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО Чемпионаты.Ссылка = ЧемпионатыКоманды.Ссылка
	                      |ГДЕ
	                      |	&Дата МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания
	                      |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка");
	Запрос.УстановитьПараметр("Дата",			Дата);
	Запрос.УстановитьПараметр("Данные",			Данные);
	Если ТипЗнч(Данные) = Тип("Массив")
	Или ТипЗнч(Данные) = Тип("СправочникСсылка.Команды")
	Тогда
		Запрос.Текст	= "ВЫБРАТЬ
		            	  |	Чемпионаты.Ссылка КАК Ссылка
		            	  |ИЗ
		            	  |	Справочник.Чемпионаты КАК Чемпионаты
		            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		            	  |		ПО Чемпионаты.Ссылка = ЧемпионатыКоманды.Ссылка
		            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		            	  |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Город.Владелец) КАК Количество,
		            	  |			МАКСИМУМ(Команды.Город.Владелец) КАК Страна
		            	  |		ИЗ
		            	  |			Справочник.Команды КАК Команды
		            	  |		ГДЕ
		            	  |			Команды.Ссылка В(&Данные)) КАК Страны
		            	  |		ПО (ИСТИНА)
		            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		            	  |			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Ссылка) КАК Количество
		            	  |		ИЗ
		            	  |			Справочник.Команды КАК Команды
		            	  |		ГДЕ
		            	  |			Команды.Ссылка В(&Данные)) КАК Клубы
		            	  |		ПО (ИСТИНА)
		            	  |ГДЕ
		            	  |	&Дата МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания
		            	  |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
		            	  |	И ЧемпионатыКоманды.Команда В(&Данные)
		            	  |	И ВЫБОР
		            	  |			КОГДА Чемпионаты.Владелец.Страна.Ссылка ЕСТЬ NULL
		            	  |				ТОГДА Страны.Количество = Клубы.Количество
		            	  |			ИНАЧЕ Страны.Количество = 1
		            	  |		КОНЕЦ
		            	  |
		            	  |УПОРЯДОЧИТЬ ПО
		            	  |	Ссылка";
		Запрос.УстановитьПараметр("Данные",			Данные);
	ИначеЕсли ТипЗнч(Данные) = Тип("СправочникСсылка.ВидыСпорта") Тогда
		Запрос.Текст	= "ВЫБРАТЬ РАЗЛИЧНЫЕ
		            	  |	Чемпионаты.Ссылка КАК Ссылка
		            	  |ИЗ
		            	  |	Справочник.Чемпионаты КАК Чемпионаты
		            	  |ГДЕ
		            	  |	&Дата МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания
		            	  |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
		            	  |	И Чемпионаты.Владелец.Владелец = &Данные
		            	  |
		            	  |УПОРЯДОЧИТЬ ПО
		            	  |	Ссылка";
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ЧемпионатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Значения	= ЧемпионатыПолучить(Объект.Дата, ?(Объект.Команды.Количество() = 0, ВидСпорта, Хозяева));
	Чемпионаты.ЗагрузитьЗначения(Значения);
КонецПроцедуры

&НаСервере
Процедура СоставыСортироватьНаСервере()
	Если Объект.Команды.Количество() = 0 Тогда Возврат;
	ИначеЕсли Объект.СоставыКоманд.Количество() = 0 Тогда Возврат;
	КонецЕсли;
	
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	СоставКоманды.Игрок КАК Игрок,
	      	               |	СоставКоманды.Команда КАК Команда,
	      	               |	СоставКоманды.Фаза1 КАК Фаза1,
	      	               |	СоставКоманды.Фаза2 КАК Фаза2,
	      	               |	СоставКоманды.Фаза3 КАК Фаза3,
	      	               |	СоставКоманды.Амплуа КАК Амплуа
	      	               |ПОМЕСТИТЬ СоставКоманды
	      	               |ИЗ
	      	               |	&ТЧ КАК СоставКоманды
	      	               |ГДЕ
	      	               |	СоставКоманды.Команда В(&Команды)
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	СоставКоманды.Игрок КАК Игрок,
	      	               |	СоставКоманды.Команда КАК Команда,
	      	               |	СоставКоманды.Фаза1 КАК Фаза1,
	      	               |	СоставКоманды.Фаза2 КАК Фаза2,
	      	               |	СоставКоманды.Фаза3 КАК Фаза3,
	      	               |	СоставКоманды.Амплуа КАК Амплуа
	      	               |ИЗ
	      	               |	СоставКоманды КАК СоставКоманды
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Амплуа КАК СпрАмплуа
	      	               |		ПО СоставКоманды.Амплуа = СпрАмплуа.Ссылка
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	СоставКоманды.Команда = &Хозяева УБЫВ,
	      	               |	СпрАмплуа.Код,
	      	               |	Игрок
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ТЧ",				Объект.СоставыКоманд.Выгрузить());
	Запрос.УстановитьПараметр("Команды",		КомандыПолучить());
	Запрос.УстановитьПараметр("Хозяева",		Хозяева());
	Объект.СоставыКоманд.Очистить();
	СоставыКомандДобавить(Запрос.Выполнить().Выбрать());
КонецПроцедуры

&НаКлиенте
Процедура СоставыСортировать(Команда)
	СоставыСортироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СоставыОчистить(Команда)
	Объект.СоставыКоманд.Очистить();
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Объект.КоличествоЗрителей > 0 Тогда
		ПроверяемыеРеквизиты.Добавить("Стадион");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ГородНайти()
	Возврат СерверныйФункции.ГородНайти(Объект.Команды.Выгрузить().ВыгрузитьКолонку("Команда"));
КонецФункции

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	ТекущиеДанные	= Элементы.СоставыКоманд.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ТекущийИгрок	= Неопределено;
		ИЗО				= "";
	ИначеЕсли ТекущийИгрок = ТекущиеДанные.Игрок Тогда
		Если Кеш.НайтиПоЗначению(ТекущийИгрок) = Неопределено Тогда
			ФотоПолучитьНаСервере();
		КонецЕсли;
	Иначе
		ТекущийИгрок = ТекущиеДанные.Игрок;
		ФотоПолучитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФотоПолучитьНаСервере()
	Элемент	= Кеш.НайтиПоЗначению(ТекущийИгрок);
	Если Элемент = Неопределено Тогда
		ИЗО	= СерверныйФункции.ИзображениеПолучить(ТекущийИгрок);
		Кеш.Добавить(ТекущийИгрок, ИЗО);
	Иначе
		ИЗО	= Элемент.Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставыКомандПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура СоставЗаполнитьНаСервере(Тим)
	Виктимз	= Объект.СоставыКоманд.НайтиСтроки(Новый Структура("Команда", Тим));
	Пока Виктимз.Количество() > 0 Цикл
		Объект.СоставыКоманд.Удалить(Виктимз.Получить(0));
		Виктимз	= Объект.СоставыКоманд.НайтиСтроки(Новый Структура("Команда", Тим));
	КонецЦикла;
	
	Если СоставыКомандДобавить(СоставКоманды(Тим)) Тогда
		СоставыСортироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставЗаполнить(Команда)
	Если Элементы.Команды.ТекущиеДанные <> Неопределено Тогда
		СоставЗаполнитьНаСервере(Элементы.Команды.ТекущиеДанные.Команда);
		КешОчистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КешОчистить(Игрок=Неопределено)
	Если ЗначениеЗаполнено(Игрок) Тогда
		Элемент = Кеш.НайтиПоЗначению(Игрок);
		Если Элемент <> Неопределено Тогда
			Кеш.Удалить(Элемент);
		КонецЕсли;
	Иначе
		Кеш.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭтоДербиНажатие(Элемент)
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Дерби.Форма", Новый Структура("Город", Город), Новый Структура("Источник", ЭтаФорма));
КонецПроцедуры

&НаКлиенте
Процедура ИЗОНажатие(Элемент, СтандартнаяОбработка)
	Показать(ТекущийИгрок, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Показать(ТекущиеДанные, СтандартнаяОбработка=Ложь)
	НаКлиенте.Показать(ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеХозяеваНажатие(Элемент, СтандартнаяОбработка)
	Показать(Хозяева, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ИзображениеГостиНажатие(Элемент, СтандартнаяОбработка)
	Показать(Гости, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	СоставыЗагрузитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СтадионНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если Стадионы.Количество() = 1
	И НЕ ЗначениеЗаполнено(Объект.Стадион)
	Тогда
		СтандартнаяОбработка	= Ложь;
		Объект.Стадион			= Стадионы.Получить(0).Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВопросИмпортДо(КодОтвета, ПараметрКоманды) Экспорт
	Если КодОтвета = КодВозвратаДиалога.ОК Тогда
		СоставыИмпорт();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоставыИмпорт(Команда=Неопределено)
	Если Объект.Команды.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Сначала заполните таблицу 'Команды' ",, Объект.Ссылка, "Объект.Команды");
		
	ИначеЕсли Команда = Неопределено Тогда
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), , "Импорт составов");
	ИначеЕсли Объект.СоставыКоманд.Количество() = 0 Тогда
		СоставыИмпорт();
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросИмпортДо", ЭтотОбъект), "Заменить текущий список?", РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.Отмена, "СоставыКоманд");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Слова, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(Слова) Тогда
		Если СоставыИмпортНаСервере(Слова) Тогда
			//Элементы.СоставыКоманд.Обновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СоставыИмпортНаСервере(Знач УРЛ)
	Если СтрНайти(УРЛ, "¶") > 0 Тогда
		УРЛ = СтрЗаменить(СтрЗаменить(УРЛ, "¶", ","), "	", ",");
	ИначеЕсли СтрНайти(УРЛ, Символы.ПС) > 0 Тогда
		УРЛ = СтрЗаменить(УРЛ, Символы.ПС, ",");
	КонецЕсли;
	Слова = Разделить(СтрЗаменить(УРЛ, ":", ","), ",");
	Если Слова.Количество() > 0 Тогда
		Объект.СоставыКоманд.Очистить();
		Исключения = Разделить("вр,зщ,пз,нп", ",");
		Для Каждого Слово Из Слова Цикл
			Если СтрокаНачинаетсяЧислом(Слово) Тогда
				//
			ИначеЕсли Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
				//
			ИначеЕсли СтрНайти(Слово, "(") > 0 Тогда
				Для Каждого Словечко Из Разделить(Слово, "(") Цикл
					Слова.Добавить(Словечко);
				КонецЦикла;
			Иначе
				ИгрокИмя = Слово;
				Если СтрокаЗаканчиваетсяЧислом(Слово) Тогда
					ИгрокИмя= "";
					мСлова	= Разделить(Слово);
					Для Итератор = 0 По мСлова.ВГраница() - 1 Цикл
						ИгрокИмя = ИгрокИмя + " " + мСлова.Получить(Итератор);
					КонецЦикла;
				КонецЕсли;
				сИгрок = СерверныйФункции.ИгрокНайти(ИгрокИмя, Объект.Ссылка);
				Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
					ЗаполнитьЗначенияСвойств(Объект.СоставыКоманд.Добавить(), сИгрок);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат (Объект.СоставыКоманд.Количество() > 0);
КонецФункции
