
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомпоновщикНастроекПользовательскиеНастройки);
		
		Если Параметры.Лига.Страна.Пустая() Тогда
			Отказ = Истина;
		Иначе
			Отчет.Лига = Параметры.Лига;
			Если Параметры.Свойство("Команда") Тогда
				Отчет.Команда = Параметры.Команда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПараметрыУстановить() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПараметрыУстановить()
	Настройки = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		Для Каждого Элемент Из Настройки Цикл
			Если СтрСравнить(Элемент.Параметр, "Лига") = 0 Тогда
				Элемент.Значение = Отчет.Лига;
			ИначеЕсли СтрСравнить(Элемент.Параметр, "Команда") = 0
			И ЗначениеЗаполнено(Отчет.Команда)
			Тогда
				Элемент.Значение = Отчет.Команда;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	Иначе
		Для Каждого Элемент Из Настройки Цикл
			Если СтрСравнить(Элемент.Параметр, "Лига") = 0 Тогда
				Отчет.Лига = Элемент.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		Попытка
			СкомпоноватьРезультат();
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Значение	= РезультатРасшифровки(Расшифровка);
	НаКлиенте.Показать(Значение, СтандартнаяОбработка);
КонецПроцедуры
