
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомпоновщикНастроекПользовательскиеНастройки);
		
		Лига = Параметры.Лига;
		Если Параметры.Свойство("Команда") Тогда
			Команда = Параметры.Команда;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЛигаУстановить() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЛигаУстановить()
	Если ЗначениеЗаполнено(Лига) Тогда
		Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Лига", Лига);
		Если ЗначениеЗаполнено(Команда) Тогда
			Отбор = Настройки.Отбор.Элементы.Получить(1);
			Отбор.ПравоеЗначение	= Команда;
			Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
			Отбор.Использование		= Истина;
		КонецЕсли;
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Попытка
		СкомпоноватьРезультат();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Значение	= РезультатРасшифровки(Расшифровка);
	СтандартнаяОбработка	= ЗначениеЗаполнено(Значение);
КонецПроцедуры
