
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
		
		Отчет.Лига = Параметры.Лига;

	ИначеЕсли Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		
		Отчет.Команда = Параметры.Команда;
		
	Иначе
		Элементы.Лига.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДоступностьУстановить();
	Если ВладелецФормы = Неопределено Тогда
		АвтоЗаголовок		= Истина;
		ОтображатьЗаголовок	= Истина;
	КонецЕсли;
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		СкомпоноватьРезультат();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИгрокиПолучить(Страна)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Чемпионаты.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Чемпионаты
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	Чемпионаты.Владелец = &Лига
	                      |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
	                      |	И Чемпионаты.ДатаОкончания В
	                      |			(ВЫБРАТЬ
	                      |				МАКСИМУМ(Чемпионаты.ДатаОкончания)
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |			ГДЕ
	                      |				Чемпионаты.Владелец = &Лига
	                      |				И Чемпионаты.ПометкаУдаления = ЛОЖЬ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Перемещения.Игрок КАК Значение,
	                      |	Перемещения.Игрок.Наименование КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
	                      |			И Перемещения.Команда = МатчСоставыКоманд.Команда
	                      |ГДЕ
	                      |	Перемещения.Игрок.Страна = &Страна
	                      |	И Перемещения.Команда В
	                      |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |				ЧемпионатыКоманды.Команда
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Перемещения.Игрок,
	                      |	Перемещения.Игрок.Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка), 0) УБЫВ,
	                      |	Представление");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Игрок КАК Значение,
		               |	Перемещения.Игрок.Наименование КАК Представление
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
		               |			И Перемещения.Команда = МатчСоставыКоманд.Команда
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |	И Перемещения.Игрок.Страна = &Страна
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Перемещения.Игрок,
		               |	Перемещения.Игрок.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) УБЫВ,
		               |	Представление";
		Запрос.УстановитьПараметр("Команда",	Отчет.Команда);
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",	Отчет.Лига);
	Запрос.УстановитьПараметр("Страна",	Страна);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Значение = СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Страны") Тогда
		Возврат ИгрокиПолучить(Значение);
	КонецЕсли;
	Возврат Значение;
КонецФункции

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	Значение	= РезультатРасшифровки(Расшифровка);
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Значение.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите игрока");
	Иначе
		Показать(Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДоступностьУстановить()
	Элементы.ФормаЗагрузитьВариант.Доступность	= (НЕ ЗначениеЗаполнено(Отчет.Команда));
	Элементы.Топ.Доступность					= (НЕ ЗначениеЗаполнено(Отчет.Команда) И НЕ Отчет.Лига.ОлимпийскаяСистема);
КонецПроцедуры

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	ЭлементПриИзменении(Элемент);
	ДоступностьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	ОбщегоНазначения.СостояниеОтобразить(Элементы.Результат.ОтображениеСостояния);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.Лига.АвтоОтметкаНезаполненного
	И НЕ ЗначениеЗаполнено(Отчет.Лига)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите лигу", Отказ,, "Отчет.Лига");
	КонецЕсли;
КонецПроцедуры
