
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомпоновщикНастроекПользовательскиеНастройки);
		
		Если Параметры.Лига.Страна.Пустая() Тогда
			Отказ = Истина;
		Иначе
			Лига = Параметры.Лига;
			Если Параметры.Свойство("Команда") Тогда
				Отчет.Команда = Параметры.Команда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПараметрыУстановить() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПараметрыУстановить()
	Если ЗначениеЗаполнено(Лига) Тогда
		Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки();
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Лига", Лига);
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			Для Каждого Элемент Из Настройки.Отбор.Элементы Цикл
				Если СтрСравнить(Элемент.ЛевоеЗначение, "Команда") = 0 Тогда
					Элемент.ПравоеЗначение	= Отчет.Команда;
					Элемент.ВидСравнения		= ВидСравненияКомпоновкиДанных.Равно;
					Элемент.Использование		= Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Настройки);
		
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Попытка
		СкомпоноватьРезультат();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Возврат СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
КонецФункции

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Значение	= РезультатРасшифровки(Расшифровка);
	НаКлиенте.Показать(Значение, СтандартнаяОбработка);
КонецПроцедуры
