
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомпоновщикНастроекПользовательскиеНастройки);
		
		Если Параметры.Лига.Страна.Пустая() Тогда
			Отказ = Истина;
		Иначе
			Отчет.Лига = Параметры.Лига;
			Если Параметры.Свойство("Команда") Тогда
				Отчет.Команда = Параметры.Команда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВладелецФормы = Неопределено Тогда
		АвтоЗаголовок		= Истина;
		ОтображатьЗаголовок	= Истина;
	КонецЕсли;
	Если ПараметрыУстановить() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПараметрПолучить(ПараметрИмя="Лига")
	Ответ	= Неопределено;
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных;
	Для Каждого Элемент Из Настройки.Элементы Цикл
		Если СтрСравнить(Элемент.Параметр, ПараметрИмя) = 0 Тогда
			Ответ = Элемент.Значение;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ПараметрыУстановить()
	Настройки = Отчет.КомпоновщикНастроек.ПолучитьНастройки().ПараметрыДанных;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		Для Каждого Элемент Из Настройки.Элементы Цикл
			Если СтрСравнить(Элемент.Параметр, "Лига") = 0 Тогда
				Элемент.Значение = Отчет.Лига;
			ИначеЕсли СтрСравнить(Элемент.Параметр, "Команда") = 0
			И ЗначениеЗаполнено(Отчет.Команда)
			Тогда
				Элемент.Значение = Отчет.Команда;
			ИначеЕсли СтрСравнить(Элемент.Параметр, "Топ") = 0 Тогда
				Если Отчет.Лига.ОлимпийскаяСистема Тогда
					Элемент.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
					Элемент.Значение = Ложь;
				Иначе
					Элемент.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Авто;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		Возврат Истина;
	Иначе
		Для Каждого Элемент Из Настройки.Элементы Цикл
			Если СтрСравнить(Элемент.Параметр, "Лига") = 0 Тогда
				Отчет.Лига = Элемент.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	ПараметрыУстановить();
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		Попытка
			СкомпоноватьРезультат();
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИгрокиПолучить(Страна)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Чемпионаты.Ссылка КАК Ссылка
	                      |ПОМЕСТИТЬ Чемпионаты
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	Чемпионаты.Владелец = &Лига
	                      |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
	                      |	И Чемпионаты.ДатаОкончания В
	                      |			(ВЫБРАТЬ
	                      |				МАКСИМУМ(Чемпионаты.ДатаОкончания)
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |			ГДЕ
	                      |				Чемпионаты.Владелец = &Лига
	                      |				И Чемпионаты.ПометкаУдаления = ЛОЖЬ)
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	Перемещения.Игрок КАК Значение,
	                      |	Перемещения.Игрок.Наименование КАК Представление
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
	                      |			И Перемещения.Команда = МатчСоставыКоманд.Команда
	                      |ГДЕ
	                      |	Перемещения.Игрок.Страна = &Страна
	                      |	И Перемещения.Команда В
	                      |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |				ЧемпионатыКоманды.Команда
	                      |			ИЗ
	                      |				Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	                      |					ПО
	                      |						ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Перемещения.Игрок,
	                      |	Перемещения.Игрок.Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка), 0) УБЫВ,
	                      |	Представление");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Перемещения.Игрок КАК Значение,
		               |	Перемещения.Игрок.Наименование КАК Представление
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних КАК Перемещения
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ПО Перемещения.Игрок = МатчСоставыКоманд.Игрок
		               |			И Перемещения.Команда = МатчСоставыКоманд.Команда
		               |ГДЕ
		               |	Перемещения.Команда = &Команда
		               |	И Перемещения.Игрок.Страна = &Страна
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Перемещения.Игрок,
		               |	Перемещения.Игрок.Наименование
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) УБЫВ,
		               |	Представление";
		Запрос.УстановитьПараметр("Лига",	Отчет.Команда);
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",	ПараметрПолучить());
	Запрос.УстановитьПараметр("Страна",	Страна);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция РезультатРасшифровки(Расшифровка)
	Значение = СерверныйФункции.ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка);
	Если ТипЗнч(Значение) = Тип("СправочникСсылка.Страны") Тогда
		Возврат ИгрокиПолучить(Значение);
	КонецЕсли;
	Возврат Значение;
КонецФункции

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		СтандартнаяОбработка = Ложь;
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	Значение	= РезультатРасшифровки(Расшифровка);
	Если ТипЗнч(Значение) = Тип("СписокЗначений") Тогда
		Значение.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите игрока");
	Иначе
		Показать(Значение);
	КонецЕсли;
КонецПроцедуры
