
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Чемпионы.Форма", Новый Структура("Лига", ЛигаОпределить(ПараметрКоманды)), ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция ЛигаОпределить(ПараметрКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Страны") Тогда
		Возврат СерверныйФункции.ЛигаСтраны(ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Возврат ПараметрКоманды.Владелец;
	КонецЕсли;
	Возврат ПараметрКоманды;
КонецФункции
