
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СхемаКомпоновкиДанных	= ПолучитьМакет(Вариант);
	Для Каждого Элемент Из СхемаКомпоновкиДанных.НастройкиПоУмолчанию.ПараметрыДанных.Элементы Цикл
		Если СтрСравнить(Элемент.Параметр, "Уровень") = 0 Тогда
			Элемент.Значение = Уровень;
		ИначеЕсли СтрСравнить(Элемент.Параметр, "КоличествоВопросов") = 0 Тогда
			Элемент.Значение = КоличествоВопросов;
		КонецЕсли;
	КонецЦикла;
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
КонецПроцедуры
