
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СхемаКомпоновкиДанных	= ПолучитьМакет(Вариант);
	КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновкиДанных.НастройкиПоУмолчанию);
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();
	Для Каждого Элемент Из Настройки.ПараметрыДанных.Элементы Цикл
		Если СтрСравнить(Элемент.Параметр, "Уровень") = 0 Тогда
			Элемент.Значение = Уровень;
		ИначеЕсли СтрСравнить(Элемент.Параметр, "КоличествоВопросов") = 0 Тогда
			Элемент.Значение = КоличествоВопросов;
		ИначеЕсли СтрСравнить(Элемент.Параметр, "Сессия") = 0 Тогда
			Элемент.Значение = НаСервереПовторно.Сессия();
		ИначеЕсли СтрСравнить(Элемент.Параметр, "Дата") = 0 Тогда
			Элемент.Значение = СерверныйФункции.Сегодня();
		КонецЕсли;
		Элемент.Использование = Истина;
	КонецЦикла;
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , ДанныеРасшифровки, Истина);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
КонецПроцедуры
