
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("УРЛ") Тогда
			Если СтрНайти(Комментарий, ДанныеЗаполнения.УРЛ) = 0 Тогда
				Комментарий = ?(ПустаяСтрока(Комментарий), ДанныеЗаполнения.УРЛ, Комментарий + Разрыв() + ДанныеЗаполнения.УРЛ);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустаяСтрока(СерверныйФункции.КомментарийКакУРЛ(Комментарий)) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
