
Функция КоличествоОчков(Параметр) Экспорт
	Ответ	= Новый Структура("Ничья,Победа", 1, 3);
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВидыСпорта.Ничья КАК Ничья,
	      	               |	ВидыСпорта.Победа КАК Победа
	      	               |ИЗ
	      	               |	Справочник.ВидыСпорта КАК ВидыСпорта
	      	               |ГДЕ
	      	               |	ВидыСпорта.Ссылка = &Параметр");
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыСпорта.Ничья КАК Ничья,
		               |	ВидыСпорта.Победа КАК Победа
		               |ИЗ
		               |	Справочник.Чемпионаты КАК Чемпионаты
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		               |		ПО Чемпионаты.Владелец.Владелец = ВидыСпорта.Ссылка
		               |ГДЕ
		               |	Чемпионаты.Ссылка = &Параметр";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Команды") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыСпорта.Ничья КАК Ничья,
		               |	ВидыСпорта.Победа КАК Победа
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		               |		ПО Команды.Владелец = ВидыСпорта.Ссылка
		               |ГДЕ
		               |	Команды.Ссылка = &Параметр";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Лига") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыСпорта.Ничья КАК Ничья,
		               |	ВидыСпорта.Победа КАК Победа
		               |ИЗ
		               |	Справочник.Лига КАК Лига
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		               |		ПО Лига.Владелец = ВидыСпорта.Ссылка
		               |ГДЕ
		               |	Лига.Ссылка = &Параметр";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВидыСпорта.Ничья КАК Ничья,
		               |	ВидыСпорта.Победа КАК Победа
		               |ИЗ
		               |	Справочник.Игроки КАК Игроки
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		               |		ПО Игроки.Амплуа.Владелец = ВидыСпорта.Ссылка
		               |ГДЕ
		               |	Игроки.Ссылка = &Параметр
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВидыСпорта.Ничья,
		               |	ВидыСпорта.Победа
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыСпорта КАК ВидыСпорта
		               |		ПО ПеремещенияИгроков.Команда.Владелец = ВидыСпорта.Ссылка
		               |ГДЕ
		               |	ПеремещенияИгроков.Игрок = &Параметр";
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",			Параметр);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Ничья(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Ничья;
КонецФункции

Функция Победа(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Победа;
КонецФункции
