
Функция КоличествоОчков(ВидыСпорта)
	Ответ	= Новый Структура("Ничья,Победа", 1, 3);
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВидыСпорта.Ничья КАК Ничья,
	      	               |	ВидыСпорта.Победа КАК Победа
	      	               |ИЗ
	      	               |	Справочник.ВидыСпорта КАК ВидыСпорта
	      	               |ГДЕ
	      	               |	ВидыСпорта.Ссылка = &ВидыСпорта");
	Запрос.УстановитьПараметр("ВидыСпорта",			ВидыСпорта);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Ничья(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Ничья;
КонецФункции

Функция Победа(ВидыСпорта) Экспорт
	Возврат КоличествоОчков(ВидыСпорта).Победа;
КонецФункции
