
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек	= Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОтменитьПроведениеНаСервере(Ссылка)
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Матч") Тогда
		Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Ответ = Истина;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.СнятиеОчков") Тогда
		Ссылка.ПолучитьОбъект().Записать(РежимЗаписиДокумента.ОтменаПроведения);
		Ответ = Истина;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Для Каждого Документ Из Ссылка Цикл
			Ответ = Макс(Ответ, ОтменитьПроведениеНаСервере(Документ));
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ОтменитьПроведение(Команда)
	Если Элементы.Список.ВыделенныеСтроки.Количество() > 1 Тогда
		Результат = Новый Массив;
		Для Каждого Проверка Из Элементы.Список.ВыделенныеСтроки Цикл
			ДанныеПроверки = Элементы.Список.ДанныеСтроки(Проверка);
			Если ДанныеПроверки = Неопределено Тогда
				//
			ИначеЕсли Результат.Найти(ДанныеПроверки.Регистратор) = Неопределено Тогда
				Результат.Добавить(ДанныеПроверки.Регистратор);
			КонецЕсли;
		КонецЦикла;
		Если ОтменитьПроведениеНаСервере(Результат) Тогда
			Элементы.Список.Обновить();
		КонецЕсли;
	ИначеЕсли Элементы.Список.ТекущиеДанные = Неопределено Тогда
		//
	ИначеЕсли ОтменитьПроведениеНаСервере(Элементы.Список.ТекущиеДанные.Регистратор) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
