
&НаСервере
Функция ДанныеПолучить()
	Отчет.Данные.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.Команда КАК Команда,
	                      |	ТурнирнаяТаблица.КоличествоОчков >= Противники.КоличествоОчков КАК Победа,
	                      |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
	                      |ПОМЕСТИТЬ Последнее
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда,
	                      |	ТурнирнаяТаблица.КоличествоОчков >= Противники.КоличествоОчков
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.Команда КАК Команда,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
	                      |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
	                      |			ПО Последнее.Команда = Проигрыши.Команда
	                      |				И Последнее.Период > Проигрыши.Период
	                      |				И (Проигрыши.Победа = ЛОЖЬ)
	                      |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |	И Последнее.Победа = ИСТИНА
	                      |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Количество УБЫВ,
	                      |	КоличествоОчков УБЫВ,
	                      |	КоличествоЗабито УБЫВ,
	                      |	Команда
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Если ТипГрафика = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	Противники.КоличествоГолов = 0 КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	Противники.КоличествоГолов = 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 3 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 4 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков <= Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков <= Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 5 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 6 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Количество,
		               |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов), 0) КАК КоличествоЗабито,
		               |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоОчков), 0) КАК КоличествоОчков,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков > ЕСТЬNULL(Противник.КоличествоОчков, 0)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выигрыш,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = ЕСТЬNULL(Противник.КоличествоОчков, -1)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Ничья,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков < ЕСТЬNULL(Противник.КоличествоОчков, -1)
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Проигрыш,
		               |	ЕСТЬNULL(СУММА(Противник.КоличествоГолов), 0) КАК КоличествоПропущено,
		               |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов), 0) - ЕСТЬNULL(СУММА(Противник.КоличествоГолов), 0) КАК Разница
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	КоличествоОчков УБЫВ,
		               |	Разница УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Выигрыш УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
	КонецЦикла;
	
	Возврат (Отчет.Данные.Количество() > 0);
КонецФункции

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Чемпионат.СписокВыбора, Кеш);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Чемпионаты.ЗагрузитьЗначения(ЧемпионатыТекущие());
	Если Чемпионаты.Количество() > 0 Тогда
		Элементы.Чемпионат.СписокВыбора.ЗагрузитьЗначения(Чемпионаты.ВыгрузитьЗначения());
		Отчет.Чемпионат = Чемпионаты.Получить(0).Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриОткрытииНаСервере(Отказ) Тогда
		ПодключитьОбработчикОжидания("ГрафикОбновить", 0.1, Истина);
	КонецЕсли;
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбновить() Экспорт
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновитьНаСервере()
	Если ПроверитьЗаполнение() Тогда
		График.Очистить();

		Если ДанныеПолучить() Тогда
			Если Показатель = 1 И (ТипГрафика = 2 Или ТипГрафика = 3) Тогда
				Серия		= График.УстановитьСерию("Забито");
				Серия.Цвет	= ЦветаСтиля.ЦветАкцента;
			ИначеЕсли Показатель = 1 Тогда
				СерверныйФункции.СерииЗаполнить(График, Истина);
				
			ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 5 Тогда
				График.УстановитьСерию("Количество матчей");
			Иначе
				График.УстановитьСерию("Количество матчей");
				График.УстановитьСерию("Количество очков");
			КонецЕсли;
			Для Каждого Детали Из Отчет.Данные Цикл
				Точка = График.УстановитьТочку(Детали.Команда);
				Точка.Расшифровка = Детали.Команда;
				Расшифровка = Новый Структура("Команда,ТипГрафика", Детали.Команда, ТипГрафика);
				Если Показатель = 1 И (ТипГрафика = 2 Или ТипГрафика = 3) Тогда
					График.УстановитьЗначение(Точка, 0, Детали.КоличествоЗабито, Расшифровка);
				ИначеЕсли Показатель = 1 Тогда
					График.УстановитьЗначение(Точка, 0, Детали.КоличествоЗабито, Расшифровка);
					График.УстановитьЗначение(Точка, 1, Детали.КоличествоПропущено, Расшифровка);
					
				ИначеЕсли ТипГрафика = 1 Или ТипГрафика = 5 Тогда
					График.УстановитьЗначение(Точка, 0, Детали.Количество, Расшифровка);
				Иначе
					График.УстановитьЗначение(Точка, 0, Детали.Количество, Расшифровка);
					График.УстановитьЗначение(Точка, 1, Детали.КоличествоОчков, Расшифровка);
				КонецЕсли;
			КонецЦикла;
			График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(Показатель=1, 10, 2 * Справочники.ВидыСпорта.Победа(Отчет.Чемпионат));
			Элементы.График.Видимость			= (График.Точки.Количество() > 0);
			Элементы.ГруппаНетДанных.Видимость	= (График.Точки.Количество() = 0);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиУстановить()
	Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Беспроигрышная серия");
	Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Победная серия");
	Элементы.ТипГрафика.СписокВыбора.Добавить(2, "'Сухая' серия");
	Элементы.ТипГрафика.СписокВыбора.Добавить(3, "'Сухие' победы");
	Элементы.ТипГрафика.СписокВыбора.Добавить(4, "Безвыигрышная серия");
	Элементы.ТипГрафика.СписокВыбора.Добавить(5, "Проигрышная серия");
	Элементы.ТипГрафика.СписокВыбора.Добавить(6, "Общие результаты");
	
	Элементы.Показатель.СписокВыбора.Добавить(0, "Количество матчей, очков");
	Элементы.Показатель.СписокВыбора.Добавить(1, "Количество голов");
КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере(Отказ)
	НастройкиУстановить();
	Возврат ПроверитьЗаполнение();
КонецФункции

&НаСервереБезКонтекста
Функция ЧемпионатыТекущие()
	Возврат СерверныйФункции.ЧемпионатыТекущие();
КонецФункции

&НаСервере
Функция МатчиПолучить(Расшифровка)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.КоличествоОчков >= Противники.КоличествоОчков КАК Победа,
	                      |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
	                      |ПОМЕСТИТЬ Последнее
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Команда = &Команда
	                      |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.КоличествоОчков >= Противники.КоличествоОчков
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ ПЕРВЫЕ 11
	                      |	ТурнирнаяТаблица.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
	                      |			ПО Последнее.Период > Проигрыши.Период
	                      |				И (Проигрыши.Победа = ЛОЖЬ)
	                      |		ПО (ИСТИНА)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |	И Последнее.Победа = ИСТИНА
	                      |	И ТурнирнаяТаблица.Команда = &Команда
	                      |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТурнирнаяТаблица.Период УБЫВ");
	Если Расшифровка.ТипГрафика = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 11
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	ИначеЕсли Расшифровка.ТипГрафика = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 11
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	ИначеЕсли Расшифровка.ТипГрафика = 3 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Противники.КоличествоГолов = 0
		               |		И ТурнирнаяТаблица.КоличествоОчков > Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 11
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	ИначеЕсли Расшифровка.ТипГрафика = 4 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.КоличествоОчков <= Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.КоличествоОчков <= Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 11
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	ИначеЕсли Расшифровка.ТипГрафика = 5 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков < Противники.КоличествоОчков
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ ПЕРВЫЕ 11
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Период > Проигрыши.Период
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Последнее.Победа = ИСТИНА
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Расшифровка.Команда);
	Ответ	= Новый СписокЗначений;
	Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораКоманды(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Матчи = МатчиПолучить(Расшифровка);
		Если Матчи.Количество() = 1 Тогда
			НаКлиенте.Показать(Матчи.Получить(0).Значение, СтандартнаяОбработка);
		Иначе
			СтандартнаяОбработка = Ложь;
			
			Матчи.Добавить(Расшифровка.Команда);
			Матчи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораКоманды", ЭтотОбъект), "Выберите матч");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды") Тогда
		//
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
