
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.Чемпионат.СписокВыбора.ЗагрузитьЗначения(ЧемпионатыТекущие());
	Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) И Элементы.Чемпионат.СписокВыбора.Количество() > 0 Тогда
		Отчет.Чемпионат = Элементы.Чемпионат.СписокВыбора.Получить(0).Значение;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ПриОткрытииНаСервере(Отказ) Тогда
		ПодключитьОбработчикОжидания("ГрафикОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбновить() Экспорт
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервере
Функция УстановитьСерию(Команда)
	Точка	= График.УстановитьСерию(Команда);
	Цвет	= Цвет(Команда);
	Если ЗначениеЗаполнено(Цвет) Тогда
		Точка.Цвет			= Цвет;
		Точка.ПриоритетЦвета= Истина;
	КонецЕсли;
	Точка.Расшифровка = Команда;
	Возврат Точка;
КонецФункции

&НаСервере
Функция УстановитьТочку(Команда)
	Точка	= График.УстановитьТочку(Команда);
	Точка.Расшифровка = Команда;
	Возврат Точка;
КонецФункции

&НаСервере
Процедура ГрафикОбновитьНаСервере()
	График.Очистить();

	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		ДанныеПолучить();
		Если Показатель = 1 Тогда
			СерверныйФункции.СерииЗаполнить(График, Истина);
		Иначе
			
		КонецЕсли;
		Для Каждого Детали Из Отчет.Данные Цикл
			Расшифровка = Новый Структура("Команда,Количество", Детали.Команда, Детали.Количество);
			Если Показатель = 1 Тогда
				Точка = УстановитьТочку(Детали.Команда);
				График.УстановитьЗначение(Точка, 0, Детали.КоличествоЗабито, Расшифровка);
				График.УстановитьЗначение(Точка, 1, Детали.КоличествоПропущено, Расшифровка);
			Иначе
				Серия = УстановитьСерию(Детали.Команда);
				График.УстановитьЗначение(График.УстановитьТочку("Количество матчей"), Серия, Детали.Количество, Расшифровка);
				График.УстановитьЗначение(График.УстановитьТочку("Количество очков"), Серия, Детали.КоличествоОчков, Расшифровка);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДанныеПолучить()
	Отчет.Данные.Очистить();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.Команда КАК Команда,
	                      |	ТурнирнаяТаблица.КоличествоОчков >= 1 КАК Победа,
	                      |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
	                      |ПОМЕСТИТЬ Последнее
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда,
	                      |	ТурнирнаяТаблица.КоличествоОчков >= 1
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.Команда КАК Команда,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
	                      |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
	                      |			ПО Последнее.Команда = Проигрыши.Команда
	                      |				И (Проигрыши.Победа = ЛОЖЬ)
	                      |				И Последнее.Период > Проигрыши.Период
	                      |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
	                      |			И (Последнее.Победа = ИСТИНА)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	                      |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	                      |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.Команда
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Количество УБЫВ,
	                      |	КоличествоОчков УБЫВ,
	                      |	КоличествоЗабито УБЫВ,
	                      |	Команда
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Если ТипГрафика = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков >= 2 КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков >= 2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |				И Последнее.Период > Проигрыши.Период
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |			И (Последнее.Победа = ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	Противники.КоличествоГолов = 0 КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	Противники.КоличествоГолов = 0
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |				И Последнее.Период > Проигрыши.Период
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |			И (Последнее.Победа = ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 3 Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	Противники.КоличествоГолов = 0 И ТурнирнаяТаблица.КоличествоОчков >= 2 КАК Победа,
		               |	МАКСИМУМ(ДОБАВИТЬКДАТЕ(ТурнирнаяТаблица.Период, ДЕНЬ, 1)) КАК Период
		               |ПОМЕСТИТЬ Последнее
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда,
		               |	Противники.КоличествоГолов = 0 И ТурнирнаяТаблица.КоличествоОчков >= 2
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		               |	СУММА(Противники.КоличествоГолов) КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
		               |			ЛЕВОЕ СОЕДИНЕНИЕ Последнее КАК Проигрыши
		               |			ПО Последнее.Команда = Проигрыши.Команда
		               |				И (Проигрыши.Победа = ЛОЖЬ)
		               |				И Последнее.Период > Проигрыши.Период
		               |		ПО ТурнирнаяТаблица.Команда = Последнее.Команда
		               |			И (Последнее.Победа = ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
		               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Период МЕЖДУ ЕСТЬNULL(Проигрыши.Период, Последнее.Период) И Последнее.Период
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Количество УБЫВ,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура НастройкиУстановить()
	Элементы.Показатель.СписокВыбора.Добавить(0, "Количество матчей/очков");
	Элементы.Показатель.СписокВыбора.Добавить(1, "Количество голов");
КонецПроцедуры

&НаСервере
Функция ПриОткрытииНаСервере(Отказ)
	НастройкиУстановить();
	Возврат ПроверитьЗаполнение();
КонецФункции

&НаСервере
Функция ЧемпионатыТекущие()
	Возврат СерверныйФункции.ЧемпионатыТекущие();
КонецФункции

&НаСервере
Функция МатчиПолучить(Расшифровка)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	                      |	ТурнирнаяТаблица.Регистратор КАК Регистратор
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Команда = &Команда
	                      |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	                      |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТурнирнаяТаблица.Период УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Расшифровка.Команда);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "11", Мин(11, Расшифровка.Количество));
	Ответ	= Новый СписокЗначений;
	Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура ПослеВыбораКоманды(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		Матчи = МатчиПолучить(Расшифровка);
		Если Матчи.Количество() = 1 Тогда
			НаКлиенте.Показать(Матчи.Получить(0).Значение, СтандартнаяОбработка);
		Иначе
			СтандартнаяОбработка = Ложь;
			Матчи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбораКоманды", ЭтотОбъект), "Выберите матч");
		КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды") Тогда
		//
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры
