
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек	= Ложь;

		Если Параметры.Отбор.Свойство("Владелец") Тогда
			Элементы.Владелец.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаЗаполнитьНаСервере(Чемпионат)
	Если Справочники.Туры.Заполнить(Чемпионат) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаполнить(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Для Каждого Элемент Из Список.Отбор.Элементы Цикл
			Если ТипЗнч(Элемент.ПравоеЗначение) = Тип("СправочникСсылка.Чемпионаты")
			И ЗначениеЗаполнено(Элемент.ПравоеЗначение)
			Тогда
				КомандаЗаполнитьНаСервере(Элемент.ПравоеЗначение);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		КомандаЗаполнитьНаСервере(ТекущиеДанные.Владелец);
	КонецЕсли;
КонецПроцедуры
