
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт чемпионата");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Чемпионат) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортЧемпионата(УРЛ, Чемпионат) Тогда
			Оповестить("Матчи", Чемпионат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортЧемпионата(Гиперссылка, Чемпионат)
	Возврат СерверныйФункции.ИмпортЧемпионата(Гиперссылка, Чемпионат);
КонецФункции

&НаСервере
Функция УРЛ(Чемпионат)
	Ответ = СерверныйФункции.КомментарийКакУРЛ(Чемпионат.Комментарий);
	Если ПустаяСтрока(Ответ) Тогда
		Ответ = СерверныйФункции.КомментарийКакУРЛ(Чемпионат.Владелец.Комментарий);
	КонецЕсли;
	Если СтрНайти(Ответ, "/%1/") > 0 Тогда
		Ответ = СтрШаблон(Ответ, ФорматЧГ(Чемпионат.ДатаОкончания));
	ИначеЕсли НЕ ПустаяСтрока(Ответ) Тогда
		Ответ = СтрШаблон(Ответ + "%1/", ФорматЧГ(Чемпионат.ДатаОкончания));
	КонецЕсли;
	Возврат Ответ;
КонецФункции
