
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт чемпионата");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Чемпионат) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортЧемпионата(УРЛ, Чемпионат) Тогда
			Оповестить("Чемпионат", Чемпионат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортЧемпионата(Гиперссылка, Чемпионат)
	Если СерверныйФункции.ИмпортЧемпионата(Гиперссылка, Чемпионат) Тогда
		Справочники.Туры.ДатыУстановить(Чемпионат);
		РегистрыСведений.Итоги.Обновить(Чемпионат, Истина);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция КомментарийКакУРЛ(Комментарий, КакЕсть=Ложь)
	Возврат СерверныйФункции.КомментарийКакУРЛ(Комментарий, КакЕсть);
КонецФункции

&НаСервере
Функция УРЛ(Чемпионат)
	Ответ = КомментарийКакУРЛ(Чемпионат.Комментарий);
	Если ПустаяСтрока(Ответ) Тогда
		Ответ = КомментарийКакУРЛ(Чемпионат.Владелец.Комментарий, Истина);
		Если СтрНайти(Ответ, "/%1/") > 0 Тогда
			Ответ = СтрШаблон(Ответ, ФорматЧГ(Чемпионат.ДатаОкончания)) + ?(Год(Чемпионат.ДатаОкончания) > 2010, "games.htm", "");
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции
