
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт чемпионата");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Чемпионат) Экспорт
	Ответ = Ложь;
	Если ЭтоУРЛ(УРЛ) Тогда
		Ответ = ИмпортЧемпионата(УРЛ, Чемпионат);
	ИначеЕсли НЕ ПустаяСтрока(УРЛ) И НЕ ОлимпийскаяСистема(Чемпионат) Тогда
		Ответ = ИмпортЧемпионатПоСтроке2(УРЛ, Чемпионат);
	КонецЕсли;
	Если Ответ Тогда
		НаКлиенте.Оповещение("Чемпионат", Чемпионат);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ОлимпийскаяСистема(Чемпионат)
	Возврат Чемпионат.Владелец.ОлимпийскаяСистема;
КонецФункции

&НаСервере
Функция ИмпортЧемпионата(Гиперссылка, Чемпионат)
	Если СерверныйФункции.ИмпортЧемпионата(Гиперссылка, Чемпионат) Тогда
		Справочники.Туры.ДатыУстановить(Чемпионат);
		РегистрыСведений.Итоги.Обновить(Чемпионат, Истина);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция КомментарийКакУРЛ(Комментарий, КакЕсть=Ложь)
	Возврат СерверныйФункции.КомментарийКакУРЛ(Комментарий, КакЕсть);
КонецФункции

&НаСервере
Функция УРЛ(Чемпионат)
	Ответ = КомментарийКакУРЛ(Чемпионат.Комментарий);
	Если ПустаяСтрока(Ответ) Тогда
		Ответ = КомментарийКакУРЛ(Чемпионат.Владелец.Комментарий, Истина);
		Если ПустаяСтрока(Ответ) Тогда
			//
		ИначеЕсли СтрНайти(Ответ, "/%1/") > 0 Тогда
			Ответ = СтрШаблон(Ответ, ФорматЧГ(Чемпионат.ДатаОкончания)) + ?(Год(Чемпионат.ДатаОкончания) > 2010, "games.htm", "");
		Иначе
			Ответ = Ответ + ФорматЧГ(Чемпионат.ДатаОкончания) + "/";
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ИмпортЧемпионатПоСтроке2(Текст, Чемпионат) Экспорт
	Ответ = СерверныйФункции.ИмпортЧемпионатПоСтроке2(Текст, Чемпионат);
	Если Ответ Тогда
		РегистрыСведений.Итоги.Обновить(Чемпионат, Истина);
	КонецЕсли;
	Возврат Ответ;
КонецФункции
