
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт чемпионата");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Чемпионат) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортЧемпионата(УРЛ, Чемпионат) Тогда
			Оповестить("Чемпионат", Чемпионат);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортЧемпионата(Гиперссылка, Чемпионат)
	Если СерверныйФункции.ИмпортЧемпионата(Гиперссылка, Чемпионат) Тогда
		Справочники.Туры.ДатыУстановить(Чемпионат);
		РегистрыСведений.ИтогиПромежуточные.Обновить(Чемпионат, Истина);
		РегистрыСведений.Итоги.Обновить(Чемпионат, Истина);
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция КомментарийКакУРЛ(Комментарий)
	Возврат СерверныйФункции.КомментарийКакУРЛ(Комментарий);
КонецФункции

&НаСервере
Функция УРЛ(Чемпионат)
	Ответ = КомментарийКакУРЛ(Чемпионат.Комментарий);
	Если ПустаяСтрока(Ответ) Тогда
		Ответ = КомментарийКакУРЛ(Чемпионат.Владелец.Комментарий);
	КонецЕсли;
	Если ПустаяСтрока(Ответ) Тогда
		//
	ИначеЕсли СтрНайти(Ответ, "/%1/") > 0 Тогда
		Ответ = СтрШаблон(Ответ, ФорматЧГ(Чемпионат.ДатаОкончания));
	ИначеЕсли СтрНайти(Ответ, ФорматЧГ(Чемпионат.ДатаОкончания)) = 0 Тогда
		Ответ = СтрШаблон(Ответ + "%1", ФорматЧГ(Чемпионат.ДатаОкончания) + ?(Год(Чемпионат.ДатаОкончания) > 2010, "/games.htm", "/"));
	КонецЕсли;
	Возврат Ответ;
КонецФункции
