
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТекущиеПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекущиеПриИзмененииНаСервере()
	ОтборЭлемент = Неопределено;
	Для Каждого тЭлемент Из Список.Отбор.Элементы Цикл
		Если СтрСравнить(тЭлемент.Представление, "Текущие") = 0 Тогда
			ОтборЭлемент	= тЭлемент;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если ОтборЭлемент = Неопределено Тогда
		ОтборЭлемент	= Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемент.ВидСравнения	= ВидСравненияКомпоновкиДанных.ВСписке;
		ОтборЭлемент.ЛевоеЗначение	= Новый ПолеКомпоновкиДанных("Ссылка");
		ОтборЭлемент.ПравоеЗначение	= ТекущиеПолучить();
		ОтборЭлемент.Представление	= "Текущие";
	КонецЕсли;
	ОтборЭлемент.Использование = Текущие;
КонецПроцедуры

&НаСервере
Функция ТекущиеПолучить()
	Возврат СерверныйФункции.ЧемпионатыТекущие();
КонецФункции

&НаКлиенте
Процедура ТекущиеПриИзменении(Элемент)
	ТекущиеПриИзмененииНаСервере();
КонецПроцедуры
