	
Функция ПараметрыДиалога() Экспорт
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок	= "Выберите изображение";
	//ПараметрыДиалога.МножественныйВыбор	= 
	ПараметрыДиалога.Фильтр		= "Изображения|*.JPG;*.JPEG;*.JP2;*.JPG2;*.PNG;*.BMP;*.SVG;*.TIFF;*.WMF";
	Возврат ПараметрыДиалога;
КонецФункции

Процедура ПоНавигационнойСсылкеПерейти(НавигационнаяСсылка) Экспорт
	Если НЕ ПустаяСтрока(НавигационнаяСсылка) Тогда
		Попытка
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура Показать(Данные, СтандартнаяОбработка=Ложь) Экспорт
	СтандартнаяОбработка = Ложь;
	Если Данные <> Неопределено Тогда
		Попытка
			Если ТипЗнч(Данные) = Тип("ЭлементСпискаЗначений") Тогда
				ПоказатьЗначение(, Данные.Значение);
			Иначе
				ПоказатьЗначение(, Данные);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура КаталогаФайловУстановить() Экспорт
	#Если НЕ ВебКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.КаталогаФайловУстановить");
	#КонецЕсли
КонецПроцедуры

Процедура ОбработкаКомандыОткрытьФорму(ИмяФормы, ПараметрКоманды, ПараметрыВыполненияКоманды) Экспорт
	ОткрытьФорму(ИмяФормы, ПараметрКоманды, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

Функция ТекстовыйДокументПрочитать(ИмяФайла) Экспорт
	Ответ	= "";
	Если НЕ ПустаяСтрока(ИмяФайла) Тогда
		Попытка
			ТекстовыйДокумент = Новый ТекстовыйДокумент;
			ТекстовыйДокумент.Прочитать(ИмяФайла);
			Ответ	= ТекстовыйДокумент.ПолучитьТекст();
		Исключение
			СерверныйФункции.Логировать("НаКлиенте.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ИмяФайла);
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Процедура КартинкиЗагрузить(Список, Кеш) Экспорт
	Для Каждого Элемент Из Список Цикл
		ЭлементК	= Кеш.НайтиПоЗначению(Элемент.Значение);
		Если ЭлементК = Неопределено Тогда
			ЭлементК = Кеш.Добавить(Элемент.Значение,,, СерверныйФункции.ИзображениеПолучить(Элемент.Значение, Истина));
		КонецЕсли;
		Картинка	= ЭлементК.Картинка;
		Если Картинка.Вид <> ВидКартинки.Пустая Тогда
			Элемент.Картинка	= Картинка;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ФотоПолучить(Форма, ТекущиеДанные, ИмяСвойства="Игрок") Экспорт
	Если ТекущиеДанные = Неопределено Тогда
		//
	ИначеЕсли Форма.ТекущийИгрок = ТекущиеДанные[ИмяСвойства] Тогда
		//
	Иначе
		Форма.ТекущийИгрок = ТекущиеДанные.Игрок;
		ФотоПолучитьНаСервере(Форма, Форма.ТекущийИгрок);
	КонецЕсли;
КонецПроцедуры

Процедура ФотоПолучитьНаСервере(Форма, Ссылка)
	Элемент	= Форма.Кеш.НайтиПоЗначению(Ссылка);
	Если Элемент = Неопределено Тогда
		Форма.ИЗО	= СерверныйФункции.ИзображениеПолучить(Ссылка);
		Форма.Кеш.Добавить(Ссылка, Форма.ИЗО);
	Иначе
		Форма.ИЗО	= Элемент.Представление;
	КонецЕсли;
КонецПроцедуры
