	
Функция ПараметрыДиалога() Экспорт
	ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов;
	ПараметрыДиалога.Заголовок	= "Выберите изображение";
	//ПараметрыДиалога.МножественныйВыбор	= 
	ПараметрыДиалога.Фильтр		= "Изображения|*.JPG;*.JPEG;*.JP2;*.JPG2;*.PNG;*.BMP;*.SVG;*.TIFF;*.WMF";
	Возврат ПараметрыДиалога;
КонецФункции

Процедура ПоНавигационнойСсылкеПерейти(НавигационнаяСсылка) Экспорт
	Если НЕ ПустаяСтрока(НавигационнаяСсылка) Тогда
		Попытка
			ПерейтиПоНавигационнойСсылке(НавигационнаяСсылка);
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура Показать(Данные, СтандартнаяОбработка=Ложь) Экспорт
	СтандартнаяОбработка = Ложь;
	Если Данные <> Неопределено Тогда
		Попытка
			Если ТипЗнч(Данные) = Тип("ЭлементСпискаЗначений") Тогда
				ПоказатьЗначение(, Данные.Значение);
			Иначе
				ПоказатьЗначение(, Данные);
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

Процедура КаталогаФайловУстановить() Экспорт
	#Если ТонкийКлиент Тогда
		ОткрытьФорму("ОбщаяФорма.КаталогаФайловУстановить");
	#КонецЕсли
КонецПроцедуры

Процедура ОбработкаКомандыОткрытьФорму(ИмяФормы, ПараметрКоманды, ПараметрыВыполненияКоманды=Неопределено) Экспорт
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		ОткрытьФорму(ИмяФормы, ПараметрКоманды);
	Иначе
		Параметры	= Новый Структура("Уникальность,Источник,Окно,НавигационнаяСсылка", Истина);
		ЗаполнитьЗначенияСвойств(Параметры, ПараметрыВыполненияКоманды);
		ОткрытьФорму(ИмяФормы, ПараметрКоманды, Параметры.Источник, Параметры.Уникальность, Параметры.Окно, Параметры.НавигационнаяСсылка);
	КонецЕсли;
КонецПроцедуры
