
&НаКлиенте
Процедура ТолькоДниРожденияПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура ДатыУстановить()
	Период.Вариант	= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	КомандаОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если Игрок = Параметр Тогда
		Игрок = Неопределено;
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.ИгрокИлиМатч, Игрок, Изображение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ИзображениеДефолт	= ИзображениеДефолтПолучить();
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата",				Вчера());
	Список.Параметры.УстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
	
	Если НЕ ЗначениеЗаполнено(Период) Тогда
		ДатыУстановить();
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(МояКоманда) Тогда
		МояКоманда		= МояКоманда();
	КонецЕсли;
	КомандаОбновить();
КонецПроцедуры

&НаСервере
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервереБезКонтекста
Функция ИзображениеДефолтПолучить()
	Возврат СерверныйФункции.ИзображениеДефолтПолучить();
КонецФункции

&НаСервереБезКонтекста
Функция Вчера()
	Возврат (НачалоДня(ТекущаяДатаСеанса()) - 1);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда=Неопределено)
	Элементы.Период.Подсказка	= Строка(Период);
	
	//Список.Параметры.УстановитьЗначениеПараметра("Команда",				МояКоманда);
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
	СписокУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	СписокУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
	//Элементы.Список.Обновить();
	СписокПриАктивизацииСтроки();
КонецПроцедуры

&НаКлиенте
Процедура СписокУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	ШалостьУдалась = Ложь;
	Для Каждого Параметр Из Список.Параметры.Элементы Цикл
		Если СтрСравнить(Параметр.Параметр, ПараметрИмя) = 0 Тогда
			Если Параметр.Значение <> Значение Тогда
				Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
			КонецЕсли;
			ШалостьУдалась		= Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ШалостьУдалась Тогда
		Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПоказатьЗначение(, Элемент.ТекущиеДанные.ИгрокИлиМатч);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент=Неопределено)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		//
	ИначеЕсли Элементы.Список.ТекущиеДанные.ЭтоИгрок Тогда
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.ИгрокИлиМатч, Игрок, Изображение);
		Возврат;
	//ИначеЕсли Изображение <> ИзображениеДефолт Тогда
	//	Игрок		= Неопределено;
	//	Изображение	= ИзображениеДефолт;
	//Иначе
	//	Возврат;
	КонецЕсли;
	Если ЗначениеЗаполнено(Игрок) Тогда
		Игрок		= Неопределено;
		Изображение	= ИзображениеДефолт;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ИзображениеУстановить(ИгрокИлиМатч, Игрок, Изображение)
	Если ИгрокИлиМатч = Игрок Тогда
		//
	Иначе
		Если ИгрокИлиМатч.Изображение.Получить() = Неопределено Тогда
			Изображение	= ИзображениеДефолтПолучить();
		Иначе
			Изображение	= ПолучитьНавигационнуюСсылку(ИгрокИлиМатч, "Изображение");
		КонецЕсли;
		Игрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры
