
&НаСервере
Процедура ИзображениеУстановить(ИгрокИлиМатч)
	Если ИгрокИлиМатч = ТекущийИгрок Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(ИгрокИлиМатч);
		ТекущийИгрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокОбновитьНаСервере()
	Элементы.Период.Подсказка	= Строка(Период);

	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
	СписокУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	СписокУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
	ФотоПолучить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДниРожденияПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура ДатыУстановить()
	Период.Вариант		= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
	Если День(Период.ДатаОкончания) - День(Период.ДатаНачала) <= 3 Тогда
		Период.ДатаОкончания	= КонецМесяца(Период.ДатаОкончания + Сутки());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	СписокОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = ТекущийИгрок
	Тогда
		ТекущийИгрок	= Неопределено;
		ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("Команда",			?(ЗначениеЗаполнено(МояКоманда), МояКоманда, Неопределено));
	ФотоПолучить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатыУстановить();
	МояКоманда		= МояКоманда();

	СписокОбновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Функция ИзображениеПолучить(Команда=Неопределено)
	Если Команда = Неопределено Тогда
		Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
	КонецЕсли;
	Возврат СерверныйФункции.ИзображениеПолучить(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда)
	СписокОбновить();
КонецПроцедуры

&НаСервере
Процедура СписокУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(Элемент.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Изображение	= ИзображениеПолучить(МояКоманда);
	ИначеЕсли Элементы.Список.ТекущиеДанные.ЭтоИгрок Тогда
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.ИгрокИлиМатч);
	Иначе
		Изображение	= ИзображениеПолучить(МояКоманда);
		ТекущийИгрок	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Период.ДатаОкончания > ДобавитьМесяц(Период.ДатаНачала, 12) Тогда
		Период.ДатаОкончания = КонецГода(Период.ДатаНачала);
	Иначе
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмпортИгрПоКалендарюНаСервере(Текст, Команда)
	Возврат СерверныйФункции.ИмпортИгрПоКалендарю(Текст, Команда);
КонецФункции

&НаКлиенте
Процедура ИмпортИгрПоКалендарю(Текст)
	Ответ	= ИмпортИгрПоКалендарюНаСервере(Текст, МояКоманда);
	Если Ответ > 0 Тогда
		НаКлиенте.Оповещение("Матчи");
		Сообщить(СтрШаблон("Добавлено/изменено событий: %1", Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгрПоСтроке(Текст)
	Ответ	= 0;
	Матч	= Новый Структура("Дата,Клубы", Дата(1, 1, 1), Новый Массив);
	КлубИмя	= "";
	Для Каждого Слова Из Разделить(СтрЗаменить(Текст, "¶", " "), "	") Цикл
		Если ЗначениеЗаполнено(Матч.Дата) Тогда
			Для Каждого Слово Из Разделить(СтрЗаменить(Слова, " : ", ":")) Цикл
				Если СтрНайти(Слово, ":") > 0 Тогда
					Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					КонецЕсли;
					КлубИмя	= "";
					
					Если Матч.Клубы.Количество() = 2 Тогда
						Цыфры		= Разделить(Слово, ":");
						Итератор	= 0;
						Матч.Вставить("Команды", Новый Массив);
						Для Каждого Команда Из Матч.Клубы Цикл
							Матч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов", Команда, СтрокаКакЧисло(Цыфры.Получить(Итератор))));
							Итератор = Итератор + 1;
						КонецЦикла;
						
						Док = Документы.Матч.СоздатьДокумент();
						Док.Дата	= Матч.Дата;
						Для Каждого Элемент Из Матч.Команды Цикл
							ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Элемент);
						КонецЦикла;
						Если Док.ПроверитьЗаполнение() Тогда
							Ссылка = СерверныйФункции.МатчНайти(Матч.Клубы, Матч.Дата);
							Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
								Попытка
									Док.ДополнительныеСвойства.Вставить("Импорт", Истина);
									Док.Записать(РежимЗаписиДокумента.Проведение);
									Ответ = Ответ + 1;
								Исключение
									ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Матч	= Новый Структура("Дата,Клубы", Дата(1, 1, 1), Новый Массив);
					Прервать;
					
				ИначеЕсли Слово = "–" Тогда
					Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					Иначе
						ОбщегоНазначения.СообщитьОбОшибке(КлубИмя);
					КонецЕсли;
					КлубИмя = "";
				Иначе
					КлубИмя = КлубИмя + " " + Слово;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Матч.Дата = СтрокаКакДата(Лев(СокрЛ(Слова), 10));
			Если Матч.Дата > НачалоДня(ТекущаяДатаСеанса()) Тогда
				Матч.Дата = Дата(1, 1, 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	Если ЗначениеЗаполнено(МояКоманда) Тогда
		Гиперссылка	= УРЛ;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), Гиперссылка, "Импорт календаря (iCal)");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйДокументПрочитан(ДополнительныеПараметры=Неопределено) Экспорт
	ИмпортИгрПоКалендарю(ТекстовыйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПродолжить(ФайлСуществует, ДополнительныеПараметры) Экспорт
	Если ФайлСуществует Тогда
		Попытка
			ТекстовыйДокумент.НачатьЧтение(Новый ОписаниеОповещения("ТекстовыйДокументПрочитан", ЭтотОбъект), ДополнительныеПараметры);
		Исключение
			СерверныйФункции.Логировать("Календарь.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ДополнительныеПараметры);
		КонецПопытки;
	Иначе
		Ответ = ИмпортИгрПоСтроке(ДополнительныеПараметры);
		Если Ответ > 0 Тогда
			НаКлиенте.Оповещение("Матчи");
			Сообщить(СтрШаблон("Добавлено событий: %1", Ответ));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Гиперссылка, ДополнительныеПараметры=Неопределено) Экспорт
	Если ЭтоУРЛ(Гиперссылка) Тогда
		УРЛ		= Гиперссылка;
		Текст	= СкачатьПоСсылке(Гиперссылка);
		ИмпортИгрПоКалендарю(Текст);
		
	ИначеЕсли НЕ ПустаяСтрока(Гиперссылка) Тогда
		Файл = Новый Файл(Гиперссылка);
		Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ИмпортПродолжить", ЭтотОбъект, Гиперссылка));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкачатьПоСсылке(Гиперссылка)
	Возврат СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
КонецФункции

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	Показать(Элементы.Список.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Показать(ТекущиеДанные, СтандартнаяОбработка=Ложь)
	НаКлиенте.Показать(ТекущиеДанные.ИгрокИлиМатч, СтандартнаяОбработка);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзображениеДефолт	= ИзображениеПолучить();
КонецПроцедуры
