
&НаСервере
Процедура ИзображениеУстановить(ИгрокИлиМатч)
	Если ИгрокИлиМатч = ТекущийИгрок Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(ИгрокИлиМатч);
		ТекущийИгрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Изображение	= ИзображениеПолучить(МояКоманда);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия
	И Элементы.Список.ТекущиеДанные.Свойство("ЭтоИгрок")
	И Элементы.Список.ТекущиеДанные.ЭтоИгрок
	И Элементы.Список.ТекущиеДанные.Свойство("Ссылка")
	Тогда
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.Ссылка);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийИгрок) Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(МояКоманда);
		ТекущийИгрок	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокОбновитьНаСервере()
	Элементы.Период.Подсказка	= Строка(Период);

	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
	СписокУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	СписокУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
	ФотоПолучить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДниРожденияПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура ДатыУстановить()
	Период.Вариант		= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
	Если День(Период.ДатаОкончания) - День(Период.ДатаНачала) <= 3 Тогда
		Период.ДатаОкончания	= КонецМесяца(Период.ДатаОкончания + Сутки());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = ТекущийИгрок
	Тогда
		ТекущийИгрок	= Неопределено;
		ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Новости") = 0 Тогда
		ПодключитьОбработчикОжидания("НовостиОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "ЧтениеНовостей") = 0 Тогда
		Элементы.СтраницаНовости.Видимость = Параметр;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("Команда",			?(ЗначениеЗаполнено(МояКоманда), МояКоманда, Неопределено));
	ФотоПолучить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Функция ИзображениеПолучить(Команда=Неопределено)
	Если Команда = Неопределено Тогда
		Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
	КонецЕсли;
	Возврат СерверныйФункции.ИзображениеПолучить(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда)
	СписокОбновить();
КонецПроцедуры

&НаСервере
Процедура СписокУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(ВыбраннаяСтрока, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Период.ДатаОкончания > ДобавитьМесяц(Период.ДатаНачала, 12) Тогда
		Период.ДатаОкончания = КонецГода(Период.ДатаНачала);
	Иначе
		ПодключитьОбработчикОжидания("СписокОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия, 0.1, 1), Истина);
		ПодключитьОбработчикОжидания("НовостиОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНовости, 0.1, 1), Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмпортИгрПоКалендарюНаСервере(Текст, Команда)
	Возврат СерверныйФункции.ИмпортИгрПоКалендарю(Текст, Команда);
КонецФункции

&НаКлиенте
Процедура ИмпортИгрПоКалендарю(Текст)
	Ответ	= ИмпортИгрПоКалендарюНаСервере(Текст, МояКоманда);
	Если Ответ > 0 Тогда
		НаКлиенте.Оповещение("Матчи");
		Сообщить(СтрШаблон("Добавлено/изменено событий: %1", Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгрПоСтроке(Текст)
	Ответ	= 0;
	Матч	= Новый Структура("Дата,Клубы,Команды", Дата(1, 1, 1), Новый Массив, Новый Массив);
	КлубИмя	= "";
	Для Каждого Слова Из Разделить(СтрЗаменить(Текст, "¶", " "), "	") Цикл
		Если ЗначениеЗаполнено(Матч.Дата) Тогда
			Для Каждого Слово Из Разделить(СтрЗаменить(Слова, " : ", ":")) Цикл
				Если СтрНайти(Слово, ":") > 0 Тогда
					Если Матч.Команды.Количество() = 2 Тогда
						//
					ИначеЕсли СтрНайти(КлубИмя, "(") = 0 Тогда
						Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Иначе
						мСтроки	= Разделить(КлубИмя, "(", Истина);
						Если мСтроки.Количество() = 2 Тогда
							Клуб = СерверныйФункции.КомандаНайти(мСтроки.Получить(0), СтрУдалить(мСтроки.Получить(1), ")"));
						Иначе
							Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
						КонецЕсли;
					КонецЕсли;
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					КонецЕсли;
					КлубИмя	= "";
					
					Если Матч.Команды.Количество() = 2 Тогда
						Цифры		= Разделить(Слово, ":");
						Итератор	= 0;
						Для Каждого Команда Из Матч.Команды Цикл
							Команда.Вставить("Пенальти", СтрокаКакЧисло(Цифры.Получить(Итератор)));
							Итератор = Итератор + 1;
						КонецЦикла;
					ИначеЕсли Матч.Клубы.Количество() = 2 Тогда
						Цифры		= Разделить(Слово, ":");
						Итератор	= 0;
						Для Каждого Команда Из Матч.Клубы Цикл
							Матч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов", Команда, СтрокаКакЧисло(Цифры.Получить(Итератор))));
							Итератор = Итератор + 1;
						КонецЦикла;
					КонецЕсли;
					
				ИначеЕсли Слово = "–" Тогда
					Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					Иначе
						ОбщегоНазначения.СообщитьОбОшибке(КлубИмя);
					КонецЕсли;
					КлубИмя = "";
				Иначе
					КлубИмя = КлубИмя + " " + Слово;
				КонецЕсли;
			КонецЦикла;
			Если Матч.Команды.Количество() = 2 Тогда
				Ссылка = СерверныйФункции.МатчНайти(Матч.Клубы, Матч.Дата);
				Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
					Док = Документы.Матч.СоздатьДокумент();
					Док.Дата	= Матч.Дата;
					Для Каждого Элемент Из Матч.Команды Цикл
						ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Элемент);
					КонецЦикла;
					Если Док.ПроверитьЗаполнение() Тогда
						Попытка
							Док.ДополнительныеСвойства.Вставить("Импорт", Истина);
							Док.Записать(РежимЗаписиДокумента.Проведение);
							Ответ = Ответ + 1;
						Исключение
							ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Матч	= Новый Структура("Дата,Клубы,Команды", Дата(1, 1, 1), Новый Массив, Новый Массив);
		Иначе
			Матч.Дата = СтрокаКакДата(Лев(СокрЛ(Слова), 10));
			Если Матч.Дата > НачалоДня(ТекущаяДатаСеанса()) Тогда
				Матч.Дата = Дата(1, 1, 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	Если ЗначениеЗаполнено(МояКоманда) Тогда
		Гиперссылка	= УРЛ;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), Гиперссылка, "Импорт календаря (iCal)");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйДокументПрочитан(ДополнительныеПараметры=Неопределено) Экспорт
	ИмпортИгрПоКалендарю(ТекстовыйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПродолжить(ФайлСуществует, ДополнительныеПараметры) Экспорт
	Если ФайлСуществует Тогда
		Попытка
			ТекстовыйДокумент.НачатьЧтение(Новый ОписаниеОповещения("ТекстовыйДокументПрочитан", ЭтотОбъект), ДополнительныеПараметры);
		Исключение
			СерверныйФункции.Логировать("Календарь.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ДополнительныеПараметры);
		КонецПопытки;
	Иначе
		Ответ = ИмпортИгрПоСтроке(ДополнительныеПараметры);
		Если Ответ > 0 Тогда
			НаКлиенте.Оповещение("Матчи");
			Сообщить(СтрШаблон("Добавлено событий: %1", Ответ));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Функция ПараметрыДиалога()
	Возврат НаКлиенте.ПараметрыДиалога("ics");
КонецФункции

&НаКлиенте
Процедура Импорт(Гиперссылка, ДополнительныеПараметры=Неопределено) Экспорт
	Если Гиперссылка = Неопределено Тогда
		//
	ИначеЕсли ТипЗнч(Гиперссылка) = Тип("ОписаниеПомещенногоФайла") Тогда
		Импорт(Гиперссылка.СсылкаНаФайл.Файл.ПолноеИмя);
		
	ИначеЕсли ЭтоУРЛ(Гиперссылка) Тогда
		УРЛ		= Гиперссылка;
		Текст	= СкачатьПоСсылке(Гиперссылка);
		ИмпортИгрПоКалендарю(Текст);
	
	ИначеЕсли ПустаяСтрока(Гиперссылка) Тогда	// выбор файла ics
		НачатьПомещениеФайлаНаСервер(Новый ОписаниеОповещения("Импорт", ЭтотОбъект),,,, ПараметрыДиалога());
	Иначе
		Файл = Новый Файл(Гиперссылка);
		Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ИмпортПродолжить", ЭтотОбъект, Гиперссылка));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкачатьПоСсылке(Гиперссылка)
	Возврат СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
КонецФункции

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	Показать(Элементы.Список.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Показать(Ссылка, СтандартнаяОбработка=Ложь)
	Если Ссылка <> Неопределено Тогда
		НаКлиенте.Показать(Ссылка, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзображениеДефолт	= ИзображениеПолучить();
	
	Элементы.СтраницаНовости.Видимость = НаСервереПовторно.ЧтениеНовостей();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатыУстановить();
	МояКоманда		= МояКоманда();
	
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаСервере
Процедура НовостиУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Новости.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаСервере
Процедура НовостиОбновитьНаСервере()
	Если Элементы.СтраницаНовости.Видимость Тогда
		Элементы.Период.Подсказка	= Строка(Период);

		НовостиУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
		НовостиУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
		НовостиУстановитьЗначениеПараметра("МояКоманда",		Обернуть(МояКоманда));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиОбновить() Экспорт
	НовостиОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовостиОбновить(Команда)
	НовостиОбновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьПровестиНаСервере(Ссылка)
	Если НЕ Ссылка.Проведен Тогда
		Попытка
			Док	= Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Ссылка);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Возврат Истина
КонецФункции

&НаКлиенте
Процедура НовостьПровести() Экспорт
	Если ЗначениеЗаполнено(НовостьТекущая)
	И Элементы.Новости.ТекущиеДанные <> Неопределено
	И Элементы.Новости.ТекущиеДанные.Свойство("Ссылка")
	И Элементы.Новости.ТекущиеДанные.Ссылка = НовостьТекущая
	И НовостьПровестиНаСервере(НовостьТекущая)
	Тогда
		Элементы.Новости.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиПриАктивизацииСтроки(Элемент)
	Если Элементы.Новости.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(НовостьТекущая) Тогда
			НовостьТекущая	= Неопределено;
			Содержание.Удалить();
		КонецЕсли;
	Иначе
		Если Элементы.Новости.ТекущиеДанные.Свойство("Комментарий") Тогда
			ТекстУстановитьНаСервере(Содержание, Элементы.Новости.ТекущиеДанные.Комментарий);
		КонецЕсли;
		Если Элементы.Новости.ТекущиеДанные.Свойство("Ссылка") Тогда
			НовостьТекущая	= Элементы.Новости.ТекущиеДанные.Ссылка;
			Если Элементы.Новости.ТекущиеДанные.Свойство("Проведен")
			И НЕ Элементы.Новости.ТекущиеДанные.Проведен
			Тогда
				ПодключитьОбработчикОжидания("НовостьПровести", 3, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТекстУстановитьНаСервере(Содержание, Знач Комментарий)
	Содержание.Удалить();
	УРЛ = СерверныйФункции.КомментарийКакУРЛ(Комментарий, Истина);
	Комментарий = СтрЗаменить(Комментарий, Символы.ПС, "<br>");
	Содержание.УстановитьHTML(Комментарий, Новый Структура);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьУдалитьНаСервере(Ссылка)
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Новости") Тогда
		Попытка
			Док = Ссылка.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
			Ответ = Истина;
		Исключение КонецПопытки;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Для Каждого Документ Из Ссылка Цикл
			Ответ = Макс(Ответ, НовостьУдалитьНаСервере(Документ));
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура НовостьУдалить()
	Если Элементы.Новости.ТекущиеДанные <> Неопределено
	И Элементы.Новости.ТекущиеДанные.Свойство("Ссылка")
	Тогда
		НовостьТекущая	= Неопределено;
		Содержание.Удалить();
		Если Элементы.Новости.ВыделенныеСтроки.Количество() = 1 Тогда
			Если НовостьУдалитьНаСервере(Элементы.Новости.ТекущиеДанные.Ссылка) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		Иначе
			Результат = Новый Массив;
			Для Каждого Проверка Из Элементы.Новости.ВыделенныеСтроки Цикл
				ДанныеПроверки = Элементы.Новости.ДанныеСтроки(Проверка);
				Если ДанныеПроверки = Неопределено Тогда
					//
				ИначеЕсли Результат.Найти(ДанныеПроверки.Ссылка) = Неопределено Тогда
					Результат.Добавить(ДанныеПроверки.Ссылка);
				КонецЕсли;
			КонецЦикла;
			Если НовостьУдалитьНаСервере(Результат) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	НовостьУдалить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СсылкаПодобрать(Ссылка, Комментарий)
	Ответ = Неопределено;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Новости") Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка",				Ссылка);
		Запрос.УстановитьПараметр("Чемпионат",			Неопределено);
		ЧислоСтрок = СтрЧислоСтрок(Комментарий);
		Для НомерСтроки = 1 По ЧислоСтрок Цикл
			Если ЗначениеЗаполнено(Ответ) Тогда Прервать; КонецЕсли;
			Наименование = СтрУдалить(СтрПолучитьСтроку(Комментарий, НомерСтроки), Разделить(". ,"));
			Слова = Разделить(Наименование);
			Если Слова.Количество() >= 2 И Слова.Количество() <= 4 Тогда
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				               |	Чемпионаты.Ссылка КАК Ссылка,
				               |	Новости.Дата КАК Дата
				               |ИЗ
				               |	Документ.Новости КАК Новости
				               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
				               |		ПО (Новости.Дата МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания)
				               |ГДЕ
				               |	Новости.Ссылка = &Ссылка
				               |	И ВЫБОР
				               |			КОГДА Чемпионаты.Наименование ПОДОБНО &Комментарий
				               |				ТОГДА Чемпионаты.Наименование ПОДОБНО &Комментарий1
				               |			КОГДА Чемпионаты.Комментарий ПОДОБНО &Комментарий
				               |				ТОГДА Чемпионаты.Комментарий ПОДОБНО &Комментарий1
				               |			ИНАЧЕ ЛОЖЬ
				               |		КОНЕЦ
				               |
				               |УПОРЯДОЧИТЬ ПО
				               |	Чемпионаты.ПометкаУдаления";
				Запрос.УстановитьПараметр("Комментарий",			Обернуть(Слова.Получить(0)));
				Запрос.УстановитьПараметр("Комментарий1",			Обернуть(Слова.Получить(1)));
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Запрос.УстановитьПараметр("Чемпионат",				Выборка.Ссылка);
					Запрос.УстановитьПараметр("ДатаН",					НачалоДня(Выборка.Дата - Сутки(3)));
					Запрос.УстановитьПараметр("ДатаК",					КонецДня(Выборка.Дата));
					Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
					               |	МатчКоманды.Ссылка КАК Ссылка
					               |ИЗ
					               |	Документ.Матч.Команды КАК МатчКоманды
					               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды2
					               |		ПО МатчКоманды.Ссылка = МатчКоманды2.Ссылка
					               |			И МатчКоманды.НомерСтроки <> МатчКоманды2.НомерСтроки
					               |ГДЕ
					               |	МатчКоманды.Ссылка.Дата МЕЖДУ &ДатаН И &ДатаК
					               |	И МатчКоманды.Ссылка.Тур.Владелец = &Чемпионат
					               |	И (МатчКоманды.Команда.Наименование ПОДОБНО &Комментарий
					               |			ИЛИ МатчКоманды.Команда.Комментарий ПОДОБНО &Комментарий)
					               |	И (МатчКоманды2.Команда.Наименование ПОДОБНО &Комментарий2
					               |			ИЛИ МатчКоманды2.Команда.Комментарий ПОДОБНО &Комментарий2)
					               |
					               |УПОРЯДОЧИТЬ ПО
					               |	МатчКоманды.Ссылка.Дата УБЫВ";
					Для НомерСтроки2 = 1 По ЧислоСтрок Цикл
						Если НомерСтроки2 <> НомерСтроки Тогда
							Наименование = СтрПолучитьСтроку(Комментарий, НомерСтроки2);
							Если СтрНайти(Наименование, ":") * СтрНайти(Наименование, " - ") > 0 Тогда
								Слова = Разделить(Наименование);
								Если Слова.Количество() >= 4 Тогда
									Запрос.УстановитьПараметр("Комментарий",			Обернуть(Слова.Получить(0)));
									Запрос.УстановитьПараметр("Комментарий2",			Обернуть(Слова.Получить(2)));
									Выборка = Запрос.Выполнить().Выбрать();
									Если Выборка.Следующий() Тогда
										Ответ = Выборка.Ссылка;
										Прервать;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				КонецЕсли;
			ИначеЕсли СтрЧислоВхождений(Наименование, """") >= 4 Тогда
				Слова = Новый Массив;
				Для Каждого Слово Из Разделить(Наименование) Цикл
					Если СтрЧислоВхождений(Слово, """") = 2 Тогда
						Слова.Добавить(СтрУдалить(Слово, """"));
					КонецЕсли;
				КонецЦикла;
				Если Слова.Количество() = 2 Тогда
					Если ЗначениеЗаполнено(Запрос.Параметры.Чемпионат) Тогда
						Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
						               |	МатчКоманды.Ссылка КАК Ссылка
						               |ИЗ
						               |	Документ.Матч.Команды КАК МатчКоманды
						               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды2
						               |		ПО МатчКоманды.Ссылка = МатчКоманды2.Ссылка
						               |			И МатчКоманды.НомерСтроки <> МатчКоманды2.НомерСтроки
						               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Новости КАК Новости
						               |		ПО (МатчКоманды.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(Новости.Дата, ДЕНЬ, -3) И КОНЕЦПЕРИОДА(Новости.Дата, ДЕНЬ))
						               |ГДЕ
						               |	Новости.Ссылка = &Ссылка
						               |	И МатчКоманды.Ссылка.Тур.Владелец = &Чемпионат
						               |	И (МатчКоманды.Команда.Наименование ПОДОБНО &Комментарий
						               |			ИЛИ МатчКоманды.Команда.Комментарий ПОДОБНО &Комментарий)
						               |	И (МатчКоманды2.Команда.Наименование ПОДОБНО &Комментарий1
						               |			ИЛИ МатчКоманды2.Команда.Комментарий ПОДОБНО &Комментарий1)
						               |
						               |УПОРЯДОЧИТЬ ПО
						               |	МатчКоманды.Ссылка.Дата УБЫВ";
					Иначе
						Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
						               |	МатчКоманды.Ссылка КАК Ссылка
						               |ИЗ
						               |	Документ.Матч.Команды КАК МатчКоманды
						               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды2
						               |		ПО МатчКоманды.Ссылка = МатчКоманды2.Ссылка
						               |			И МатчКоманды.НомерСтроки <> МатчКоманды2.НомерСтроки
						               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Новости КАК Новости
						               |		ПО (МатчКоманды.Ссылка.Дата МЕЖДУ ДОБАВИТЬКДАТЕ(Новости.Дата, ДЕНЬ, -3) И КОНЕЦПЕРИОДА(Новости.Дата, ДЕНЬ))
						               |ГДЕ
						               |	Новости.Ссылка = &Ссылка
						               |	И (МатчКоманды.Команда.Наименование ПОДОБНО &Комментарий
						               |			ИЛИ МатчКоманды.Команда.Комментарий ПОДОБНО &Комментарий)
						               |	И (МатчКоманды2.Команда.Наименование ПОДОБНО &Комментарий1
						               |			ИЛИ МатчКоманды2.Команда.Комментарий ПОДОБНО &Комментарий1)
						               |
						               |УПОРЯДОЧИТЬ ПО
						               |	МатчКоманды.Ссылка.Дата УБЫВ";
					КонецЕсли;
					Запрос.УстановитьПараметр("Комментарий",		Обернуть(Слова.Получить(0)));
					Запрос.УстановитьПараметр("Комментарий1",		Обернуть(Слова.Получить(1)));
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						Ответ = Выборка.Ссылка;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура НовостиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(СсылкаПодобрать(ВыбраннаяСтрока, Содержание.ПолучитьТекст()), СтандартнаяОбработка);
	Если СтандартнаяОбработка Тогда
		СтандартнаяОбработка = Ложь;
		НовостьПровести();
	КонецЕсли;
КонецПроцедуры
