
&НаСервере
Процедура ИзображениеУстановить(ИгрокИлиМатч)
	Если ИгрокИлиМатч = ТекущийИгрок Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(ИгрокИлиМатч);
		ТекущийИгрок	= ИгрокИлиМатч;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФотоПолучить() Экспорт
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		Изображение	= ИзображениеПолучить(МояКоманда);
		
	ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия
	И Элементы.Список.ТекущиеДанные.ЭтоИгрок
	Тогда
		ИзображениеУстановить(Элементы.Список.ТекущиеДанные.ИгрокИлиМатч);
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийИгрок) Тогда
		//
	Иначе
		Изображение	= ИзображениеПолучить(МояКоманда);
		ТекущийИгрок	= Неопределено;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СписокОбновитьНаСервере()
	Элементы.Период.Подсказка	= Строка(Период);

	СписокУстановитьЗначениеПараметра("Команда",			МояКоманда);
	СписокУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
	СписокУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
	ФотоПолучить();
КонецПроцедуры

&НаКлиенте
Процедура ТолькоДниРожденияПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("ТолькоДниРождения",	ТолькоДниРождения);
КонецПроцедуры

&НаКлиенте
Процедура ДатыУстановить()
	Период.Вариант		= ВариантСтандартногоПериода.ДоКонцаЭтогоМесяца;
	Если День(Период.ДатаОкончания) - День(Период.ДатаНачала) <= 3 Тогда
		Период.ДатаОкончания	= КонецМесяца(Период.ДатаОкончания + Сутки());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСегодня(Команда)
	ДатыУстановить();
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Игроки")
	И Параметр = ТекущийИгрок
	Тогда
		ТекущийИгрок	= Неопределено;
		ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "Новости") = 0 Тогда
		ПодключитьОбработчикОжидания("НовостиОбновить", 0.1, Истина);
	ИначеЕсли СтрСравнить(ИмяСобытия, "ЧтениеНовостей") = 0 Тогда
		Элементы.СтраницаНовости.Видимость = Параметр;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СписокУстановитьЗначениеПараметра("Команда",			?(ЗначениеЗаполнено(МояКоманда), МояКоманда, Неопределено));
	ФотоПолучить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Функция ИзображениеПолучить(Команда=Неопределено)
	Если Команда = Неопределено Тогда
		Возврат НаСервереПовторно.ИзображениеДефолтПолучить();
	КонецЕсли;
	Возврат СерверныйФункции.ИзображениеПолучить(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаОбновить(Команда)
	СписокОбновить();
КонецПроцедуры

&НаСервере
Процедура СписокУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Список.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(Элемент.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Если Период.ДатаОкончания > ДобавитьМесяц(Период.ДатаНачала, 12) Тогда
		Период.ДатаОкончания = КонецГода(Период.ДатаНачала);
	Иначе
		ПодключитьОбработчикОжидания("СписокОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСобытия, 0.1, 1), Истина);
		ПодключитьОбработчикОжидания("НовостиОбновить", ?(Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаНовости, 0.1, 1), Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмпортИгрПоКалендарюНаСервере(Текст, Команда)
	Возврат СерверныйФункции.ИмпортИгрПоКалендарю(Текст, Команда);
КонецФункции

&НаКлиенте
Процедура ИмпортИгрПоКалендарю(Текст)
	Ответ	= ИмпортИгрПоКалендарюНаСервере(Текст, МояКоманда);
	Если Ответ > 0 Тогда
		НаКлиенте.Оповещение("Матчи");
		Сообщить(СтрШаблон("Добавлено/изменено событий: %1", Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгрПоСтроке(Текст)
	Ответ	= 0;
	Матч	= Новый Структура("Дата,Клубы", Дата(1, 1, 1), Новый Массив);
	КлубИмя	= "";
	Для Каждого Слова Из Разделить(СтрЗаменить(Текст, "¶", " "), "	") Цикл
		Если ЗначениеЗаполнено(Матч.Дата) Тогда
			Для Каждого Слово Из Разделить(СтрЗаменить(Слова, " : ", ":")) Цикл
				Если СтрНайти(Слово, ":") > 0 Тогда
					Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					КонецЕсли;
					КлубИмя	= "";
					
					Если Матч.Клубы.Количество() = 2 Тогда
						Цыфры		= Разделить(Слово, ":");
						Итератор	= 0;
						Матч.Вставить("Команды", Новый Массив);
						Для Каждого Команда Из Матч.Клубы Цикл
							Матч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов", Команда, СтрокаКакЧисло(Цыфры.Получить(Итератор))));
							Итератор = Итератор + 1;
						КонецЦикла;
						
						Док = Документы.Матч.СоздатьДокумент();
						Док.Дата	= Матч.Дата;
						Для Каждого Элемент Из Матч.Команды Цикл
							ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Элемент);
						КонецЦикла;
						Если Док.ПроверитьЗаполнение() Тогда
							Ссылка = СерверныйФункции.МатчНайти(Матч.Клубы, Матч.Дата);
							Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
								Попытка
									Док.ДополнительныеСвойства.Вставить("Импорт", Истина);
									Док.Записать(РежимЗаписиДокумента.Проведение);
									Ответ = Ответ + 1;
								Исключение
									ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
								КонецПопытки;
							КонецЕсли;
						КонецЕсли;
					КонецЕсли;
					Матч	= Новый Структура("Дата,Клубы", Дата(1, 1, 1), Новый Массив);
					Прервать;
					
				ИначеЕсли Слово = "–" Тогда
					Клуб = СерверныйФункции.КомандаНайти(КлубИмя);
					Если ЗначениеЗаполнено(Клуб) Тогда
						Матч.Клубы.Добавить(Клуб);
					Иначе
						ОбщегоНазначения.СообщитьОбОшибке(КлубИмя);
					КонецЕсли;
					КлубИмя = "";
				Иначе
					КлубИмя = КлубИмя + " " + Слово;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Матч.Дата = СтрокаКакДата(Лев(СокрЛ(Слова), 10));
			Если Матч.Дата > НачалоДня(ТекущаяДатаСеанса()) Тогда
				Матч.Дата = Дата(1, 1, 1);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура КомандаИмпорт(Команда)
	Если ЗначениеЗаполнено(МояКоманда) Тогда
		Гиперссылка	= УРЛ;
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), Гиперссылка, "Импорт календаря (iCal)");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТекстовыйДокументПрочитан(ДополнительныеПараметры=Неопределено) Экспорт
	ИмпортИгрПоКалендарю(ТекстовыйДокумент.ПолучитьТекст());
КонецПроцедуры

&НаКлиенте
Процедура ИмпортПродолжить(ФайлСуществует, ДополнительныеПараметры) Экспорт
	Если ФайлСуществует Тогда
		Попытка
			ТекстовыйДокумент.НачатьЧтение(Новый ОписаниеОповещения("ТекстовыйДокументПрочитан", ЭтотОбъект), ДополнительныеПараметры);
		Исключение
			СерверныйФункции.Логировать("Календарь.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ДополнительныеПараметры);
		КонецПопытки;
	Иначе
		Ответ = ИмпортИгрПоСтроке(ДополнительныеПараметры);
		Если Ответ > 0 Тогда
			НаКлиенте.Оповещение("Матчи");
			Сообщить(СтрШаблон("Добавлено событий: %1", Ответ));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Гиперссылка, ДополнительныеПараметры=Неопределено) Экспорт
	Если ЭтоУРЛ(Гиперссылка) Тогда
		УРЛ		= Гиперссылка;
		Текст	= СкачатьПоСсылке(Гиперссылка);
		ИмпортИгрПоКалендарю(Текст);
		
	ИначеЕсли НЕ ПустаяСтрока(Гиперссылка) Тогда
		Файл = Новый Файл(Гиперссылка);
		Файл.НачатьПроверкуСуществования(Новый ОписаниеОповещения("ИмпортПродолжить", ЭтотОбъект, Гиперссылка));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция СкачатьПоСсылке(Гиперссылка)
	Возврат СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
КонецФункции

&НаКлиенте
Процедура ИзображениеНажатие(Элемент, СтандартнаяОбработка)
	Показать(Элементы.Список.ТекущиеДанные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Показать(ТекущиеДанные, СтандартнаяОбработка=Ложь)
	Если ЗначениеЗаполнено(ТекущиеДанные) Тогда
		НаКлиенте.Показать(ТекущиеДанные.ИгрокИлиМатч, СтандартнаяОбработка);
	Иначе
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИзображениеДефолт	= ИзображениеПолучить();
	
	Элементы.СтраницаНовости.Видимость = НаСервереПовторно.ЧтениеНовостей();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ДатыУстановить();
	МояКоманда		= МояКоманда();
	
	СписокОбновить();
	НовостиОбновить();
КонецПроцедуры

&НаСервере
Процедура НовостиУстановитьЗначениеПараметра(ПараметрИмя, Значение)
	Новости.Параметры.УстановитьЗначениеПараметра(ПараметрИмя, Значение);
КонецПроцедуры

&НаСервере
Процедура НовостиОбновитьНаСервере()
	Если Элементы.СтраницаНовости.Видимость Тогда
		Элементы.Период.Подсказка	= Строка(Период);

		НовостиУстановитьЗначениеПараметра("ДатаН",				Период.ДатаНачала);
		НовостиУстановитьЗначениеПараметра("ДатаК",				Период.ДатаОкончания);
		НовостиУстановитьЗначениеПараметра("МояКоманда",		Обернуть(МояКоманда));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиОбновить() Экспорт
	НовостиОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаНовостиОбновить(Команда)
	НовостиОбновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьПровестиНаСервере(Ссылка)
	Если НЕ Ссылка.Проведен Тогда
		Попытка
			Док	= Ссылка.ПолучитьОбъект();
			Док.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Ссылка);
			Возврат Ложь;
		КонецПопытки;
	КонецЕсли;
	Возврат Истина
КонецФункции

&НаКлиенте
Процедура НовостьПровести() Экспорт
	Если ЗначениеЗаполнено(НовостьТекущая)
	И Элементы.Новости.ТекущиеДанные <> Неопределено
	И Элементы.Новости.ТекущиеДанные.Свойство("Ссылка")
	И Элементы.Новости.ТекущиеДанные.Ссылка = НовостьТекущая
	И НовостьПровестиНаСервере(НовостьТекущая)
	Тогда
		Элементы.Новости.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НовостиПриАктивизацииСтроки(Элемент)
	Если Элементы.Новости.ТекущиеДанные = Неопределено Тогда
		Если ЗначениеЗаполнено(НовостьТекущая) Тогда
			НовостьТекущая	= Неопределено;
			Содержание.Удалить();
		КонецЕсли;
	Иначе
		Если Элементы.Новости.ТекущиеДанные.Свойство("Комментарий") Тогда
			ТекстУстановитьНаСервере(Содержание, Элементы.Новости.ТекущиеДанные.Комментарий);
		КонецЕсли;
		Если Элементы.Новости.ТекущиеДанные.Свойство("Ссылка") Тогда
			НовостьТекущая	= Элементы.Новости.ТекущиеДанные.Ссылка;
			ПодключитьОбработчикОжидания("НовостьПровести", 3, Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ТекстУстановитьНаСервере(Содержание, Знач Комментарий)
	Содержание.Удалить();
	УРЛ = СерверныйФункции.КомментарийКакУРЛ(Комментарий, Истина);
	Комментарий = СтрЗаменить(Комментарий, Символы.ПС, "<br>");
	Содержание.УстановитьHTML(Комментарий, Новый Структура);
КонецПроцедуры

&НаСервереБезКонтекста
Функция НовостьУдалитьНаСервере(Ссылка)
	Ответ = Ложь;
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.Новости") Тогда
		Попытка
			Док = Ссылка.ПолучитьОбъект();
			Док.УстановитьПометкуУдаления(Истина);
			Ответ = Истина;
		Исключение КонецПопытки;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("Массив") Тогда
		Для Каждого Документ Из Ссылка Цикл
			Ответ = Макс(Ответ, НовостьУдалитьНаСервере(Документ));
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаКлиенте
Процедура НовостьУдалить()
	Если Элементы.Новости.ТекущиеДанные <> Неопределено
	И Элементы.Новости.ТекущиеДанные.Свойство("Ссылка")
	Тогда
		НовостьТекущая	= Неопределено;
		Содержание.Удалить();
		Если Элементы.Новости.ВыделенныеСтроки.Количество() = 1 Тогда
			Если НовостьУдалитьНаСервере(Элементы.Новости.ТекущиеДанные.Ссылка) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		Иначе
			Результат = Новый Массив;
			Для Каждого Проверка Из Элементы.Новости.ВыделенныеСтроки Цикл
				ДанныеПроверки = Элементы.Новости.ДанныеСтроки(Проверка);
				Если ДанныеПроверки = Неопределено Тогда
					//
				ИначеЕсли Результат.Найти(ДанныеПроверки.Ссылка) = Неопределено Тогда
					Результат.Добавить(ДанныеПроверки.Ссылка);
				КонецЕсли;
			КонецЦикла;
			Если НовостьУдалитьНаСервере(Результат) Тогда
				Элементы.Новости.Обновить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаУдалить(Команда)
	НовостьУдалить();
КонецПроцедуры
