
&НаСервере
Процедура СформироватьНаСервере()
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать();
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиДефолт();
	Сформировать();
	ВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Матчи") = 0 Тогда
		Сформировать();
	ИначеЕсли Отчет.Регистраторы.НайтиПоЗначению(Параметр) = Неопределено Тогда
		//
	Иначе
		Сформировать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиДефолт()
	Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Отчет.Чемпионат = СерверныйФункции.ЧемпионатПолучитьПоследнее();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьРазницуМячейПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить()
	Элементы.ПоказыватьРазницуМячей.Видимость = (НЕ СерверныйФункции.ТурнирнаяТаблицаКакНаBBC());
КонецПроцедуры
