
&НаСервере
Процедура СформироватьНаСервере()
	ЭтаФорма.Результат = Отчеты.ТурнирнаяТаблица.ОтчетСформировать(Отчет.Чемпионат, Отчет.ПоказыватьРазницуМячей);
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиДефолт();
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "СписокМатчиОбновить" Тогда
		Сформировать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиДефолт()
	Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Чемпионаты = Справочники.Чемпионаты.Выбрать();
		Если Чемпионаты.Следующий() Тогда
			Отчет.Чемпионат = Чемпионаты.Ссылка;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
