
&НаСервере
Процедура СформироватьНаСервере()
	Если НастройкиУстановить() Тогда
		Попытка
			СкомпоноватьРезультат();
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Функция НастройкаПолучить(Имя="Команда")
	Ответ = Новый Структура("Значение");
	Для Каждого Настройка Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если СтрСравнить(Настройка.Параметр, Имя) = 0 Тогда
			Ответ	= Настройка;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция НастройкиУстановить()
	Настройка	= НастройкаПолучить();
	Если НЕ ЗначениеЗаполнено(Настройка.Значение) Тогда
		Настройка.Значение = МояКомандаПолучить();
	КонецЕсли;
	Возврат ЗначениеЗаполнено(Настройка.Значение);
КонецФункции

&НаСервереБезКонтекста
Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Настройка	= НастройкаПолучить();
	Команда		= Настройка.Значение;
КонецПроцедуры
