
&НаСервере
Процедура СформироватьНаСервере()
	Попытка
		СкомпоноватьРезультат();
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Команда) Тогда
		Команда = МояКоманда();
	КонецЕсли;
	НастройкиУстановить();
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиУстановить()
	Для Каждого Настройка Из Отчет.КомпоновщикНастроек.ФиксированныеНастройки.ПараметрыДанных.Элементы Цикл
		Если СтрСравнить(Настройка.Параметр, "Команда") = 0 Тогда
			Настройка.Значение = Команда;
		ИначеЕсли СтрСравнить(Настройка.Параметр, "ТолькоТекущийЧемпионат") = 0 Тогда
			Настройка.Значение = ТолькоТекущийЧемпионат;
		КонецЕсли;
		Настройка.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаКлиенте
Процедура РеквизитПриИзменении(Элемент)
	НастройкиУстановить();
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеВариантаНаСервере(Настройки)
	НастройкиУстановить();
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Если ЗначениеЗаполнено(Параметры.Команда) Тогда
			Команда		= Параметры.Команда;
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
