
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период
		                      |ИЗ
		                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                      |ГДЕ
		                      |	ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ЛОЖЬ");
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Период = Дата(Год(Выборка.Период), ?(Месяц(Выборка.Период)<8, 1, 8), 1);
		Иначе
			Период = Дата(Год(ТекущаяДатаСеанса()), ?(Месяц(ТекущаяДатаСеанса())<8, 1, 8), 1);
		КонецЕсли;
		
		Для Каждого Запись Из ЭтотОбъект Цикл
			Запись.Период = Период;
			Если ТипЗнч(ДанныеЗаполнения.Свойство("Игрок")) = Тип("СправочникСсылка.Игроки")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Игрок.Амплуа)
			Тогда
				Запись.Амплуа	= ДанныеЗаполнения.Игрок.Амплуа;
			КонецЕсли;
			Если ТипЗнч(ДанныеЗаполнения.Свойство("Команда")) = Тип("СправочникСсылка.Команды")
			И ЗначениеЗаполнено(ДанныеЗаполнения.Команда)
			Тогда
				Запись.Команда	= ДанныеЗаполнения.Команда;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)
	Если Замещение Тогда Возврат; КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если ЗначениеЗаполнено(Запись.Амплуа)
		И НЕ ЗначениеЗаполнено(Запись.Игрок.Амплуа)
		Тогда
			тОбъект = Запись.Игрок.ПолучитьОбъект();
			тОбъект.Амплуа	= Запись.Амплуа;
			тОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	Если Замещение Тогда Возврат; КонецЕсли;
	Для Каждого Запись Из ЭтотОбъект Цикл
		Если НЕ ЗначениеЗаполнено(Запись.Команда) И Запись.Номер > 0 Тогда
			Запись.Номер = 0;
		КонецЕсли;
		Запись.Комментарий	= СокрЛП(Лев(Запись.Комментарий, 10000));
	КонецЦикла;
КонецПроцедуры
