
&НаСервере
Процедура СформироватьНаСервере()
	График.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	МатчСоставыКоманд.Игрок.Амплуа КАК Амплуа,
	      	               |	МатчСоставыКоманд.Игрок КАК Серия,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) КАК Количество
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И МатчСоставыКоманд.Команда = &Команда
	      	               |	И МатчСоставыКоманд.Ссылка.Проведен = ИСТИНА
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	МатчСоставыКоманд.Игрок.Амплуа,
	      	               |	МатчСоставыКоманд.Игрок
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Амплуа,
	      	               |	Количество УБЫВ
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Выборка	= Запрос.Выполнить().Выбрать();
	Точка	= График.УстановитьТочку("");
	Пока Выборка.Следующий() Цикл
		Серия	= График.УстановитьСерию(Выборка.Серия);
		Серия.Расшифровка = Выборка.Серия;
		График.УстановитьЗначение(Точка, Серия, Выборка.Количество);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Отчет.Команда = Параметры.Команда;
		ЧемпионатыЗагрузить();
		Если Чемпионаты.Количество() = 0 Тогда
			Отказ = Истина;
		Иначе
			Отчет.Чемпионат = Чемпионаты.Получить(0).Значение;
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Команда);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузить()
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
	      	               |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Команда = &Команда
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ");
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Чемпионаты.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ЧемпионатыЗагрузить();
КонецПроцедуры
