
&НаСервере
Процедура СформироватьНаСервере()
	График.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	МатчСоставыКоманд.Игрок.Амплуа КАК Амплуа,
	      	               |	МатчСоставыКоманд.Игрок КАК Серия,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) КАК Количество
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И МатчСоставыКоманд.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	МатчСоставыКоманд.Игрок.Амплуа,
	      	               |	МатчСоставыКоманд.Игрок
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Амплуа,
	      	               |	Серия
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если Отчет.ТипМатча = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Запрос.УстановитьПараметр("НомерСтроки",		Отчет.ТипМатча);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия	= График.УстановитьСерию(Выборка.Серия);
		Серия.Расшифровка = Выборка.Серия;
		График.УстановитьЗначение(График.УстановитьТочку(""), Серия, Выборка.Количество, Выборка.Серия);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Отчет.Команда = МояКомандаПолучить();
	КонецЕсли;
	КомандаПриИзменении();
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипМатча.СписокВыбора.Добавить(0, "Все");
	Элементы.ТипМатча.СписокВыбора.Добавить(1, "Домашние");
	Элементы.ТипМатча.СписокВыбора.Добавить(2, "Выезд");
	
	КлубыЗагрузить();
	Если Параметры.Свойство("Команда") Тогда
		Если Клубы.НайтиПоЗначению(Параметры.Команда) = Неопределено Тогда
			Отказ = Истина;
		Иначе
			Отчет.Команда = Параметры.Команда;
			ЧемпионатыЗагрузить();
			Если Чемпионаты.Количество() = 0 Тогда
				Отказ = Истина;
			Иначе
				Отчет.Чемпионат = Чемпионаты.Получить(0).Значение;
				ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Команда);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура КлубыЗагрузить()
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
	      	               |	ТурнирнаяТаблица.Тур.ДатаОкончания КАК ДатаОкончания,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда) КАК Количество
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |			ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	ТурнирнаяТаблица.Тур.ДатаОкончания
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ДатаОкончания УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Команда КАК Ссылка,
	      	               |	ЕСТЬNULL(Чемпионаты.Количество, 11) КАК Количество
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Чемпионаты КАК Чемпионаты
	      	               |			ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Чемпионат
	      	               |		ПО ПеремещенияИгроков.Команда = ЧемпионатыКоманды.Команда
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	      	               |		ПО ПеремещенияИгроков.Команда = Команды.Ссылка
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ПеремещенияИгроков.Команда,
	      	               |	Чемпионаты.Количество
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПеремещенияИгроков.Игрок) >= 11
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	МАКСИМУМ(ПеремещенияИгроков.Команда = &Команда) УБЫВ,
	      	               |	МИНИМУМ(ЧемпионатыКоманды.Команда ЕСТЬ NULL),
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Команда",			МояКомандаПолучить());
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Элементы.Команда.СписокВыбора.Количество() <= Выборка.Количество Тогда
			Элементы.Команда.СписокВыбора.Добавить(Выборка.Ссылка);
		КонецЕсли;
		Клубы.Добавить(Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузить()
	Чемпионаты.Очистить();
	Элементы.Чемпионат.СписокВыбора.Очистить();
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Ссылка
		      	               |ИЗ
		      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		      	               |ГДЕ
		      	               |	МатчСоставыКоманд.Команда = &Команда
		      	               |	И НЕ МатчСоставыКоманд.Ссылка.Тур.Ссылка ЕСТЬ NULL
		      	               |
		      	               |СГРУППИРОВАТЬ ПО
		      	               |	ТурнирнаяТаблица.Тур.Владелец
		      	               |
							   //|ИМЕЮЩИЕ
							   //|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) >= 2
							   //|
		      	               |УПОРЯДОЧИТЬ ПО
		      	               |	МАКСИМУМ(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ИСТИНА
		      	               |				ТОГДА НАЧАЛОПЕРИОДА(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания, ГОД)
		      	               |			ИНАЧЕ ТурнирнаяТаблица.Период
		      	               |		КОНЕЦ) УБЫВ,
		      	               |	Ссылка
		      	               |АВТОУПОРЯДОЧИВАНИЕ");
		Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Элементы.Чемпионат.СписокВыбора.Количество() < 11 Тогда
				Элементы.Чемпионат.СписокВыбора.Добавить(Выборка.Ссылка);
			КонецЕсли;
			Чемпионаты.Добавить(Выборка.Ссылка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент=Неопределено)
	Если Элемент <> Неопределено Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент=Неопределено)
	ЧемпионатыЗагрузить();
	Если Чемпионаты.НайтиПоЗначению(Отчет.Чемпионат) = Неопределено Тогда
		Отчет.Чемпионат = ?(Чемпионаты.Количество() = 0, Неопределено, Чемпионаты.Получить(0).Значение);
	КонецЕсли;
	ЧемпионатПриИзменении();
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Игроки") Тогда
		СтандартнаяОбработка = Ложь;
		Матчи = Новый СписокЗначений;
		Матчи.ЗагрузитьЗначения(МатчиПолучить(Новый Структура("Игрок,Чемпионат,НомерСтроки", Расшифровка, Отчет.Чемпионат, Отчет.ТипМатча)));
		Если Матчи.Количество() > 0 Тогда
			Матчи.Добавить(Расшифровка);
			Матчи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите матч");
		Иначе
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений")
	И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Игроки")
	Тогда
		ПараметрыКоманды = Новый Структура("Игрок", Элемент.Значение);
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			ПараметрыКоманды.Вставить("Команда", Отчет.Команда);
		КонецЕсли;
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Участие.Форма.ФормаОтчетаИгрок", ПараметрыКоманды);
	Иначе
		НаКлиенте.Показать(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МатчиПолучить(Данные)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	      	               |	МатчСоставыКоманд.Ссылка КАК Ссылка,
	      	               |	МатчСоставыКоманд.Ссылка.Дата КАК Дата
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |	И МатчСоставыКоманд.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Дата УБЫВ");
	Запрос.УстановитьПараметр("Игрок",				Данные.Игрок);
	Запрос.УстановитьПараметр("Чемпионат",			Данные.Чемпионат);
	Запрос.УстановитьПараметр("НомерСтроки",		Данные.НомерСтроки);
	Если Данные.НомерСтроки = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки", "");
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
