
&НаСервере
Процедура СформироватьНаСервере()
	График.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	МатчСоставыКоманд.Игрок.Амплуа КАК Амплуа,
	      	               |	МатчСоставыКоманд.Игрок КАК Серия,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) КАК Количество
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И МатчСоставыКоманд.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	МатчСоставыКоманд.Игрок.Амплуа,
	      	               |	МатчСоставыКоманд.Игрок
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Амплуа,
	      	               |	Количество УБЫВ
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если Отчет.ТипМатча = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки", "");
	КонецЕсли;
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Запрос.УстановитьПараметр("НомерСтроки",		Отчет.ТипМатча);
	Выборка	= Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Серия	= График.УстановитьСерию(Выборка.Серия);
		Серия.Расшифровка = Выборка.Серия;
		График.УстановитьЗначение(График.УстановитьТочку(""), Серия, Выборка.Количество, Выборка.Серия);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КомандаПриИзменении();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Элементы.ТипМатча.СписокВыбора.Добавить(0, "Все");
	Элементы.ТипМатча.СписокВыбора.Добавить(1, "Домашние");
	Элементы.ТипМатча.СписокВыбора.Добавить(2, "Выезд");
	
	Если Параметры.Свойство("Команда") Тогда
		Отчет.Команда = Параметры.Команда;
		ЧемпионатыЗагрузить();
		Если Чемпионаты.Количество() = 0 Тогда
			Отказ = Истина;
		Иначе
			Отчет.Чемпионат = Чемпионаты.Получить(0).Значение;
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Команда);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузить()
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат,
		      	               |	МАКСИМУМ(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ИСТИНА
		      	               |				ТОГДА НАЧАЛОПЕРИОДА(ТурнирнаяТаблица.Период, МЕСЯЦ)
		      	               |			ИНАЧЕ НАЧАЛОПЕРИОДА(ТурнирнаяТаблица.Период, ДЕНЬ)
		      	               |		КОНЕЦ) КАК Период
		      	               |ИЗ
		      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		      	               |ГДЕ
		      	               |	МатчСоставыКоманд.Команда = &Команда
		      	               |
		      	               |СГРУППИРОВАТЬ ПО
		      	               |	ТурнирнаяТаблица.Тур.Владелец
		      	               |
		      	               |ИМЕЮЩИЕ
		      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчСоставыКоманд.Ссылка) >= 2
		      	               |
		      	               |УПОРЯДОЧИТЬ ПО
		      	               |	Период УБЫВ");
		Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
		Чемпионаты.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	ИначеЕсли Чемпионаты.Количество() > 0 Тогда
		Чемпионаты.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент=Неопределено)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент=Неопределено)
	ЧемпионатыЗагрузить();
	Если Чемпионаты.НайтиПоЗначению(Отчет.Чемпионат) = Неопределено Тогда
		Отчет.Чемпионат = ?(Чемпионаты.Количество() = 0, Неопределено, Чемпионаты.Получить(0).Значение);
	КонецЕсли;
	ЧемпионатПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Игроки") Тогда
		СтандартнаяОбработка = Ложь;
		Матчи = Новый СписокЗначений;
		Матчи.ЗагрузитьЗначения(МатчиПолучить(Новый Структура("Игрок,Чемпионат,НомерСтроки", Расшифровка, Отчет.Чемпионат, Отчет.ТипМатча)));
		Если Матчи.Количество() = 1 Тогда
			ПослеВыбора(Матчи.Получить(0).Значение);
		ИначеЕсли Матчи.Количество() > 0 Тогда
			Матчи.Добавить(Расшифровка);
			Матчи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите матч");
		Иначе
			СтандартнаяОбработка = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаСервереБезКонтекста
Функция МатчиПолучить(Данные)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	      	               |	МатчСоставыКоманд.Ссылка КАК Ссылка,
	      	               |	МатчСоставыКоманд.Ссылка.Дата КАК Дата
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |	И МатчСоставыКоманд.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Дата УБЫВ");
	Запрос.УстановитьПараметр("Игрок",				Данные.Игрок);
	Запрос.УстановитьПараметр("Чемпионат",			Данные.Чемпионат);
	Запрос.УстановитьПараметр("НомерСтроки",		Данные.НомерСтроки);
	Если Данные.НомерСтроки = 0 Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ТурнирнаяТаблица.НомерСтроки = &НомерСтроки", "");
	КонецЕсли;
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
