
&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Город) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
		
		Если Элементы.График.Видимость Тогда
			График.Точки.Очистить();
			Для Каждого Детали Из Отчет.Данные Цикл
				Точка	= График.УстановитьТочку(Детали.Команда);
				УстановитьЗначение(Точка, 0, Детали.Проигрыш);
				УстановитьЗначение(Точка, 1, Детали.Ничья);
				УстановитьЗначение(Точка, 2, Детали.Выигрыш);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УстановитьЗначение(Точка, Серия, Значение)
	Если Значение > 0 Тогда
		График.УстановитьЗначение(Точка, График.Серии.Получить(Серия), Значение);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГородаЗаполнить()
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Города.Ссылка КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Города КАК Города
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	      	               |		ПО Города.Ссылка = Команды.Город
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Города.Ссылка
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Ссылка) >= 2");
	Города.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Город) Тогда
		Для Каждого Город Из Города Цикл
			Если СтрСравнить(Город.Значение, "Лондон") = 0 Тогда
				Отчет.Город	= Город.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Сформировать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Город") Тогда
		Отчет.Город	= Параметры.Город;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
	Иначе
		ГородаЗаполнить();
	КонецЕсли;
	
	СерииЗаполнить();
КонецПроцедуры

&НаСервере
Процедура СерииЗаполнить()
	СерверныйФункции.СерииЗаполнить(График);
КонецПроцедуры
