
&НаСервере
Процедура КомандыЗагрузить(Матч)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	МатчКоманды.Команда КАК Команда
	      	               |ИЗ
	      	               |	Документ.Матч.Команды КАК МатчКоманды
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Дерби КАК Дерби
	      	               |		ПО (МатчКоманды.Команда = Дерби.Команда
	      	               |				ИЛИ МатчКоманды.Команда = Дерби.Противник)
	      	               |ГДЕ
	      	               |	МатчКоманды.Ссылка = &Матч");
	Запрос.УстановитьПараметр("Матч",		Матч);
	Клубы.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Если Клубы.Количество() <> 2 Тогда
		Клубы.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция КомандыПолучить()
	Если ЗначениеЗаполнено(Город) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Команды.Ссылка КАК Команда
	      	               |ИЗ
	      	               |	Справочник.Команды КАК Команды
	      	               |ГДЕ
	      	               |	Команды.Город = &Город
	      	               |	И Команды.ПометкаУдаления = ЛОЖЬ
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Команда
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
		Запрос.УстановитьПараметр("Город",		Город);
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;
	Возврат Клубы.ВыгрузитьЗначения();
КонецФункции

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СформироватьНаСервере()
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет, КомандыПолучить());
	ГрафикОбновить();
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновить()
	ТипГрафикаУстановить();
	СерверныйФункции.ГрафикОбновить(График, Отчет.Данные);
КонецПроцедуры

&НаСервере
Процедура ГородаЗагрузить()
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Города.Ссылка КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Города КАК Города
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |			ПО Команды.Ссылка = ЧемпионатыКоманды.Команда
	      	               |		ПО Города.Ссылка = Команды.Город
	      	               |ГДЕ
	      	               |	Города.ПометкаУдаления = ЛОЖЬ
	      	               |	И Города.Владелец = ЧемпионатыКоманды.Ссылка.Владелец.Страна
	      	               |	И Команды.ПометкаУдаления = ЛОЖЬ
	      	               |	И (ЧемпионатыКоманды.Ссылка.ДатаОкончания, ЧемпионатыКоманды.Ссылка.Владелец) В
	      	               |			(ВЫБРАТЬ
	      	               |				МАКСИМУМ(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Период,
	      	               |				ТурнирнаяТаблица.Тур.Владелец.Владелец КАК ТурВладелец
	      	               |			ИЗ
	      	               |				РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |			ГДЕ
	      	               |				ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	      	               |				И (ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна.Ссылка ЕСТЬ NULL) = ЛОЖЬ
	      	               |			СГРУППИРОВАТЬ ПО
	      	               |				ТурнирнаяТаблица.Тур.Владелец.Владелец)
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Города.Ссылка
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Ссылка) >= 2");
	Города.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Город") И ЗначениеЗаполнено(Параметры.Город) Тогда
		Город	= Параметры.Город;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Город);
		//Заголовок	= "Дерби | Derby";
	ИначеЕсли Параметры.Свойство("Команды") Тогда
		Клубы.ЗагрузитьЗначения(Параметры.Команды);
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Город);
		Элементы.ГруппаПараметры.Видимость = Ложь;
		Заголовок	= "Дерби | Derby";
	ИначеЕсли Параметры.Свойство("Матч") Тогда
		КомандыЗагрузить(Параметры.Матч);
		Если Клубы.Количество() = 0 Тогда
			Отказ = Истина;
		Иначе
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Город);
			Элементы.ГруппаПараметры.Видимость = Ложь;
		КонецЕсли;
	Иначе
		ГородаЗагрузить();
	КонецЕсли;
	СерииЗаполнить();
	ТипГрафикаЗаполнить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Элементы.Город.Видимость Тогда
		ГородЗаполнить();
	КонецЕсли;
	//ТипГрафикаУстановить();
	Сформировать();
КонецПроцедуры

&НаСервере
Функция МойГород()
	Если НЕ ЗначениеЗаполнено(МойГород) Тогда
		МояКоманда	= СерверныйФункции.МояКомандаПолучить();
		МойГород	= ?(ЗначениеЗаполнено(МояКоманда), МояКоманда.Город, "Лондон");
	КонецЕсли;
	Возврат МойГород;
КонецФункции

&НаСервере
Процедура ГородЗаполнить(Второй=Ложь)
	Если НЕ ЗначениеЗаполнено(Город) Тогда
		Для Каждого Сити Из Города Цикл
			Если Второй Или СтрСравнить(Сити.Значение, МойГород()) = 0 Тогда
				Город	= Сити.Значение;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ Второй Тогда
			ГородЗаполнить(Истина);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМатча(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы) = Тип("ЗначениеДиаграммы") Тогда
		СтандартнаяОбработка	= Ложь;
		Матчи	= МатчиПолучить(Новый Структура("Команда,Результат", ЗначениеДиаграммы.Точка.Значение, ЗначениеДиаграммы.Серия.Значение));
		Если Матчи.Количество() = 1 Тогда
			ПослеВыбораМатча(Матчи.Получить(0));
		ИначеЕсли Матчи.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораМатча", ЭтотОбъект), Матчи);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Отбор)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Регистратор КАК Значение,
	      	               |	Матч.Счет КАК Представление,
	      	               |	ТурнирнаяТаблица.Период КАК Период
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матчи
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Регистратор
	      	               |			И ТурнирнаяТаблица.НомерСтроки <> Матчи.НомерСтроки
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.КоличествоОчков = &КоличествоОчков
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |	И Матчи.Команда В(&Команды)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ");
	Запрос.УстановитьПараметр("Команды",			Отчет.Данные.Выгрузить().ВыгрузитьКолонку("Команда"));
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",			Отбор.Команда);
	Запрос.УстановитьПараметр("КоличествоОчков",	?(СтрСравнить(Отбор.Результат, "Проигрыш")=0, 0, 1));
	Если СтрСравнить(Отбор.Результат, "Выигрыш") = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		               |	Матч.Счет КАК Представление,
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Матчи
		               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Регистратор
		               |			И ТурнирнаяТаблица.НомерСтроки <> Матчи.НомерСтроки
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.КоличествоОчков >= 2
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Матчи.Команда В(&Команды)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
	КонецЕсли;
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Процедура ТипГрафикаЗаполнить()
	Элементы.ТипГрафика.СписокВыбора.Добавить(0, "Гистограмма с накоплением");
	Элементы.ТипГрафика.СписокВыбора.Добавить(1, "Радарный график с областями и накоплением");
КонецПроцедуры

&НаСервере
Процедура ТипГрафикаУстановить()
	Если ТипГрафика = 1 Тогда
		ОбщегоНазначения.УстановитьЗначение(График.ТипДиаграммы, ТипДиаграммы.РадарныйГрафикСОбластямиИНакоплением);
	Иначе
		ОбщегоНазначения.УстановитьЗначение(График.ТипДиаграммы, ТипДиаграммы.ГистограммаСНакоплением);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.Город.Видимость Тогда
		ПроверяемыеРеквизиты.Добавить("Город");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СерииЗаполнить()
	СерверныйФункции.СерииЗаполнить(График);
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафика() Экспорт
	ТипГрафикаУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ТипГрафикаПриИзменении(Элемент)
	ПодключитьОбработчикОжидания("ТипГрафика", 0.1, Истина);
КонецПроцедуры
