
&НаКлиенте
Процедура КомандаДербиОтчет(Команда)
	Если Элементы.Список.ТекущиеДанные = Неопределено Тогда
		ОткрытьФорму("Отчет.Дерби.Форма");
	Иначе
		ДанныеЗаполнения = Новый Массив;
		ДанныеЗаполнения.Добавить(Элементы.Список.ТекущиеДанные.Команда);
		ДанныеЗаполнения.Добавить(Элементы.Список.ТекущиеДанные.Противник);
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Дерби.Форма", Новый Структура("Команды", ДанныеЗаполнения), ЭтаФорма);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ФормаКоманднаяПанель);
	КонецЕсли;
КонецПроцедуры
