
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет, ПоказыватьТолькоЗабитыеМячи, Топ6);
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатПриИзмененииНаСервере()
	Победа	= 0;
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(КомандыЧемпионата());
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			Если Элементы.Команда.СписокВыбора.НайтиПоЗначению(Отчет.Команда) = Неопределено Тогда
				Отчет.Команда	= Неопределено;
			КонецЕсли;
		Иначе
			Команда	= МояКоманда();
			Если Элементы.Команда.СписокВыбора.НайтиПоЗначению(Команда) = Неопределено Тогда
				//
			Иначе
				Отчет.Команда	= Команда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Противник.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент=Неопределено)
	ЧемпионатПриИзмененииНаСервере();
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ПротивникиЗагрузить()
	Элементы.Противник.СписокВыбора.Очистить();
	Для Каждого Детали Из Отчет.Данные Цикл
		Если Детали.Выигрыш > 0 Или Детали.Проигрыш > 0 Или Детали.Ничья > 0 Тогда
			Элемент = Элементы.Команда.СписокВыбора.НайтиПоЗначению(Детали.Команда);
			Если Элемент = Неопределено Тогда
				//
			Иначе
				Элементы.Противник.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление,, Элемент.Картинка);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Элементы.Противник.СписокВыбора.СортироватьПоЗначению();
	Если ЗначениеЗаполнено(Противник) Тогда
		Если Элементы.Противник.СписокВыбора.НайтиПоЗначению(Противник) = Неопределено Тогда
			Противник = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновить()
	Если Элементы.ГруппаГрафики.Видимость Тогда
		СерверныйФункции.ГрафикОбновить(График, Отчет.Данные, НЕ ПоказыватьТолькоЗабитыеМячи);
		Если НЕ Элементы.ГруппаПараметры.Видимость Тогда
			ОбщегоНазначения.УстановитьЗначение(График.ОбластьЗаголовка.Текст, Отчет.Команда.ПолноеНаименование());
		КонецЕсли;
		
		ПротивникиЗагрузить();
		ГрафикПерсональныйОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиДефолт()
	Если НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Команда	= МояКоманда();
			КомандыЧемпионата = КомандыЧемпионата();
			Если КомандыЧемпионата.Найти(Команда) = Неопределено Тогда
				Если КомандыЧемпионата.Количество() > 0 Тогда
					Отчет.Команда	= КомандыЧемпионата.Получить(0);
				КонецЕсли;
			Иначе
				Отчет.Команда	= Команда;
			КонецЕсли;
		Иначе
			Отчет.Команда	= МояКоманда();
			Отчет.Чемпионат	= ЧемпионатПолучить(Отчет.Команда);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Отчет.Команда	= Параметры.Команда;
		Если Параметры.Свойство("Чемпионат") Тогда
			Отчет.Чемпионат	= Параметры.Чемпионат;
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Иначе
			Элементы.Чемпионат.СписокВыбора.ЗагрузитьЗначения(ЧемпионатыКоманды(Отчет.Команда));
			Если Элементы.Чемпионат.СписокВыбора.Количество() = 0 Тогда
				Отчет.Чемпионат	= ЧемпионатПолучить(Отчет.Команда);
				ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
			Иначе
				Элементы.Чемпионат.РежимВыбораИзСписка = Истина;
				Отчет.Чемпионат	= Элементы.Чемпионат.СписокВыбора.Получить(0).Значение;
				ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Команда);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если Параметры.Свойство("График") Тогда
		//
	Иначе
		Элементы.ГруппаГрафики.Видимость	= Ложь;
	КонецЕсли;
	Если Элементы.ГруппаГрафики.Видимость Тогда
		СерверныйФункции.СерииЗаполнить(ГрафикПерсональный);
	КонецЕсли;
	ПоказыватьТолькоЗабитыеМячи	= ПоказыватьТолькоЗабитыеМячи();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиДефолт();
	ЧемпионатПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМатча(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент, ПараметрКоманды);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы) = Тип("ЗначениеДиаграммы") Тогда
		Матчи	= МатчиПолучить(Новый Структура("Команда,Результат", ЗначениеДиаграммы.Точка.Значение, ЗначениеДиаграммы.Серия.Значение));
		Если Матчи.Количество() = 1 Тогда
			ПослеВыбораМатча(Матчи.Получить(0), СтандартнаяОбработка);
		ИначеЕсли Матчи.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораМатча", ЭтотОбъект, СтандартнаяОбработка), Матчи);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Справочник.Команды.Форма.ФормаВыбораЧемпионат", Новый Структура("Чемпионат", Отчет.Чемпионат), Элемент, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Отбор)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
	      	               |	ТурнирнаяТаблица.Регистратор КАК Значение,
	      	               |	Матчи.Ссылка.Счет КАК Представление,
	      	               |	ТурнирнаяТаблица.Период КАК Период
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Матчи
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.КоличествоОчков = &КоличествоОчков
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |	И Матчи.Команда = &Противник
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Противник",			Отбор.Команда);
	Запрос.УстановитьПараметр("КоличествоОчков",	?(СтрСравнить(Отбор.Результат, "Проигрыш")=0, 0, 1));
	Если СтрСравнить(Отбор.Результат, "Выигрыш") = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		               |	Матчи.Ссылка.Счет КАК Представление,
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Матчи
		               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.КоличествоОчков >= 2
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Матчи.Команда = &Противник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
	ИначеЕсли СтрСравнить(Отбор.Результат, "Забито") = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		               |	Матчи.Ссылка.Счет КАК Представление,
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Матчи
		               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.КоличествоГолов >= 1
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Матчи.Команда = &Противник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
	ИначеЕсли СтрСравнить(Отбор.Результат, "Пропущено") = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
		               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		               |	Матчи.Ссылка.Счет КАК Представление,
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Матчи
		               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Матчи.Команда = &Противник
		               |	И Матчи.КоличествоГолов >= 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
	КонецЕсли;
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция КомандыЧемпионата()
	Возврат СерверныйФункции.КомандыЧемпионата(Отчет.Чемпионат);
КонецФункции

&НаСервереБезКонтекста
Функция ЧемпионатПолучить(Команда)
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее(Команда);
КонецФункции

&НаСервереБезКонтекста
Функция ЧемпионатыКоманды(Команда)
	Возврат СерверныйФункции.ЧемпионатыКоманды(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") И Параметр = Отчет.Чемпионат Тогда
		ПодключитьОбработчикОжидания("КомандаСформировать", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать() Экспорт
	Сформировать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказыватьТолькоЗабитыеМячи()
	Возврат НаСервереПовторно.ПоказыватьРазницуМячей();
КонецФункции

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура ГрафикПерсональныйОбновить()
	ГрафикПерсональный.Очистить();
	Если ЗначениеЗаполнено(Противник) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	&Противник КАК Команда,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Проигрыш,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Ничья,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА Противник.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Выигрыш,
		      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		      	               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
		      	               |ИЗ
		      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		      	               |ГДЕ
		      	               |	ТурнирнаяТаблица.Команда = &Команда
		      	               |	И Противник.Команда = &Противник");
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	&Противник КАК Команда,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Проигрыш,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Ничья,
			               |	СУММА(ВЫБОР
			               |			КОГДА Противник.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Выигрыш,
			               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
			               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |ГДЕ
			               |	Противник.Команда = &Противник
			               |	И ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат";
		КонецЕсли;
	Иначе
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Проигрыш,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Ничья,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА Противник.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Выигрыш,
		      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		      	               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
		      	               |ИЗ
		      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		      	               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		      	               |ГДЕ
		      	               |	ТурнирнаяТаблица.Команда = &Команда
		      	               |	И ТурнирнаяТаблица.Команда.Город.Владелец = ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна
		      	               |	И ВЫБОР
		      	               |			КОГДА &Топ6 = ИСТИНА
		      	               |				ТОГДА Противник.Команда В
		      	               |						(ВЫБРАТЬ
		      	               |							ЛигаКоманды.Команда
		      	               |						ИЗ
		      	               |							Справочник.Лига.Команды КАК ЛигаКоманды)
		      	               |			ИНАЧЕ ИСТИНА
		      	               |		КОНЕЦ
		      	               |
		      	               |ИМЕЮЩИЕ
		      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 1");
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Проигрыш,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Ничья,
			               |	СУММА(ВЫБОР
			               |			КОГДА Противник.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Выигрыш,
			               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
			               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
			               |ГДЕ
			               |	ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
			               |	И ВЫБОР
			               |			КОГДА &Топ6 = ИСТИНА
			               |				ТОГДА Противник.Команда В
			               |						(ВЫБРАТЬ
			               |							ЛигаКоманды.Команда
			               |						ИЗ
			               |							Справочник.Лига.Команды КАК ЛигаКоманды)
			               |			ИНАЧЕ ИСТИНА
			               |		КОНЕЦ";
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
	Запрос.УстановитьПараметр("Противник",		Противник);
	Запрос.УстановитьПараметр("Топ6",			Топ6);
	СерверныйФункции.ГрафикОбновить(ГрафикПерсональный, Запрос.Выполнить().Выгрузить(), НЕ ПоказыватьТолькоЗабитыеМячи);
	//Если ЗначениеЗаполнено(Противник) Тогда
	//	Для Каждого Элемент Из ГрафикПерсональный.Точки Цикл
	//		Элемент.Расшифровка = Противник;
	//	КонецЦикла;
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПротивникПриИзменении(Элемент)
	ГрафикПерсональныйОбновить();
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Элементы.ГруппаГрафики.ТекущаяСтраница = Элементы.ГруппаПерсональный
	И ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды")
	Тогда
		СтандартнаяОбработка	= Ложь;
		Противник				= Расшифровка;
		ГрафикПерсональныйОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПерсональныйОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если ТипЗнч(Расшифровка) = Тип("Число") Тогда
		Матчи = МатчиПолучитьПоследнее(Расшифровка);
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("ЗначениеДиаграммы") Тогда
		Матчи = МатчиПолучитьПоследнее(Расшифровка.Значение);
	Иначе
		Матчи = Новый Соответствие;
	КонецЕсли;
	Если Матчи.Количество() = 1 Тогда
		ПослеВыбораМатча(Матчи.Получить(0));
	ИначеЕсли Матчи.Количество() > 0 Тогда
		ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораМатча", ЭтотОбъект), Матчи);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучитьПоследнее(Отбор)
	Ответ	= Новый СписокЗначений;
	Если ЗначениеЗаполнено(Противник) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 10
		      	               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		      	               |	ТурнирнаяТаблица.Регистратор.Счет КАК Представление,
		      	               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		      	               |		И НЕ Лиги.Ссылка ЕСТЬ NULL КАК Пометка,
		      	               |	ТурнирнаяТаблица.Период КАК Период
		      	               |ИЗ
		      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		      	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		      	               |			Чемпионаты.Владелец КАК Ссылка
		      	               |		ИЗ
		      	               |			Справочник.Чемпионаты КАК Чемпионаты
		      	               |		ГДЕ
		      	               |			Чемпионаты.Ссылка = &Чемпионат) КАК Лиги
		      	               |		ПО ТурнирнаяТаблица.Тур.Владелец.Владелец = Лиги.Ссылка
		      	               |ГДЕ
		      	               |	ТурнирнаяТаблица.Команда = &Команда
		      	               |	И ТурнирнаяТаблица.КоличествоГолов >= 1
		      	               |	И Противник.Команда = &Противник
		      	               |
		      	               |УПОРЯДОЧИТЬ ПО
		      	               |	Период УБЫВ,
		      	               |	Пометка УБЫВ");
		Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
		Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
		Запрос.УстановитьПараметр("Противник",		Противник);
		
		Если ПоказыватьТолькоЗабитыеМячи Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
			               |	ТурнирнаяТаблица.Регистратор КАК Значение,
			               |	ТурнирнаяТаблица.Регистратор.Счет КАК Представление,
			               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
			               |		И НЕ Лиги.Ссылка ЕСТЬ NULL КАК Пометка,
			               |	ТурнирнаяТаблица.Период КАК Период
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
			               |			Чемпионаты.Владелец КАК Ссылка
			               |		ИЗ
			               |			Справочник.Чемпионаты КАК Чемпионаты
			               |		ГДЕ
			               |			Чемпионаты.Ссылка = &Чемпионат) КАК Лиги
			               |		ПО ТурнирнаяТаблица.Тур.Владелец.Владелец = Лиги.Ссылка
			               |ГДЕ
			               |	ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.КоличествоОчков = &Количество
			               |	И Противник.Команда = &Противник
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Период УБЫВ,
			               |	Пометка УБЫВ";
			Запрос.УстановитьПараметр("Количество",		?(Отбор > 1, Победа(), Отбор));
		ИначеЕсли Отбор > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТурнирнаяТаблица.КоличествоГолов", "Противник.КоличествоГолов");
		КонецЕсли;
		//Ответ.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Значение"));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.Пометка Тогда
				Ответ.Добавить(Выборка.Значение, Выборка.Представление,, СерверныйФункции.ИзображениеПолучить(Отчет.Команда, Истина));
			Иначе
				Ответ.Добавить(Выборка.Значение);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция Победа()
	Если Победа = 0 Тогда
		Победа = Справочники.ВидыСпорта.Победа(Отчет.Команда);
	КонецЕсли;
	Возврат Победа;
КонецФункции

&НаКлиенте
Процедура ЧемпионатОчистка(Элемент, СтандартнаяОбработка)
	Победа	= 0;
КонецПроцедуры
