
&НаСервере
Процедура СформироватьНаСервере()
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет, ПоказыватьТолькоЗабитыеМячи);
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		СтандартнаяОбработка	= Ложь;
		ОткрытьФорму("Справочник.Команды.Форма.ФормаВыбораЧемпионат", Новый Структура("Чемпионат", Отчет.Чемпионат), Элемент);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЧемпионатПриИзмененииНаСервере()
	Победа	= 0;
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(КомандыЧемпионата());
		Если ЗначениеЗаполнено(Отчет.Команда) Тогда
			Если Элементы.Команда.СписокВыбора.НайтиПоЗначению(Отчет.Команда) = Неопределено Тогда
				Отчет.Команда	= Неопределено;
			КонецЕсли;
		Иначе
			Команда	= МояКоманда();
			Если Элементы.Команда.СписокВыбора.НайтиПоЗначению(Команда) = Неопределено Тогда
				//
			Иначе
				Отчет.Команда	= Команда;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент=Неопределено)
	ЧемпионатПриИзмененииНаСервере();
	ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ПротивникиЗагрузить()
	Элементы.Противник.СписокВыбора.Очистить();
	Для Каждого Детали Из Отчет.Данные Цикл
		Если Детали.Выигрыш > 0 Или Детали.Проигрыш > 0 Или Детали.Ничья > 0 Тогда
			Элемент = Элементы.Команда.СписокВыбора.НайтиПоЗначению(Детали.Команда);
			Элементы.Противник.СписокВыбора.Добавить(Элемент.Значение, Элемент.Представление,, Элемент.Картинка);
		КонецЕсли;
	КонецЦикла;
	Элементы.Противник.СписокВыбора.СортироватьПоЗначению();
	Если ЗначениеЗаполнено(Противник) Тогда
		Если Элементы.Противник.СписокВыбора.НайтиПоЗначению(Противник) = Неопределено Тогда
			Противник = Неопределено;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновить()
	Если Элементы.ГруппаГрафики.Видимость Тогда
		СерверныйФункции.ГрафикОбновить(График, Отчет.Данные, НЕ ПоказыватьТолькоЗабитыеМячи);
		
		ПротивникиЗагрузить();
		ГрафикПерсональныйОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиДефолт()
	Если НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Команда	= МояКоманда();
			КомандыЧемпионата = КомандыЧемпионата();
			Если КомандыЧемпионата.Найти(Команда) = Неопределено Тогда
				Если КомандыЧемпионата.Количество() > 0 Тогда
					Отчет.Команда	= КомандыЧемпионата.Получить(0);
				КонецЕсли;
			Иначе
				Отчет.Команда	= Команда;
			КонецЕсли;
		Иначе
			Отчет.Команда	= МояКоманда();
			Отчет.Чемпионат	= ЧемпионатПолучить(Отчет.Команда);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Отчет.Команда	= Параметры.Команда;
		Если Параметры.Свойство("Чемпионат") Тогда
			Отчет.Чемпионат	= Параметры.Чемпионат;
		Иначе
			Отчет.Чемпионат	= ЧемпионатПолучить(Параметры.Команда);
		КонецЕсли;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
	КонецЕсли;
	Если Параметры.Свойство("График") Тогда
		//
	Иначе
		Элементы.ГруппаГрафики.Видимость	= Ложь;
	КонецЕсли;
	Если Элементы.ГруппаГрафики.Видимость Тогда
		СерверныйФункции.СерииЗаполнить(ГрафикПерсональный);
	КонецЕсли;
	ПоказыватьТолькоЗабитыеМячи	= ПоказыватьТолькоЗабитыеМячи();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	НастройкиДефолт();
	ЧемпионатПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ПослеВыбораМатча(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	СтандартнаяОбработка	= Ложь;
	Если ТипЗнч(ЗначениеДиаграммы) = Тип("ЗначениеДиаграммы") Тогда
		Матчи	= МатчиПолучить(Новый Структура("Команда,Результат", ЗначениеДиаграммы.Точка.Значение, ЗначениеДиаграммы.Серия.Значение));
		Если Матчи.Количество() = 1 Тогда
			ПослеВыбораМатча(Матчи.Получить(0));
		ИначеЕсли Матчи.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораМатча", ЭтотОбъект), Матчи);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Отбор)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Регистратор КАК Значение,
	      	               |	Матчи.Ссылка.Счет КАК Представление,
	      	               |	ТурнирнаяТаблица.Период КАК Период
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Матчи
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.КоличествоОчков = &КоличествоОчков
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |	И Матчи.Команда = &Противник
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",			Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Противник",			Отбор.Команда);
	Запрос.УстановитьПараметр("КоличествоОчков",	?(СтрСравнить(Отбор.Результат, "Проигрыш")=0, 0, 1));
	Если СтрСравнить(Отбор.Результат, "Выигрыш") = 0 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТурнирнаяТаблица.Регистратор КАК Значение,
		               |	Матчи.Ссылка.Счет КАК Представление,
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матчи
		               |		ПО ТурнирнаяТаблица.Регистратор = Матчи.Ссылка
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Команда
		               |	И ТурнирнаяТаблица.КоличествоОчков >= 2
		               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И Матчи.Команды.Команда = &Противник
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период УБЫВ";
	КонецЕсли;
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция КомандыЧемпионата()
	Возврат СерверныйФункции.КомандыЧемпионата(Отчет.Чемпионат);
КонецФункции

&НаСервере
Функция ЧемпионатПолучить(Команда)
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее(Команда);
КонецФункции

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") И Параметр = Отчет.Чемпионат Тогда
		ПодключитьОбработчикОжидания("КомандаСформировать", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСформировать() Экспорт
	Сформировать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПоказыватьТолькоЗабитыеМячи()
	Возврат СерверныйФункции.ПоказыватьРазницуМячей();
КонецФункции

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура ГрафикПерсональныйОбновить()
	ГрафикПерсональный.Очистить();
	Если ЗначениеЗаполнено(Противник) Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	Противник.Команда КАК Команда,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Проигрыш,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 1
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Ничья,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА Противник.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Выигрыш,
		      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		      	               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
		      	               |ИЗ
		      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		      	               |ГДЕ
		      	               |	ТурнирнаяТаблица.Команда = &Команда
		      	               |	И Противник.Команда = &Противник
		      	               |
		      	               |СГРУППИРОВАТЬ ПО
		      	               |	Противник.Команда");
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Противник.Команда КАК Команда,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Проигрыш,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 1
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Ничья,
			               |	СУММА(ВЫБОР
			               |			КОГДА Противник.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Выигрыш,
			               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
			               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |ГДЕ
			               |	Противник.Команда = &Противник
			               |	И ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	Противник.Команда";
		КонецЕсли;
	Иначе
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	NULL КАК Команда,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Проигрыш,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 1
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Ничья,
		      	               |	СУММА(ВЫБОР
		      	               |			КОГДА Противник.КоличествоОчков = 0
		      	               |				ТОГДА 1
		      	               |			ИНАЧЕ 0
		      	               |		КОНЕЦ) КАК Выигрыш,
		      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
		      	               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
		      	               |ИЗ
		      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		      	               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
		      	               |ГДЕ
		      	               |	ТурнирнаяТаблица.Команда = &Команда
		      	               |	И ТурнирнаяТаблица.Команда.Город.Владелец = ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна
		      	               |
		      	               |ИМЕЮЩИЕ
		      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= 1");
		Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	NULL КАК Команда,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Проигрыш,
			               |	СУММА(ВЫБОР
			               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 1
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Ничья,
			               |	СУММА(ВЫБОР
			               |			КОГДА Противник.КоличествоОчков = 0
			               |				ТОГДА 1
			               |			ИНАЧЕ 0
			               |		КОНЕЦ) КАК Выигрыш,
			               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
			               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
			               |ГДЕ
			               |	ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат";
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
	Запрос.УстановитьПараметр("Противник",		Противник);
	СерверныйФункции.ГрафикОбновить(ГрафикПерсональный, Запрос.Выполнить().Выгрузить(), НЕ ПоказыватьТолькоЗабитыеМячи);
КонецПроцедуры

&НаКлиенте
Процедура ПротивникПриИзменении(Элемент)
	ГрафикПерсональныйОбновить();
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	Если Элементы.ГруппаГрафики.ТекущаяСтраница = Элементы.ГруппаПерсональный
	И ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды")
	Тогда
		СтандартнаяОбработка	= Ложь;
		Противник				= Расшифровка;
		ГрафикПерсональныйОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикПерсональныйОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		
		Матчи = МатчиПолучитьПоследнее(Расшифровка);
		Если Матчи.Количество() > 0 Тогда
			Игры	= Новый СписокЗначений;
			Игры.ЗагрузитьЗначения(Матчи);
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбораМатча", ЭтотОбъект), Игры);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучитьПоследнее(Отбор)
	Если ЗначениеЗаполнено(Противник) Тогда
			Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
			      	               |	ТурнирнаяТаблица.Регистратор КАК Регистратор,
			      	               |	ТурнирнаяТаблица.Период КАК Период
			      	               |ИЗ
			      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			      	               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			      	               |ГДЕ
			      	               |	Противник.Команда = &Противник
			      	               |	И ТурнирнаяТаблица.Команда = &Команда
			      	               |	И ТурнирнаяТаблица.Тур.Владелец.Владелец В
			      	               |			(ВЫБРАТЬ
			      	               |				Справочник.Чемпионаты.Владелец
			      	               |			ИЗ
			      	               |				Справочник.Чемпионаты
			      	               |			ГДЕ
			      	               |				Справочник.Чемпионаты.Ссылка = &Чемпионат)
			      	               |	И ВЫБОР
			      	               |			КОГДА &Отбор = 0
			      	               |				ТОГДА ТурнирнаяТаблица.КоличествоГолов >= 1
			      	               |			ИНАЧЕ Противник.КоличествоГолов >= 1
			      	               |		КОНЕЦ
			      	               |
			      	               |УПОРЯДОЧИТЬ ПО
			      	               |	Период УБЫВ");
		Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
		Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
		Запрос.УстановитьПараметр("Противник",		Противник);
		Запрос.УстановитьПараметр("Отбор",			Отбор);
		Если ПоказыватьТолькоЗабитыеМячи Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 10
			               |	ТурнирнаяТаблица.Регистратор КАК Регистратор,
			               |	ТурнирнаяТаблица.Период КАК Период
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			               |ГДЕ
			               |	Противник.Команда = &Противник
			               |	И ТурнирнаяТаблица.Команда = &Команда
			               |	И ТурнирнаяТаблица.КоличествоОчков = &Количество
			               |	И ТурнирнаяТаблица.Тур.Владелец.Владелец В
			               |			(ВЫБРАТЬ
			               |				Справочник.Чемпионаты.Владелец
			               |			ИЗ
			               |				Справочник.Чемпионаты
			               |			ГДЕ
			               |				Справочник.Чемпионаты.Ссылка = &Чемпионат)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Период УБЫВ";
			Запрос.УстановитьПараметр("Количество",		?(Отбор > 1, Победа(Противник), Отбор));
		КонецЕсли;
		Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	КонецЕсли;
	Возврат Новый Массив;
КонецФункции

&НаСервере
Функция Победа(Клуб)
	Если Победа = 0 Тогда
		Победа = Справочники.ВидыСпорта.КоличествоОчков(Клуб.Владелец).Победа;
	КонецЕсли;
	Возврат Победа;
КонецФункции
