
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Города") Тогда
		Параметры = Новый Структура("Город", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("ДокументСсылка.Матч") Тогда
		Город = ГородНайти(ПараметрКоманды);
		Если ЗначениеЗаполнено(Город) Тогда
			Параметры = Новый Структура("Город", Город);
		Иначе
			Параметры = Новый Структура("Матч", ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Дерби.Форма", Параметры, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция ГородНайти(Ссылка)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Команды.Город КАК Ссылка
	      	               |ИЗ
	      	               |	Документ.Матч.Команды КАК МатчКоманды
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	      	               |			ПО Команды.Город = Города.Ссылка
	      	               |		ПО МатчКоманды.Команда = Команды.Ссылка
	      	               |ГДЕ
	      	               |	МатчКоманды.Ссылка = &Ссылка 
	      	               |	
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Команды.Город
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Ссылка) = 2");
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции
