
&НаКлиенте
Процедура КодПриИзменении(Элемент=Неопределено)
	НаименованиеУстановить();
КонецПроцедуры

&НаСервере
Процедура НаименованиеУстановить()
	Если Объект.Ссылка.Пустая()
	Или ПустаяСтрока(Объект.Наименование)
	Тогда
		Объект.Наименование = РеквизитФормыВЗначение("Объект").НаименованиеПолучить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	Если Объект.Код = 0 Тогда
		Объект.Код = КодНовыйПолучить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере(Отказ);
	Если Объект.Ссылка.Пустая() Тогда
		КодПриИзменении();
	КонецЕсли;
	ДоступностьВидимостьУстановить();
КонецПроцедуры

&НаСервере
Процедура ДоступностьВидимостьУстановить(Перечитать=Ложь)
	Если Перечитать Тогда
		Прочитать();
	КонецЕсли;
	
	Если ЕстьМатчи(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр					= Истина;
		//Элементы.ОлимпийскаяСистема.Доступность			= Ложь;
	Иначе
	КонецЕсли;
	Элементы.ОлимпийскаяСистема.Видимость = ВладелецОлимпийскаяСистема();
КонецПроцедуры

&НаСервере
Функция КодНовыйПолучить()
	Возврат РеквизитФормыВЗначение("Объект").КодНовыйПолучить();
КонецФункции

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Объект.Код = КодНовыйПолучить();
	КодПриИзменении();
КонецПроцедуры

&НаСервере
Функция ЕстьМатчи(Тур)
	Если Тур.Пустая() Тогда Возврат Ложь; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(Матч.Дата), &Дата) КАК Дата
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |ГДЕ
	                      |	Матч.Тур = &Тур");
	Запрос.УстановитьПараметр("Тур",	Тур);
	Запрос.УстановитьПараметр("Дата",	Дата(1, 1, 1));
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Следующий() И Год(Выборка.Дата) > 1);
КонецФункции

&НаСервере
Функция ВладелецОлимпийскаяСистема()
	Возврат СерверныйФункции.ЛигаОлимпийскаяСистема(Объект.Владелец);
КонецФункции

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаОкончания = Макс(Объект.ДатаОкончания, ?(ДеньНедели(Объект.ДатаНачала) = 7, Объект.ДатаНачала, Объект.ДатаНачала + Сутки()));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты")
	И Параметр = Объект.Владелец
	Тогда
		Прочитать();
	ИначеЕсли СтрСравнить(ИмяСобытия, "Матчи") Тогда
		Прочитать();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаДатыИсправитьНаСервере()
	РеквизитФормыВЗначение("Объект").ДатыУстановить(Объект);
КонецПроцедуры

&НаКлиенте
Процедура КомандаДатыИсправить(Команда)
	КомандаДатыИсправитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ОлимпийскаяСистемаПриИзменении(Элемент)
	НаименованиеУстановить();
КонецПроцедуры
