
&НаКлиенте
Процедура КодПриИзменении(Элемент=Неопределено)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.Код) + "-й тур";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		//Если Объект.Код = 0 Тогда
			Объект.Код = КодНовыйПолучить(Объект.Владелец);
		//КонецЕсли;
		КодПриИзменении();
		//Если ПустаяСтрока(Объект.Владелец) Тогда
		//	Объект.Владелец = ЧемпионатПоследний();
		//КонецЕсли;
	Иначе
		ДоступностьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДоступностьУстановить()
	Элементы.Владелец.Доступность = НЕ ЕстьМатчи(Объект.Ссылка);
КонецПроцедуры

&НаСервере
Функция ЧемпионатПоследний(Лига)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Тур.Владелец КАК Владелец,
	                      |	ТурнирнаяТаблица.Период КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("Лига",	Лига);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Владелец, Справочники.Чемпионаты.ПустаяСсылка());
КонецФункции

&НаСервере
Функция КодНовыйПолучить(Чемпионат)
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Чемпионат = ЧемпионатПоследний(Чемпионат.Владелец);
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(Туры.Код) КАК Код
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	0
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Код + 1, 1);
КонецФункции

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	Объект.Код = КодНовыйПолучить(Объект.Владелец);
КонецПроцедуры

&НаСервере
Функция ЕстьМатчи(Тур)
	Если Тур.Пустая() Тогда Возврат Ложь; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МАКСИМУМ(Матч.Дата) КАК Дата
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |ГДЕ
	                      |	Матч.Тур = &Тур");
	Запрос.УстановитьПараметр("Тур",	Тур);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат (Выборка.Следующий() И Год(Выборка.Дата) > 1);
КонецФункции
