
&НаКлиенте
Процедура КодПриИзменении(Элемент=Неопределено)
	Если ПустаяСтрока(Объект.Наименование) Тогда
		Объект.Наименование = Строка(Объект.Код) + "-й тур";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Ссылка.Пустая() Тогда
		Если Объект.Код > 0 Тогда
			КодПриИзменении();
		КонецЕсли;
		Если ПустаяСтрока(Объект.Владелец) Тогда
			Объект.Владелец = ЧемпионатПоследний();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЧемпионатПоследний()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Тур.Владелец КАК Владелец,
	                      |	ТурнирнаяТаблица.Период КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Владелец, Справочники.Чемпионаты.ПустаяСсылка());
КонецФункции
