
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт трансферов");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Параметр) Экспорт
	Если ЭтоУРЛ(УРЛ) Тогда
		Если ИмпортТрансферов(УРЛ, Параметр) Тогда
			Если ГиперссылкаЗаписать(УРЛ, Параметр) Тогда
				НаКлиенте.Оповещение("Игрок", Параметр);
			КонецЕсли;
			НаКлиенте.Оповещение("ПеремещенияИгроков", Параметр);
		КонецЕсли;
	ИначеЕсли НЕ ПустаяСтрока(УРЛ) Тогда
		Если СерверныйФункции.ИмпортТрансферовПоСтроке(Разделить(УРЛ, "¶"), Параметр) Тогда
			НаКлиенте.Оповещение("ПеремещенияИгроков", Параметр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УРЛ(Ссылка)
	УРЛ	= СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий, Истина);
	Если СтрНайти(УРЛ, "%1") > 0 Тогда
		УРЛ	= СтрЗаменить(УРЛ, "%1", СерверныйФункции.ТекущийГод(Ссылка));
	КонецЕсли;
	Возврат УРЛ;
КонецФункции

&НаСервере
Функция ИмпортТрансферов(Гиперссылка, Ссылка)
	Возврат СерверныйФункции.ИмпортТрансферов(Гиперссылка, Ссылка);
КонецФункции

&НаСервере
Функция ГиперссылкаЗаписать(Гиперссылка, Игрок)
	Отказ	= Ложь;
	Объект	= Игрок.ПолучитьОбъект();
	Если СтрНайти(Объект.Комментарий, Лев(Гиперссылка, 11)) = 0 Тогда
		Если ПустаяСтрока(Объект.Комментарий) Тогда
			Объект.Комментарий	= Гиперссылка;
		Иначе
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + Гиперссылка;
		КонецЕсли;
		Отказ	= СерверныйФункции.ОбъектЗаписать(Объект);
	КонецЕсли;
	Возврат Отказ;
КонецФункции
