
&НаСервере
Процедура СписокОбновить()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
		
		Если Параметры.Отбор.Свойство("Команда") Тогда
			Элементы.Команда.Видимость		= Ложь;
			
		ИначеЕсли Параметры.Отбор.Свойство("Чемпионат") Тогда
			Элементы.Чемпионат.Видимость	= Ложь;
			Если ТипЗнч(Параметры.Отбор.Чемпионат) = Тип("СправочникСсылка.Чемпионаты") Тогда
				Элементы.Период.Видимость		= Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Список.АвтоматическоеСохранениеПользовательскихНастроек Тогда
		Если ЗначениеЗаполнено(Элементы.Список.Период) Тогда
			Элементы.Список.Период = Новый СтандартныйПериод;
			СписокОбновить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
