
&НаСервере
Процедура СписокОбновитьНаСервере()
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
		
		Если Параметры.Отбор.Свойство("Команда") Тогда
			Элементы.Команда.Видимость		= Ложь;
			
		ИначеЕсли Параметры.Отбор.Свойство("Чемпионат") Тогда
			Элементы.Чемпионат.Видимость	= Ложь;
			Если ТипЗнч(Параметры.Отбор.Чемпионат) = Тип("СправочникСсылка.Чемпионаты") Тогда
				Элементы.Период.Видимость		= Ложь;
			КонецЕсли;
			Если Параметры.Отбор.Свойство("Лига") Тогда
				Лига = Параметры.Отбор.Лига;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Список.АвтоматическоеСохранениеПользовательскихНастроек Тогда
		Если ЗначениеЗаполнено(Элементы.Список.Период) Тогда
			Элементы.Список.Период = Новый СтандартныйПериод;
			СписокОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Параметр	= Новый Структура("Чемпионат,Команда");
	ЗаполнитьЗначенияСвойств(Параметр, Элемент.ТекущиеДанные);
	Значение	= МатчНайти(Параметр);
	НаКлиенте.Показать(Значение, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Чемпионат") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МатчНайти(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Регистратор КАК Ссылка
	                      |ИЗ
	                      |	РегистрСведений.Итоги КАК Итоги
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Итоги.Команда = ТурнирнаяТаблица.Команда
	                      |ГДЕ
	                      |	Итоги.Чемпионат = &Чемпионат
	                      |	И Итоги.Команда = &Команда
	                      |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	                      |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТурнирнаяТаблица.Период УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",			Параметр.Чемпионат);
	Запрос.УстановитьПараметр("Команда",			Параметр.Команда);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Неопределено;
КонецФункции

&НаСервере
Процедура КомандаОбновитьНаСервере()
	Если ЗначениеЗаполнено(Лига) Тогда
		Чемпионаты = РегистрыСведений.Итоги.ЧемпионатыПолучить(Лига);
		Для Каждого Отбор Из Список.Отбор.Элементы Цикл
			Если СтрСравнить(Отбор.ЛевоеЗначение, "Чемпионат") = 0 Тогда
				Отбор.ВидСравнения		= ВидСравненияКомпоновкиДанных.ВСписке;
				Отбор.ПравоеЗначение	= Чемпионаты;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОбновить(Команда)
	КомандаОбновитьНаСервере();
КонецПроцедуры
