
&НаСервере
Процедура СписокОбновитьНаСервере() Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	СписокОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Список);
		
		Если Параметры.Отбор.Свойство("Команда") Тогда
			Элементы.Команда.Видимость		= Ложь;
			
		ИначеЕсли Параметры.Отбор.Свойство("Чемпионат") Тогда
			Элементы.Чемпионат.Видимость	= Ложь;
			Если ТипЗнч(Параметры.Отбор.Чемпионат) = Тип("СправочникСсылка.Чемпионаты") Тогда
				Элементы.Период.Видимость		= Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ Список.АвтоматическоеСохранениеПользовательскихНастроек Тогда
		Если ЗначениеЗаполнено(Элементы.Список.Период) Тогда
			Элементы.Список.Период = Новый СтандартныйПериод;
			СписокОбновитьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		//
	ИначеЕсли Элемент.ТекущиеДанные.Свойство("Чемпионат") Тогда
		НаКлиенте.Показать(Элемент.ТекущиеДанные.Чемпионат, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Чемпионат") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры
