
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек	= Ложь;
		
		Если Параметры.Отбор.Свойство("Команда") Тогда
			Элементы.Команда.Видимость		= Ложь;
		ИначеЕсли Параметры.Отбор.Свойство("Чемпионат") Тогда
			Элементы.Чемпионат.Видимость	= Ложь;
			Элементы.Период.Видимость		= Ложь;
		КонецЕсли;
	КонецЕсли;
	
	МояКоманда = МояКоманда();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
