
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ВладелецФормы = Неопределено Тогда
		Заголовок	= СтрШаблон("Участие (%1)", Игрок);
	КонецЕсли;
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") Тогда
		Игрок = Параметры.Игрок;
		Элементы.Лига.СписокВыбора.ЗагрузитьЗначения(СписокПолучить(Игрок));
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(СписокПолучить(Игрок, 1));
		
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Справочники.ВидыСпорта.КоличествоОчков(Игрок));
	КонецЕсли;
	Если Параметры.Свойство("Команда") Тогда
		Отчет.Команда = Параметры.Команда;
	КонецЕсли;
	Если НЕ ПроверитьЗаполнение() Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция СписокПолучить(Игрок, Тип=0)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	МатчСоставыКоманд.Ссылка.Тур.Владелец.Владелец КАК Ссылка
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |	И МатчСоставыКоманд.Ссылка.Проведен = ИСТИНА
	      	               |	И НЕ МатчСоставыКоманд.Ссылка.Тур.Ссылка ЕСТЬ NULL
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если Тип = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	МатчСоставыКоманд.Команда КАК Ссылка
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И МатчСоставыКоманд.Ссылка.Проведен = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ссылка
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат СерверныйФункции.ЦветКоманды(Команда);
КонецФункции

&НаСервере
Функция УстановитьТочку(Выборка)
	Точка = График.УстановитьТочку(ФорматЧГ(Выборка.Точка));
	Если НЕ ЗначениеЗаполнено(Точка.Расшифровка) Тогда
		Точка.Расшифровка = Выборка.Точка;
	КонецЕсли;
	Возврат Точка;
КонецФункции

&НаСервере
Функция УстановитьСерию(Команда)
	Серия	= График.УстановитьСерию(Команда);
	Если НЕ Серия.ПриоритетЦвета Тогда
		Серия.Расшифровка = Команда;
		Цвет	= Цвет(Команда);
		Если ЗначениеЗаполнено(Цвет) Тогда
			Серия.Цвет			= Цвет;
			Серия.ПриоритетЦвета= Истина;
		КонецЕсли;
	КонецЕсли;
	Возврат Серия;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Игрок) Тогда Возврат; КонецЕсли;
	
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 21
	      	               |	ГОД(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.Тур.Ссылка ЕСТЬ NULL
	      	               |				ТОГДА ТурнирнаяТаблица.Период
	      	               |			ИНАЧЕ ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания
	      	               |		КОНЕЦ) КАК Точка,
	      	               |	МатчСоставыКоманд.Команда КАК Серия,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
	      	               |ИЗ
	      	               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
	      	               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
	      	               |ГДЕ
	      	               |	МатчСоставыКоманд.Игрок = &Игрок
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	МатчСоставыКоманд.Команда,
	      	               |	ГОД(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.Тур.Ссылка ЕСТЬ NULL
	      	               |				ТОГДА ТурнирнаяТаблица.Период
	      	               |			ИНАЧЕ ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания
	      	               |		КОНЕЦ)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Точка,
	      	               |	Серия
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если ЗначениеЗаполнено(Отчет.Команда) И ЗначениеЗаполнено(Лига) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 21
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков < Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Проигрыш,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Ничья,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков > Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выигрыш
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |				И ТурнирнаяТаблица.Команда <> Противник.Команда
		               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И МатчСоставыКоманд.Команда = &Команда
		               |	И ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
	ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 21
		               |	ГОД(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.Тур.Ссылка ЕСТЬ NULL
		               |				ТОГДА ТурнирнаяТаблица.Период
		               |			ИНАЧЕ ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания
		               |		КОНЕЦ) КАК Точка,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков < Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Проигрыш,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Ничья,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков > Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выигрыш
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
		               |				И ТурнирнаяТаблица.Команда <> Противник.Команда
		               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И МатчСоставыКоманд.Команда = &Команда
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ГОД(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.Тур.Ссылка ЕСТЬ NULL
		               |				ТОГДА ТурнирнаяТаблица.Период
		               |			ИНАЧЕ ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания
		               |		КОНЕЦ)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
	ИначеЕсли ЗначениеЗаполнено(Лига) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 21
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания) КАК Точка,
		               |	МатчСоставыКоманд.Команда КАК Серия,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	МатчСоставыКоманд.Команда,
		               |	ГОД(ТурнирнаяТаблица.Тур.Владелец.ДатаОкончания)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка,
		               |	Серия
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Запрос.УстановитьПараметр("Команда",			Отчет.Команда);
	Запрос.УстановитьПараметр("Лига",				Лига);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		СерверныйФункции.СерииЗаполнить(График);
		Пока Выборка.Следующий() Цикл
			График.УстановитьЗначение(УстановитьТочку(Выборка), 0, Выборка.Проигрыш, Новый Структура("Год,Команда,Количество", Выборка.Точка, Отчет.Команда, 0));
			График.УстановитьЗначение(УстановитьТочку(Выборка), 1, Выборка.Ничья, Новый Структура("Год,Команда,Количество", Выборка.Точка, Отчет.Команда, Ничья));
			График.УстановитьЗначение(УстановитьТочку(Выборка), 2, Выборка.Выигрыш, Новый Структура("Год,Команда,Количество", Выборка.Точка, Отчет.Команда, Победа));
		КонецЦикла;
	Иначе
		Пока Выборка.Следующий() Цикл
			График.УстановитьЗначение(УстановитьТочку(Выборка), УстановитьСерию(Выборка.Серия), Выборка.Количество, Новый Структура("Год,Команда", Выборка.Точка, Выборка.Серия));
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	                      |	Матч.Ссылка КАК Значение,
	                      |	Матч.Счет КАК Представление,
	                      |	Матч.Дата КАК Дата
	                      |ИЗ
	                      |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
	                      |ГДЕ
	                      |	МатчСоставыКоманд.Игрок = &Игрок
	                      |	И МатчСоставыКоманд.Команда = &Команда
	                      |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
	                      |	И Матч.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Дата УБЫВ");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если ЗначениеЗаполнено(Лига) Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
			               |	Матч.Ссылка КАК Значение,
			               |	Матч.Счет КАК Представление,
			               |	Матч.Дата КАК Дата
			               |ИЗ
			               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			               |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
			               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
			               |ГДЕ
			               |	МатчСоставыКоманд.Игрок = &Игрок
			               |	И МатчСоставыКоманд.Команда = &Команда
			               |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
			               |	И Матч.Тур.Владелец.Владелец = &Лига
			               |	И ТурнирнаяТаблица.КоличествоОчков = &Количество
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Дата УБЫВ";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
			               |	Матч.Ссылка КАК Значение,
			               |	Матч.Счет КАК Представление,
			               |	Матч.Дата КАК Дата
			               |ИЗ
			               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			               |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
			               |			И МатчСоставыКоманд.Команда = ТурнирнаяТаблица.Команда
			               |ГДЕ
			               |	МатчСоставыКоманд.Игрок = &Игрок
			               |	И МатчСоставыКоманд.Команда = &Команда
			               |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
			               |	И ТурнирнаяТаблица.КоличествоОчков = &Количество
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Дата УБЫВ";
		КонецЕсли;
		Запрос.УстановитьПараметр("Количество",			Параметр.Количество);
		
	ИначеЕсли ЗначениеЗаполнено(Лига) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
		               |	Матч.Ссылка КАК Значение,
		               |	Матч.Счет КАК Представление,
		               |	Матч.Дата КАК Дата
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
		               |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Игрок
		               |	И МатчСоставыКоманд.Команда = &Команда
		               |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
		               |	И Матч.Тур.Владелец.Владелец = &Лига
		               |	И Матч.Проведен = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Запрос.УстановитьПараметр("Год",				Параметр.Год);
	Запрос.УстановитьПараметр("Команда",			Параметр.Команда);
	Запрос.УстановитьПараметр("Лига",				Лига);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаСервере
Функция ЛигиПолучить(Параметр)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	                      |	Матч.Тур.Владелец.Владелец КАК Значение,
	                      |	Матч.Тур.Владелец.Владелец.Наименование КАК Представление
	                      |ИЗ
	                      |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО МатчСоставыКоманд.Ссылка = Матч.Ссылка
	                      |ГДЕ
	                      |	МатчСоставыКоманд.Игрок = &Игрок
	                      |	И ГОД(Матч.Тур.Владелец.ДатаОкончания) = &Год
	                      |	И Матч.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Представление");
	Запрос.УстановитьПараметр("Игрок",				Игрок);
	Запрос.УстановитьПараметр("Год",				Параметр);
	Возврат СерверныйФункции.Выборка2СписокЗначений(Запрос.Выполнить().Выбрать());
КонецФункции

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	Если ТипЗнч(Элемент) = Тип("ЭлементСпискаЗначений")
	И ТипЗнч(Элемент.Значение) = Тип("СправочникСсылка.Лига")
	Тогда
		Лига = Элемент.Значение;
		СформироватьНаСервере();
	Иначе
		НаКлиенте.Показать(Элемент);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	Если ТипЗнч(Расшифровка) = Тип("Число") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= ЛигиПолучить(Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды") Тогда
		СтандартнаяОбработка = Ложь;
		Отчет.Команда = Расшифровка;
		СформироватьНаСервере();
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= МатчиПолучить(Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы) = Тип("ТочкаДиаграммы") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= ЛигиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеДиаграммы) = Тип("СерияДиаграммы") Тогда
		СтандартнаяОбработка = Ложь;
		Если ТипЗнч(ЗначениеДиаграммы.Значение) = Тип("СправочникСсылка.Команды") Тогда
			Отчет.Команда = ЗначениеДиаграммы.Значение;
			СформироватьНаСервере();
		КонецЕсли;
	ИначеЕсли ТипЗнч(ЗначениеДиаграммы.Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		Список	= МатчиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Список.Количество() = 1 Тогда
			ПослеВыбора(Список.Получить(0));
		ИначеЕсли Список.Количество() > 0 Тогда
			ПоказатьВыборИзСписка(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), Список);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЭлементПриИзменении(Элемент)
	СформироватьНаСервере();
КонецПроцедуры
