
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ();
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), УРЛ, "Импорт новостей",, Истина);
КонецПроцедуры

&НаСервере
Функция УРЛ()
	Возврат СерверныйФункции.БуферНовостей();
КонецФункции

&НаСервере
Функция ИмпортНаСервере(Гиперссылка)
	Возврат ПодпискиНаСобытие.ИмпортНовости(Гиперссылка);
КонецФункции

&НаСервере
Функция БуферНовостейУстановить(УРЛ)
	Если ЭтоУРЛ(УРЛ) Тогда
		Константы.БуферНовостей.Установить(УРЛ);
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Ответ	= Ложь;
	Если СтрЧислоСтрок(УРЛ) = 1 Тогда
		Ответ	= ИмпортНаСервере(УРЛ);
	Иначе
		Если ЭтоУРЛ(УРЛ) Тогда
			Для НомерСтроки = 1 По СтрЧислоСтрок(УРЛ) Цикл
				Ответ	= Макс(Ответ, ИмпортНаСервере(СтрПолучитьСтроку(УРЛ, НомерСтроки)));
			КонецЦикла;
		Иначе
			Ответ	= ИмпортНаСервере(УРЛ);
		КонецЕсли;
	КонецЕсли;
	Если Ответ Тогда
		НаКлиенте.Оповещение("Новости");
		БуферНовостейУстановить(УРЛ);
	КонецЕсли;
КонецПроцедуры
