
Функция ОтчетСформировать() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ЗаголовокПолучить());
	
	Команда		= МояКомандаПолучить();
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка2"));
	Для Каждого Выборка Из Данные Цикл
		ОбластьМакета	= Макет.ПолучитьОбласть(?(Выборка.Команда=Команда, "Детали3", "Детали2"));
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	Возврат ТабДокумент;
КонецФункции

Функция ЗаголовокПолучить()
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат", Лига, Лига));
КонецФункции

Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
