
Функция ОтчетСформировать() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ЗаголовокПолучить());
	
	ПоказыватьРазницуМячей	= НаСервереПовторно.ПоказыватьРазницуМячей();
	Команда		= МояКомандаПолучить();
	
	Макет	= ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка2|Основная"));
	Для Каждого Выборка Из Данные Цикл
		ОбластьМакета	= Макет.ПолучитьОбласть(?(Выборка.Команда=Команда, "Детали3|Основная", "Детали2|Основная"));
		ОбластьМакета.Параметры.Заполнить(Выборка);
		Если ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.Разница	= Формат(Выборка.КоличествоЗабито - Выборка.КоличествоПропущено, "ЧГ=0");
		ИначеЕсли Лига.ОлимпийскаяСистема И Выборка.КоличествоЗабито = Выборка.КоличествоПропущено И Выборка.КоличествоОчков = 0 Тогда
			ОбластьМакета.Параметры.Разница	= РазницаДополнить(Выборка);
		Иначе
			ОбластьМакета.Параметры.Разница	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ЗаголовокПолучить()
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат", Лига, Лига));
КонецФункции

Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

Функция РазницаДополнить(Параметры)
	Ответ = СтрШаблон("%1-%2", Параметры.КоличествоЗабито, Параметры.КоличествоПропущено);
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Пенальти КАК Пенальти,
	                      |	ТурнирнаяТаблица.КоличествоГолов КАК КоличествоЗабито,
	                      |	Противник.КоличествоГолов КАК КоличествоПропущено,
	                      |	Противник.Пенальти КАК Пенальти1
	                      |ИЗ
	                      |	РегистрСведений.Итоги КАК Итоги
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	                      |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	                      |				И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	                      |		ПО Итоги.Команда = ТурнирнаяТаблица.Команда
	                      |			И (ГОД(Итоги.Период) = ГОД(ТурнирнаяТаблица.Период))
	                      |ГДЕ
	                      |	ГОД(Итоги.Период) = &Год
	                      |	И Итоги.Команда = &Команда
	                      |	И Итоги.Место = 1
	                      |	И Итоги.Чемпионат.Владелец = &Лига
	                      |	И ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТурнирнаяТаблица.Период УБЫВ");
	Запрос.УстановитьПараметр("Лига",				Лига);
	Запрос.УстановитьПараметр("Команда",			Параметры.Команда);
	Запрос.УстановитьПараметр("Год",				Параметры.Год);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И Выборка.КоличествоЗабито = Параметры.КоличествоЗабито И Выборка.КоличествоПропущено = Параметры.КоличествоПропущено Тогда
		Ответ = СтрШаблон("%1-%2 (%3-%4)", Параметры.КоличествоЗабито, Параметры.КоличествоПропущено, Выборка.Пенальти, Выборка.Пенальти1);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции
