
Функция ОтчетСформировать() Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.Вывести(ЗаголовокПолучить());
	
	ПоказыватьРазницуМячей	= СерверныйФункции.ПоказыватьРазницуМячей();
	Команда		= МояКомандаПолучить();
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка2|Основная"));
	Для Каждого Выборка Из Данные Цикл
		ОбластьМакета	= Макет.ПолучитьОбласть(?(Выборка.Команда=Команда, "Детали3|Основная", "Детали2|Основная"));
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Разница	= ?(ПоказыватьРазницуМячей, Формат(Выборка.КоличествоЗабито - Выборка.КоличествоПропущено, "ЧГ=0"), СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено));
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;

	Возврат ТабДокумент;
КонецФункции

Функция ЗаголовокПолучить()
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат", Лига, Лига));
КонецФункции

Функция МояКомандаПолучить()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
