
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Отбор.Количество() > 0 Тогда
		Список.АвтоматическоеСохранениеПользовательскихНастроек	= Ложь;
	КонецЕсли;
	Если Параметры.Свойство("Страна") Тогда
		Страна = Параметры.Страна;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НаКлиенте.ЭтоОтчет(ВладелецФормы) Тогда
		Элементы.Список.ТолькоПросмотр	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если СтрСравнить(ИмяСобытия, "Команда") = 0 Тогда
		ПодключитьОбработчикОжидания("СписокОбновить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбновить() Экспорт
	Если ЗначениеЗаполнено(Страна) Тогда
		Для Каждого Элемент Из Список.Отбор.Элементы Цикл
			Если СтрСравнить(Элемент.ЛевоеЗначение, "Ссылка") = 0 Тогда
				Элемент.ПравоеЗначение.ЗагрузитьЗначения(КомандыСтраны(Страна));
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандыСтраны(Страна)
	Возврат СерверныйФункции.КомандыСтраны(Страна);
КонецФункции
