
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ=Истина, Знач Ключ=Неопределено, Поле="") Экспорт
	Отказ = Истина;
	Глашатай = Новый СообщениеПользователю;
	Если Ключ <> Неопределено Тогда
		Глашатай.КлючДанных	= Ключ;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Поле) Тогда
		Глашатай.Поле	= Поле;
	КонецЕсли;
	Глашатай.Текст	= ?(ПустаяСтрока(ТекстСообщения), "Ошибка", Строка(ТекстСообщения));
	Глашатай.Сообщить();
КонецПроцедуры

Функция РасширениеФайлаВерно(Знач ИмяФайла, Знач ТипФайла="картинка") Экспорт
	Расширения = Новый Массив;
	//Если СтрСравнить(ТипФайла, "учебник") = 0 Тогда
	//	Расширения.Добавить(".doc");
	//	Расширения.Добавить(".docx");
	//	Расширения.Добавить(".html");
	//	Расширения.Добавить(".htm");
	//	Расширения.Добавить(".pdf");
	//Иначе //Если НРег(ТипФайла) = "картинка" Тогда
		Расширения.Добавить(".bmp");
		Расширения.Добавить(".dib");
		Расширения.Добавить(".rle");
		Расширения.Добавить(".jpg");
		Расширения.Добавить(".jpeg");
		Расширения.Добавить(".tif");
		//Расширения.Добавить(".gif");
		Расширения.Добавить(".png");
		//Расширения.Добавить(".ico");
		Расширения.Добавить(".wmf");
		Расширения.Добавить(".emf");
		Расширения.Добавить(".svg");
	//КонецЕсли;
	Возврат (Расширения.Найти(НРег(РасширениеФайла(ИмяФайла))) <> Неопределено);
КонецФункции

Функция РасширениеФайла(Знач ИмяФайла) Экспорт
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	тФайл = Новый Файл(ИмяФайла);
	Возврат тФайл.Расширение;
КонецФункции

Функция РазмерКартинкиМинимальный() Экспорт
	Возврат 128;
КонецФункции

Процедура УстановитьЗначение(Реквизит, Значение) Экспорт
	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаголовокСкрыть(ЭтаФорма, Элемент=Неопределено) Экспорт
	ЭтаФорма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
	ЭтаФорма.АвтоЗаголовок			= Ложь;
	ЭтаФорма.ОтображатьЗаголовок	= Ложь;
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца	=  Истина;
	Если ТипЗнч(Элемент) = Тип("ДинамическийСписок") Тогда
		Элемент.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы")
	Или ТипЗнч(Элемент) = Тип("ПолеФормы")
	Тогда
		Элемент.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

Функция КартинкиЗагрузить(Список, Кеш=Неопределено) Экспорт
	Ответ = Ложь;
	Для Каждого Элемент Из Список Цикл
		Если Кеш = Неопределено Тогда
			Картинка = СерверныйФункции.ИзображениеПолучить(Элемент.Значение, Истина);
			Если Картинка.Вид <> ВидКартинки.Пустая Тогда
				Элемент.Картинка	= Картинка;
				Ответ = Истина;
			КонецЕсли;
		Иначе
			ЭлементК	= Кеш.НайтиПоЗначению(Элемент.Значение);
			Если ЭлементК = Неопределено Тогда
				ЭлементК = Кеш.Добавить(Элемент.Значение,,, СерверныйФункции.ИзображениеПолучить(Элемент.Значение, Истина));
			КонецЕсли;
			Картинка	= ЭлементК.Картинка;
			Если Картинка.Вид <> ВидКартинки.Пустая Тогда
				Элемент.Картинка	= Картинка;
				Ответ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции
