
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ=Истина, Знач Ключ=Неопределено, Поле="") Экспорт
	Отказ = Истина;
	Глашатай = Новый СообщениеПользователю;
	Если Ключ <> Неопределено Тогда
		Глашатай.КлючДанных	= Ключ;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Поле) Тогда
		Глашатай.Поле	= Поле;
	КонецЕсли;
	Глашатай.Текст	= ?(ПустаяСтрока(ТекстСообщения), "Ошибка", Строка(ТекстСообщения));
	Глашатай.Сообщить();
КонецПроцедуры

Функция РасширениеФайлаВерно(Знач ИмяФайла) Экспорт
	Расширения = Новый Массив;
	Расширения.Добавить(".bmp");
	Расширения.Добавить(".dib");
	Расширения.Добавить(".rle");
	Расширения.Добавить(".jpg");
	Расширения.Добавить(".jpeg");
	Расширения.Добавить(".tif");
	Расширения.Добавить(".gif");
	Расширения.Добавить(".png");
	//Расширения.Добавить(".ico");
	Расширения.Добавить(".odg");
	Расширения.Добавить(".svg");
	Возврат (Расширения.Найти(НРег(РасширениеФайла(ИмяФайла))) <> Неопределено);
КонецФункции

Функция РасширениеФайла(Знач ИмяФайла) Экспорт
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	тФайл = Новый Файл(ИмяФайла);
	Возврат тФайл.Расширение;
КонецФункции

Функция РазмерКартинкиМинимальный() Экспорт
	Возврат 128;
КонецФункции

Процедура УстановитьЗначение(Реквизит, Значение) Экспорт
	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаголовокСкрыть(ЭтаФорма, Элемент=Неопределено) Экспорт
	ЭтаФорма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
	ЭтаФорма.АвтоЗаголовок			= Ложь;
	ЭтаФорма.ОтображатьЗаголовок	= Ложь;
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца	=  Истина;
	Если ТипЗнч(Элемент) = Тип("ДинамическийСписок") Тогда
		Элемент.АвтоматическоеСохранениеПользовательскихНастроек = Ложь;
	ИначеЕсли ТипЗнч(Элемент) = Тип("ГруппаФормы")
	Или ТипЗнч(Элемент) = Тип("ПолеФормы")
	Тогда
		Элемент.Видимость	= Ложь;
	КонецЕсли;
КонецПроцедуры

Функция КартинкиЗагрузить(Список, Кеш=Неопределено) Экспорт
	Ответ	= Ложь;
	Если НаСервереПовторно.ВыводитьЛоготипыКоманд() Тогда
		Шагомер	= 0;
		Для Каждого Элемент Из Список Цикл
			Если Шагомер > 42 Тогда
				Прервать;
			ИначеЕсли Кеш = Неопределено Тогда
				Картинка = СерверныйФункции.ИзображениеПолучить(Элемент.Значение, Истина);
				Если Картинка.Вид <> ВидКартинки.Пустая Тогда
					Элемент.Картинка	= Картинка;
					Ответ = Истина;
				КонецЕсли;
			Иначе
				ЭлементК	= Кеш.НайтиПоЗначению(Элемент.Значение);
				Если ЭлементК = Неопределено Тогда
					ЭлементК = Кеш.Добавить(Элемент.Значение,,, СерверныйФункции.ИзображениеПолучить(Элемент.Значение, Истина));
				КонецЕсли;
				Картинка	= ЭлементК.Картинка;
				Если Картинка.Вид <> ВидКартинки.Пустая Тогда
					Элемент.Картинка	= Картинка;
					Ответ = Истина;
				КонецЕсли;
			КонецЕсли;
			Шагомер = Шагомер + 1;
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции
