
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ=Истина, Знач Ключ=Неопределено, Поле="") Экспорт
	Отказ = Истина;
	Глашатай = Новый СообщениеПользователю;
	Если Ключ <> Неопределено Тогда
		Глашатай.КлючДанных	= Ключ;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Поле) Тогда
		Глашатай.Поле	= Поле;
	КонецЕсли;
	Глашатай.Текст	= ?(ПустаяСтрока(ТекстСообщения), "Ошибка", Строка(ТекстСообщения));
	Глашатай.Сообщить();
КонецПроцедуры

Функция РасширениеФайлаВерно(Знач ИмяФайла, Знач ТипФайла="картинка") Экспорт
	Расширения = Новый Массив;
	//Если СтрСравнить(ТипФайла, "учебник") = 0 Тогда
	//	Расширения.Добавить(".doc");
	//	Расширения.Добавить(".docx");
	//	Расширения.Добавить(".html");
	//	Расширения.Добавить(".htm");
	//	Расширения.Добавить(".pdf");
	//Иначе //Если НРег(ТипФайла) = "картинка" Тогда
		Расширения.Добавить(".bmp");
		Расширения.Добавить(".dib");
		Расширения.Добавить(".rle");
		Расширения.Добавить(".jpg");
		Расширения.Добавить(".jpeg");
		Расширения.Добавить(".tif");
		Расширения.Добавить(".gif");
		Расширения.Добавить(".png");
		Расширения.Добавить(".ico");
		Расширения.Добавить(".wmf");
		Расширения.Добавить(".emf");
	//КонецЕсли;
	Возврат (Расширения.Найти(НРег(РасширениеФайла(ИмяФайла))) <> Неопределено);
КонецФункции

Функция РасширениеФайла(Знач ИмяФайла) Экспорт
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	тФайл = Новый Файл(ИмяФайла);
	Возврат тФайл.Расширение;
КонецФункции
