
Процедура СообщитьОбОшибке(ТекстСообщения, Отказ=Истина, Знач Ключ=Неопределено, Поле="") Экспорт
	Отказ = Истина;
	Глашатай = Новый СообщениеПользователю;
	Если Ключ <> Неопределено Тогда
		Глашатай.КлючДанных	= Ключ;
	КонецЕсли;
	Если НЕ ПустаяСтрока(Поле) Тогда
		Глашатай.Поле	= Поле;
	КонецЕсли;
	Глашатай.Текст	= ?(ПустаяСтрока(ТекстСообщения), "Ошибка", Строка(ТекстСообщения));
	Глашатай.Сообщить();
КонецПроцедуры

Функция РасширениеФайлаВерно(Знач ИмяФайла, Знач ТипФайла="картинка") Экспорт
	Расширения = Новый Массив;
	//Если СтрСравнить(ТипФайла, "учебник") = 0 Тогда
	//	Расширения.Добавить(".doc");
	//	Расширения.Добавить(".docx");
	//	Расширения.Добавить(".html");
	//	Расширения.Добавить(".htm");
	//	Расширения.Добавить(".pdf");
	//Иначе //Если НРег(ТипФайла) = "картинка" Тогда
		Расширения.Добавить(".bmp");
		Расширения.Добавить(".dib");
		Расширения.Добавить(".rle");
		Расширения.Добавить(".jpg");
		Расширения.Добавить(".jpeg");
		Расширения.Добавить(".tif");
		//Расширения.Добавить(".gif");
		Расширения.Добавить(".png");
		//Расширения.Добавить(".ico");
		Расширения.Добавить(".wmf");
		Расширения.Добавить(".emf");
		Расширения.Добавить(".svg");
	//КонецЕсли;
	Возврат (Расширения.Найти(НРег(РасширениеФайла(ИмяФайла))) <> Неопределено);
КонецФункции

Функция РасширениеФайла(Знач ИмяФайла) Экспорт
	Если ПустаяСтрока(ИмяФайла) Тогда
		Возврат "";
	КонецЕсли;
	тФайл = Новый Файл(ИмяФайла);
	Возврат тФайл.Расширение;
КонецФункции

Функция СкачатьПоСсылке(Гиперссылка, КомОбъект=Неопределено) Экспорт
	Если ПустаяСтрока(Гиперссылка) Тогда Возврат ""; КонецЕсли;
	Попытка
		Если КомОбъект = Неопределено Тогда
			КомОбъект = Новый COMОбъект("Msxml2.XMLHTTP");
		КонецЕсли;
		КомОбъект.Open("GET", Гиперссылка, false);
		КомОбъект.Send();
		Если КомОбъект.status = 200 Тогда
			Возврат КомОбъект.responseText;
		КонецЕсли;
	Исключение
		СерверныйФункции.Логировать("ОбщегоНазначения.СкачатьПоСсылке", ОписаниеОшибки(), Гиперссылка);
	КонецПопытки;
	Возврат "";
КонецФункции

Процедура УстановитьЗначение(Реквизит, Значение) Экспорт
	Если Реквизит <> Значение Тогда
		Реквизит = Значение;
	КонецЕсли;
КонецПроцедуры

Функция ТекстовыйДокументПрочитать(ИмяФайла) Экспорт
	Ответ	= "";
	Попытка
		ТекстовыйДокумент = Новый ТекстовыйДокумент;
		ТекстовыйДокумент.Прочитать(ИмяФайла);
		Ответ	= ТекстовыйДокумент.ПолучитьТекст();
	Исключение
		СерверныйФункции.Логировать("ОбщегоНазначения.ТекстовыйДокументПрочитать", ОписаниеОшибки(), ИмяФайла);
	КонецПопытки;
	Возврат Ответ;
КонецФункции
