
&НаКлиенте
Процедура ТикТак() Экспорт
	Таймер = Финиш - ТекущаяДата();
	Если Финиш <= ТекущаяДата() Тогда
		Элементы.ГруппаОтветы.Доступность	= Ложь;
		Вопрос		= Вопросы.НайтиПоЗначению(ТекущийВопрос).Представление;
		Элементы.Вопрос.Видимость			= Истина;
		
		ПодключитьОбработчикОжидания("Стоп3", 1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Стоп3() Экспорт
	ОтключитьОбработчикОжидания("ТикТак");
	Стоп(3);
КонецПроцедуры

&НаКлиенте
Процедура Дальше() Экспорт
	Было.Добавить(ТекущийВопрос);
	
	ОсталосьВопросов	= ОсталосьВопросов - 1;
	
	Если ОсталосьВопросов = 0 Тогда
		Стоп();
	ИначеЕсли ВопросУстановить() Тогда
		Вопрос	= "";
		Таймер 	= Финиш - ТекущаяДата();
		ОтветыОбновить();
	Иначе
		Стоп();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ВопросУстановитьНаСервере()
	ТекущийВопрос	= Неопределено;
	ВопросТекст		= "";
	Для Каждого Элемент Из Вопросы Цикл
		Если Было.НайтиПоЗначению(Элемент.Значение) = Неопределено Тогда
			ТекущийВопрос	= Элемент.Значение;
			ВопросТекст		= ТекущийВопрос.ПолноеНаименование();
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ЗначениеЗаполнено(ТекущийВопрос);
КонецФункции

&НаКлиенте
Функция ВопросУстановить()
	Если ВопросУстановитьНаСервере() Тогда
		ХроносДобавить();
	КонецЕсли;
	Возврат ЗначениеЗаполнено(ТекущийВопрос);
КонецФункции

&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка, Кеш)
	Элемент	= Кеш.НайтиПоЗначению(Ссылка);
	Если Элемент = Неопределено Тогда
		Изо = СерверныйФункции.ИзображениеПолучить(Ссылка);
		Кеш.Добавить(Ссылка, Изо);
	Иначе
		Изо = Элемент.Представление;
	КонецЕсли;
	Возврат Изо;
КонецФункции

&НаСервере
Процедура ОтветыОбновить(Обновить=Ложь)
	ГС		= Новый ГенераторСлучайныхЧисел;

	Элементы.Вопрос.Видимость	= Ложь;
	
	Вопросник	= ГС.СлучайноеЧисло(0, ОтветыТекущие.Количество() - 1);
	Пронто		= Новый Массив;
	Для Каждого Ответ Из ОтветыТекущие Цикл
		Если Вопросник = Ответ.ПолучитьИдентификатор() Тогда
			Изо	= ИзображениеПолучить(ТекущийВопрос, Кеш);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Ответ.Значение, Изо));
			Элемент = Вопросы.НайтиПоЗначению(ТекущийВопрос);
			Элемент.Представление	= Изо;
		Иначе
			Виктим		= Неопределено;
			Ответы.СортироватьПоПредставлению();
			Итератор	= Вопросы.Количество();
			Пока Виктим = Неопределено Цикл
				Для Каждого Элемент Из Ответы Цикл
					Если Пронто.Найти(Элемент.Значение) <> Неопределено Тогда
						//
					ИначеЕсли Элемент.Значение = ТекущийВопрос Тогда
						//
					ИначеЕсли Итератор <= Вопросник Тогда
						Виктим	= Элемент;
						Прервать;
					КонецЕсли;
					Итератор = Итератор - ?(Ответ.Пометка, 3.1, 1.7) * Макс(1, Секунда(ТекущаяДатаСеанса()));
				КонецЦикла;
			КонецЦикла;
			Изо	= ИзображениеПолучить(Виктим.Значение, Кеш);
			ЗаполнитьЗначенияСвойств(ЭтаФорма, Новый Структура(Ответ.Значение, Изо));
			Виктим.Представление	= Изо;
			
			Пронто.Добавить(Виктим.Значение);
		КонецЕсли;
		Ответ.Представление		= Изо;
	КонецЦикла;
	Элементы.ГруппаОтветы.Доступность = Истина;
	
	Если Обновить Тогда
		ВидимостьУстановить(Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить(ЭтоСтарт=Ложь)
	ПоложениеКоманднойПанели			= ?(Шаг = 1, ПоложениеКоманднойПанелиФормы.Нет, ПоложениеКоманднойПанелиФормы.Авто);
	Элементы.СтраницаНачало.Видимость	= (Шаг < 1);
	Элементы.СтраницаТест.Видимость		= (Шаг = 1);
	Элементы.СтраницаФиниш.Видимость	= (Шаг > 1);
	Если ЭтоСтарт Тогда
		Элементы.ГруппаПараметры.ТолькоПросмотр = Истина;
		ДатаНачало	= ТекущаяДатаСеанса();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Стоп(ШагСледующий=2)
	ОтключитьОбработчикОжидания("ТикТак");
	
	Если ШагСледующий = 2 Тогда
		//
	ИначеЕсли ШагСледующий = 3 Тогда
		ХроносДобавить("");
	Иначе
		ХроносДобавить("");
	КонецЕсли;
	СтопНаСервере(ШагСледующий);
	НаКлиенте.Оповещение("Квиз", Новый Структура("Уровень,КоличествоВопросов", Уровень, КоличествоВопросов));
КонецПроцедуры

&НаКлиенте
Процедура ОтветНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка				= Ложь;
	Если Элементы.ГруппаОтветы.Доступность Тогда
		Элементы.ГруппаОтветы.Доступность	= Ложь;
		
		Если Шаг = 1 Тогда
			Вопрос		= Вопросы.НайтиПоЗначению(ТекущийВопрос).Представление;
			Если СтрСравнить(Вычислить(Элемент.Имя), Вопрос) = 0 Тогда
				ПравильныхОтветов	= ПравильныхОтветов + 1;
				Исключения.Добавить(ТекущийВопрос);
				
				ХроносДобавить(ТекущийВопрос);
			Иначе
				ХроносДобавить("");
				Элементы.Вопрос.Видимость	= Истина;
			КонецЕсли;
			Финиш = Финиш + 0.1;
			
			ПодключитьОбработчикОжидания("Дальше", 0.1, Истина);
		Иначе
			ВидимостьУстановить();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция Цвет(Аларм=Ложь)
	Возврат ?(Аларм, ЦветаСтиля.ЦветОтрицательногоЧисла, ЦветаСтиля.ЦветТекстаФормы);
КонецФункции

&НаСервере
Процедура СтопНаСервере(ШагСледующий)
	Если ШагСледующий = 2 Тогда
		Затрачено			= ХроносЗаписать();
		ЗатраченоВремени	= ВремяСтрокой(Затрачено);
	ИначеЕсли ШагСледующий = 3 Тогда
		ХроносЗаписать();
		Затрачено			= -1;
		ЗатраченоВремени	= "Время истекло";
	Иначе
		ХроносЗаписать();
		Затрачено			= -1;
		ЗатраченоВремени	= "Прервано";
	КонецЕсли;
	
	Элементы.ПравильныхОтветов.ЦветТекста	= Цвет();
	Элементы.ЗатраченоВремени.ЦветТекста	= Цвет();
	Если ПравильныхОтветов = КоличествоВопросов И Затрачено > 0 Тогда
		Элементы.ПравильныхОтветов.ЦветТекста = Цвет(Истина);
		Если ?(РезультатЛучший = 0, Истина, Затрачено <= РезультатЛучший) Тогда
			Элементы.ЗатраченоВремени.ЦветТекста = Цвет(Истина);
			КвизРезультатЛучший = ЗатраченоВремени;
		КонецЕсли;
		
	ИначеЕсли ПравильныхОтветов = 0 Тогда
		Элементы.ПравильныхОтветов.ЦветТекста = Цвет(Истина);
	ИначеЕсли ШагСледующий = 3 Тогда
		Элементы.ЗатраченоВремени.ЦветТекста = Цвет(Истина);
	КонецЕсли;
	
	Шаг		= ШагСледующий;
	ВидимостьУстановить();
КонецПроцедуры

&НаСервере
Функция ЗапросИнит(ЧислоСлевина=0)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 199
	                      |	ВТ.Ссылка КАК Ссылка,
	                      |	ВТ.Ссылка В (&Было) КАК Пометка,
	                      |	ВТ.Ссылка = &Команда КАК МояКоманда
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Итоги.Команда КАК Ссылка,
	                      |		СРЕДНЕЕ(&ЧислоСлевина + Итоги.Место) КАК Порядок
	                      |	ИЗ
	                      |		РегистрСведений.Итоги КАК Итоги
	                      |	ГДЕ
	                      |		Итоги.Период >= &Дата
	                      |		И Итоги.Место <= 5
	                      |		И Итоги.Чемпионат.Владелец В
	                      |				(ВЫБРАТЬ
	                      |					Лиги.Лига
	                      |				ИЗ
	                      |					(ВЫБРАТЬ ПЕРВЫЕ 5
	                      |						Итоги.Чемпионат.Владелец КАК Лига,
	                      |						СУММА(Итоги.КоличествоОчков) КАК Количество
	                      |					ИЗ
	                      |						РегистрСведений.Итоги КАК Итоги
	                      |					СГРУППИРОВАТЬ ПО
	                      |						Итоги.Чемпионат.Владелец
	                      |					УПОРЯДОЧИТЬ ПО
	                      |						Количество УБЫВ) КАК Лиги)
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Итоги.Команда
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Противник.Команда,
	                      |		СРЕДНЕЕ(&ЧислоСлевина + Противник.КоличествоГолов)
	                      |	ИЗ
	                      |		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	                      |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	                      |				И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	                      |	ГДЕ
	                      |		ТурнирнаяТаблица.Период >= &Дата
	                      |		И ТурнирнаяТаблица.Команда = &Команда
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		Противник.Команда
	                      |	
	                      |	ОБЪЕДИНИТЬ ВСЕ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		КвизРезультаты.Вопрос,
	                      |		СУММА(&ЧислоСлевина + КвизРезультаты.Время)
	                      |	ИЗ
	                      |		РегистрСведений.КвизРезультаты КАК КвизРезультаты
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Квиз КАК Квиз
	                      |			ПО КвизРезультаты.Период = Квиз.Период
	                      |				И КвизРезультаты.Сессия = Квиз.Сессия
	                      |	ГДЕ
	                      |		КвизРезультаты.Период >= &ДатаН
	                      |		И ВЫБОР
	                      |				КОГДА Квиз.Уровень = 1
	                      |					ТОГДА КвизРезультаты.Время МЕЖДУ 0 И 1
	                      |				ИНАЧЕ Квиз.Уровень = 0
	                      |			КОНЕЦ
	                      |		И КвизРезультаты.Вопрос.ПометкаУдаления = ЛОЖЬ
	                      |	
	                      |	СГРУППИРОВАТЬ ПО
	                      |		КвизРезультаты.Вопрос
	                      |	
	                      |	ИМЕЮЩИЕ
	                      |		СУММА(1) >= 2) КАК ВТ
	                      |ГДЕ
	                      |	(ВТ.Ссылка В (&Исключения)) = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МояКоманда,
	                      |	Пометка,
	                      |	СУММА(ВТ.Порядок)");
	Запрос.УстановитьПараметр("Дата",				ДобавитьМесяц(ТекущаяДатаСеанса(), -42));
	Запрос.УстановитьПараметр("ДатаН",				ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.УстановитьПараметр("Команда",			МояКоманда);
	Запрос.УстановитьПараметр("Было",				Было);
	Запрос.УстановитьПараметр("Исключения",			Исключения);
	Запрос.УстановитьПараметр("ЧислоСлевина",		ЧислоСлевина);
	Возврат Запрос;
КонецФункции

&НаСервере
Функция ВопросыОтветыПолучить()
	ГС	= Новый ГенераторСлучайныхЧисел;
	
	Запрос = ЗапросИнит(ГС.СлучайноеЧисло(0, 3));
	Запрос.УстановитьПараметр("ЧислоСлевина",		ГС.СлучайноеЧисло(0, 3));
	Если Уровень = 1 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1990
		               |	Команды.Ссылка КАК Ссылка,
		               |	Команды.Ссылка В (&Было) КАК Пометка,
		               |	Команды.Ссылка = &Команда КАК МояКоманда
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			КвизРезультаты.Вопрос КАК Команда,
		               |			СРЕДНЕЕ(&ЧислоСлевина + ВЫБОР
		               |					КОГДА КвизРезультаты.Время >= 0
		               |						ТОГДА -1 / КвизРезультаты.Время
		               |					ИНАЧЕ КвизРезультаты.Время
		               |				КОНЕЦ) КАК Количество
		               |		ИЗ
		               |			РегистрСведений.КвизРезультаты КАК КвизРезультаты
		               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |				ПО КвизРезультаты.Вопрос = ТурнирнаяТаблица.Команда
		               |		ГДЕ
		               |			КвизРезультаты.Период >= &ДатаН
		               |			И (КвизРезультаты.Вопрос В (&Исключения)) = ЛОЖЬ
		               |			И (КвизРезультаты.Вопрос.Город В
		               |						(ВЫБРАТЬ
		               |							Команды.Город
		               |						ИЗ
		               |							Справочник.Команды КАК Команды
		               |						ГДЕ
		               |							Команды.Ссылка = &Команда)
		               |					ИЛИ КвизРезультаты.Вопрос В
		               |						(ВЫБРАТЬ
		               |							ВЫБОР
		               |								КОГДА Дерби.Команда = &Команда
		               |									ТОГДА Дерби.Противник
		               |								ИНАЧЕ Дерби.Команда
		               |							КОНЕЦ
		               |						ИЗ
		               |							РегистрСведений.Дерби КАК Дерби
		               |						ГДЕ
		               |							(Дерби.Команда = &Команда
		               |								ИЛИ Дерби.Противник = &Команда))
		               |					ИЛИ ВЫБОР
		               |						КОГДА ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна ЕСТЬ NULL
		               |							ТОГДА ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ИСТИНА
		               |						ИНАЧЕ ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		               |					КОНЕЦ)
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			КвизРезультаты.Вопрос) КАК КвизРезультаты
		               |		ПО Команды.Ссылка = КвизРезультаты.Команда
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО Команды.Ссылка = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ
		               |	И (Команды.Ссылка В (&Исключения)) = ЛОЖЬ
		               |	И ТурнирнаяТаблица.Период >= &Дата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Команды.Ссылка
		               |
		               |ИМЕЮЩИЕ
		               |	СУММА(&ЧислоСлевина + ТурнирнаяТаблица.КоличествоОчков) >= 42
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МояКоманда,
		               |	Пометка,
		               |	ЕСТЬNULL(СУММА(&ЧислоСлевина + КвизРезультаты.Количество), 99) + СРЕДНЕЕ(ТурнирнаяТаблица.КоличествоОчков) УБЫВ";
	ИначеЕсли Уровень = 2 Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 199
		               |	Команды.Ссылка КАК Ссылка,
		               |	Команды.Ссылка В (&Было) КАК Пометка,
		               |	Команды.Ссылка = &Команда КАК МояКоманда
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			КвизРезультаты.Вопрос КАК Команда,
		               |			СРЕДНЕЕ(&ЧислоСлевина - КвизРезультаты.Время) КАК Количество
		               |		ИЗ
		               |			РегистрСведений.КвизРезультаты КАК КвизРезультаты
		               |		ГДЕ
		               |			КвизРезультаты.Период >= &ДатаН
		               |			И КвизРезультаты.Время <= -3
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			КвизРезультаты.Вопрос) КАК КвизРезультаты
		               |		ПО Команды.Ссылка = КвизРезультаты.Команда
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Итоги КАК Итоги
		               |		ПО Команды.Ссылка = Итоги.Команда
		               |			И (Итоги.Период >= &Дата)
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ
		               |	И (Команды.Ссылка В (&Исключения)) = ЛОЖЬ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Команды.Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	МояКоманда,
		               |	Пометка,
		               |	ЕСТЬNULL(МАКСИМУМ(КвизРезультаты.Количество), 1) + ЕСТЬNULL(СУММА(&ЧислоСлевина - Итоги.Место), 42) УБЫВ";
	КонецЕсли;
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() <= КоличествоВопросов * 2 Тогда
		ОчиститьКеш();
		Выборка	= Запрос.Выполнить().Выбрать();
	КонецЕсли;
	Пока Выборка.Следующий() Цикл
		Если Ответы.Количество() = 0 И Выборка.Пометка Тогда
			Было.Очистить();
		ИначеЕсли Уровень > 0 И Выборка.Количество() > 3 * КоличествоВопросов И ГС.СлучайноеЧисло(0, 3) = 0 Тогда
			Продолжить;
		ИначеЕсли Вопросы.Количество() < КоличествоВопросов Тогда
			Вопросы.Добавить(Выборка.Ссылка);
			Если Уровень > 0 И ГС.СлучайноеЧисло(0, 3) = 0 Тогда
				Продолжить;
			КонецЕсли;
		КонецЕсли;
		Ответы.Добавить(Выборка.Ссылка,, Выборка.Пометка);
	КонецЦикла;
	Возврат (Ответы.Количество() > КоличествоВопросов);
КонецФункции

&НаСервере
Процедура ОчиститьКеш()
	Было.Очистить();
	Исключения.Очистить();
	Если Уровень = 2 Тогда
		Запрос = ЗапросИнит();
		Исключения.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	КонецЕсли;
	ИсключенияЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ХроносДобавить(Ответ=Неопределено)
	Если Ответ = Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Хронос.Добавить(), Новый Структура("Время,Вопрос,ЭтоВопрос", ТекущаяУниверсальнаяДатаВМиллисекундах(), ТекущийВопрос, Истина));
	Иначе
		ЗаполнитьЗначенияСвойств(Хронос.Добавить(), Новый Структура("Время,Вопрос,Ответ", ТекущаяУниверсальнаяДатаВМиллисекундах(), ТекущийВопрос, Ответ));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ХроносЗаписать()
	Ответ	= 0;
	Период	= ТекущаяДатаСеанса();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВТ.Время КАК Время,
	      	               |	ВТ.Вопрос КАК Вопрос,
	      	               |	ВТ.Ответ КАК Ответ,
	      	               |	ВТ.ЭтоВопрос КАК ЭтоВопрос
	      	               |ПОМЕСТИТЬ ВТ
	      	               |ИЗ
	      	               |	&ВТ КАК ВТ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	&Период КАК Период,
	      	               |	&Сессия КАК Сессия,
	      	               |	ВТ.Вопрос КАК Вопрос,
	      	               |	0.001 * ВЫБОР
	      	               |		КОГДА ВТ.Вопрос = ВТ1.Ответ
	      	               |			ТОГДА ВТ1.Время - ВТ.Время
	      	               |		ИНАЧЕ ВТ.Время - ВТ1.Время
	      	               |	КОНЕЦ КАК Время
	      	               |ИЗ
	      	               |	ВТ КАК ВТ
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |			ВТ1.Вопрос КАК Вопрос,
	      	               |			ВТ1.Ответ КАК Ответ,
	      	               |			МИНИМУМ(ВТ1.Время) КАК Время
	      	               |		ИЗ
	      	               |			ВТ КАК ВТ1
	      	               |		ГДЕ
	      	               |			ВТ1.ЭтоВопрос = ЛОЖЬ
	      	               |		
	      	               |		СГРУППИРОВАТЬ ПО
	      	               |			ВТ1.Вопрос,
	      	               |			ВТ1.Ответ) КАК ВТ1
	      	               |		ПО ВТ.Вопрос = ВТ1.Вопрос
	      	               |			И ВТ.Время < ВТ1.Время
	      	               |ГДЕ
	      	               |	ВТ.ЭтоВопрос = ИСТИНА");
	Запрос.УстановитьПараметр("ВТ",		Хронос.Выгрузить());
	Запрос.УстановитьПараметр("Период",	Период);
	Запрос.УстановитьПараметр("Сессия",	Сессия);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Период);
		НЗ.Отбор.Сессия.Установить(Сессия);
		НЗ.Отбор.Вопрос.Установить(Выборка.Вопрос);
		ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Выборка);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
		Ответ = Ответ + ?(Выборка.Время >= 0, Выборка.Время, -Выборка.Время);
	КонецЦикла;
	НЗ = РегистрыСведений.Квиз.СоздатьНаборЗаписей();
	НЗ.Отбор.Период.Установить(Период);
	НЗ.Отбор.Сессия.Установить(Сессия);
	ЗаполнитьЗначенияСвойств(НЗ.Добавить(), Новый Структура("Период,Сессия,Уровень,КоличествоВопросов", Период, Сессия, Уровень, КоличествоВопросов));
	НЗ.ОбменДанными.Загрузка	= Истина;
	НЗ.Записать();
	
	Хронос.Очистить();
	Возврат Окр(Ответ);
КонецФункции

&НаКлиенте
Процедура Старт()
	Вопросы.Очистить();
	Ответы.Очистить();
	Заголовок = Лев(Заголовок + "!", 42);
	Если ВопросыОтветыПолучить() Тогда
		Шаг	= 1;
		Если ВопросУстановить() Тогда
			ПравильныхОтветов	= 0;
			КоличествоВопросов	= Вопросы.Количество();
			ОсталосьВопросов	= КоличествоВопросов;
			Элементы.ОсталосьВопросов.МаксимальноеЗначение	= КоличествоВопросов;
			Таймер				= КоличествоВопросов * 3.1;
			Элементы.Таймер.МаксимальноеЗначение			= Таймер;
			Финиш				= ТекущаяДата() + Таймер;
			
			ОтветыОбновить(Истина);
			
			ПодключитьОбработчикОжидания("ТикТак", 2);
		Иначе
			Шаг = 9;
			ВидимостьУстановить();
		КонецЕсли;
		
	ИначеЕсли Исключения.Количество() > 0 Тогда
		ОчиститьКеш();
		
		Старт();
	Иначе
		ОбщегоНазначения.СообщитьОбОшибке("Ошибка при формировании вопросов");
		Элементы.СтраницаНачало.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтарт(Команда)
	Старт();
КонецПроцедуры

&НаСервере
Процедура ИсключенияЗагрузить()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Команды.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |ГДЕ
	                      |	(Команды.ПометкаУдаления = ИСТИНА
	                      |			ИЛИ РАЗМЕРХРАНИМЫХДАННЫХ(Команды.Изображение) < 64)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка");
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Исключения.НайтиПоЗначению(Выборка.Ссылка) = Неопределено Тогда
			Исключения.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	Если Уровень = 2 И ЗначениеЗаполнено(МояКоманда) И Исключения.НайтиПоЗначению(МояКоманда) = Неопределено Тогда
		Исключения.Добавить(МояКоманда);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере(Отказ)
	МояКоманда	= НаСервереПовторно.МояКомандаПолучить();
	Сессия		= НаСервереПовторно.Сессия();
	ИсключенияЗагрузить();
	КвизРезультатЛучшийУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		СтандартнаяОбработка = Ложь;
	ИначеЕсли Шаг = 0 Тогда
		//
	ИначеЕсли Шаг = 1 И ОсталосьВопросов = КоличествоВопросов Тогда
		ХроносДобавить("");
		ХроносЗаписать();
	ИначеЕсли Шаг = 1 Тогда
		Отказ	= Истина;
		Стоп(4);
	ИначеЕсли Шаг <= 3 Тогда
		Отказ	= Истина;
		Шаг		= 0;
		Элементы.КомандаСтарт.Заголовок = "Повторить";
		ВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	КоличествоВопросов	= Макс(10, КоличествоВопросов);
	ПриОткрытииНаСервере(Отказ);
	
	ОтветыТекущие.Добавить("Ответ0");
	ОтветыТекущие.Добавить("Ответ1");
	ОтветыТекущие.Добавить("Ответ2");
	ОтветыТекущие.Добавить("Ответ3");
	ОтветыТекущие.Добавить("Ответ4");
	ОтветыТекущие.Добавить("Ответ5");
КонецПроцедуры

&НаКлиенте
Процедура ПараметрыПриИзменении(Элемент)
	КвизРезультатЛучшийУстановить();
КонецПроцедуры

&НаСервере
Процедура КвизРезультатЛучшийУстановить()
	РезультатЛучший		= 0;
	КвизРезультатЛучший = "";
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Квиз.Период КАК Период,
	                      |	СУММА(КвизРезультаты.Время) КАК Время
	                      |ИЗ
	                      |	РегистрСведений.Квиз КАК Квиз
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КвизРезультаты КАК КвизРезультаты
	                      |		ПО Квиз.Период = КвизРезультаты.Период
	                      |			И Квиз.Сессия = КвизРезультаты.Сессия
	                      |ГДЕ
	                      |	Квиз.Уровень = &Уровень
	                      |	И Квиз.КоличествоВопросов = &Вопросов
	                      |	И КвизРезультаты.Время > 0
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Квиз.Сессия,
	                      |	Квиз.Период
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(КвизРезультаты.Время) = &Вопросов
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Время,
	                      |	Период УБЫВ");
	Запрос.УстановитьПараметр("Уровень",			Уровень);
	Запрос.УстановитьПараметр("Вопросов",			КоличествоВопросов);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		РезультатЛучший		= Окр(Выборка.Время);
		КвизРезультатЛучший = СтрШаблон("%1 от %2", ВремяСтрокой(Окр(Выборка.Время)), Формат(Выборка.Период, "ДЛФ=DD"));
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтчет(Команда)
	ОткрытьФорму("Отчет.КвизРезультаты.Форма", Новый Структура("Уровень,КоличествоВопросов", Уровень, КоличествоВопросов), ЭтаФорма);
КонецПроцедуры
