
&НаКлиенте
Процедура КомандыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Команды.Количество() = ЛигаКоличествоКоманд(Объект.Владелец) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		//
	//Иначе
	КонецЕсли;
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛигаКоличествоКоманд(Лига)
	Возврат СерверныйФункции.ЛигаКоличествоКоманд(Лига);
КонецФункции

&НаСервереБезКонтекста
Функция ЛигаОлимпийскаяСистема(Лига)
	Возврат СерверныйФункции.ЛигаОлимпийскаяСистема(Лига);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьИстория(Ссылка, Команда=Неопределено)
	Возврат СерверныйФункции.ЕстьИстория(Ссылка, Команда);
КонецФункции

&НаКлиенте
Процедура КомандыПередУдалением(Элемент, Отказ)
	Если ЕстьИстория(Объект.Ссылка, Элемент.ТекущиеДанные.Команда) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьУстановить()
	Если ЕстьИстория(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр			= Истина;
		//Элементы.Страна.Доступность		= Ложь;
		Элементы.ОлимпийскаяСистема.ТолькоПросмотр	= Истина;
		
	ИначеЕсли НЕ ЛигаОлимпийскаяСистема(Объект.Владелец) Тогда
		Элементы.ОлимпийскаяСистема.ТолькоПросмотр	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандыЛиги(Лига)
	Возврат СерверныйФункции.КомандыСтраны(Лига);
КонецФункции

&НаКлиенте
Процедура КомандыЛигиЗагрузить()
	//Если Объект.ОлимпийскаяСистема Тогда
	//Иначе
		КомандыЛиги.ЗагрузитьЗначения(КомандыЛиги(Объект.Владелец));
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент=Неопределено)
	Объект.ОлимпийскаяСистема = ЛигаОлимпийскаяСистема(Объект.Владелец);
	
	КомандыЛигиЗагрузить();
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВладелецПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОлимпийскаяСистемаПриИзменении(Элемент)
	КомандыЛигиЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортКоманд(Команда=Неопределено)
	УРЛ = УРЛ();
	Если Команда = Неопределено Или Объект.Команды.Количество() = 0 Тогда
		ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект), УРЛ, "Импорт команд");
	Иначе
		ПоказатьВопрос(Новый ОписаниеОповещения("ВопросИмпортДо", ЭтотОбъект), "Заменить текущий список?", РежимДиалогаВопрос.ОКОтмена, 60, КодВозвратаДиалога.Отмена, "Команды");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция УРЛ()
	Возврат ?(СтрНайти(НРег(Объект.Наименование), "англ") = 0, "", СтрШаблон("https://football.kulichki.net/england/%1/", Формат(Год(Объект.ДатаОкончания), "ЧГ=0")));
КонецФункции

&НаКлиенте
Процедура ВопросИмпортДо(КодОтвета, ПараметрКоманды) Экспорт
	Если КодОтвета = КодВозвратаДиалога.ОК Тогда
		КомандаИмпортКоманд();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Импорт(Гиперссылка, ПараметрКоманды) Экспорт
	Если ИмпортНаСервере(Гиперссылка) Тогда
		//
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка)
	Если ПустаяСтрока(Гиперссылка) Тогда Возврат Ложь; КонецЕсли;
	
	Итого	= 0;
	
	Объект.Команды.Очистить();
	КоличествоКоманд	= ЛигаКоличествоКоманд(Объект.Владелец);
	сИгра	= Новый Структура("Команда");
	мСлова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из мСлова Цикл
		Если СтрДлина(Слово) < 3
		Или СтрСравнить(Прав(Слово, 1) , ".") = 0
		Или СтрЧислоСтрок(Слово) > 1
		Тогда
			
		ИначеЕсли Объект.Команды.Количество() >= КоличествоКоманд Тогда		// финито
			Прервать;
		ИначеЕсли СтрНайти("клуб,мячи,очки", НРег(Слово)) > 0 И Объект.Команды.Количество() = 0 Тогда
		ИначеЕсли ЭтоСчетНаверное(Слово) Тогда
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда) Тогда
			сИгра.Команда	= КомандаНайти(Слово);
			Если ЗначениеЗаполнено(сИгра.Команда) Тогда
				ЗаполнитьЗначенияСвойств(Объект.Команды.Добавить(), сИгра);
				сИгра.Команда	= Неопределено;
				Итого			= Итого + 1;
			//Иначе
			//	Сообщить(Слово);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция КомандаНайти(Слово)
	Возврат СерверныйФункции.КомандаНайти(Слово);
КонецФункции

&НаСервере
Функция ЭтоСчетНаверное(Слово)
	Ответ = Ложь;
	Попытка
		Ответ	= (ТипЗнч(Вычислить(Слово)) = Тип("Число"));
	Исключение КонецПопытки;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.ОлимпийскаяСистема И НЕ ЛигаОлимпийскаяСистема(Объект.Владелец) Тогда
		Объект.ОлимпийскаяСистема = Ложь;
	КонецЕсли;
КонецПроцедуры
