
&НаКлиенте
Процедура КомандыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если Объект.Команды.Количество() = ЛигаКоличествоКоманд(Объект.Владелец) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		//
	//Иначе
	КонецЕсли;
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЛигаКоличествоКоманд(Лига)
	Возврат СерверныйФункции.ЛигаКоличествоКоманд(Лига);
КонецФункции

&НаСервереБезКонтекста
Функция ЕстьИстория(Ссылка, Команда=Неопределено)
	Возврат СерверныйФункции.ЕстьИстория(Ссылка, Команда);
КонецФункции

&НаКлиенте
Процедура КомандыПередУдалением(Элемент, Отказ)
	Если ЕстьИстория(Объект.Ссылка, Элемент.ТекущиеДанные.Команда) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьУстановить()
	Если ЕстьИстория(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр			= Истина;
		//Элементы.Страна.Доступность		= Ложь;
		Элементы.ОлимпийскаяСистема.ТолькоПросмотр	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КомандыЛиги(Лига)
	Возврат СерверныйФункции.КомандыСтраны(Лига);
КонецФункции

&НаКлиенте
Процедура КомандыЛигиЗагрузить()
	//Если Объект.ОлимпийскаяСистема Тогда
	//Иначе
		КомандыЛиги.ЗагрузитьЗначения(КомандыЛиги(Объект.Владелец));
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент=Неопределено)
	КомандыЛигиЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВладелецПриИзменении();
КонецПроцедуры

&НаКлиенте
Процедура ОлимпийскаяСистемаПриИзменении(Элемент)
	КомандыЛигиЗагрузить();
КонецПроцедуры
