
Процедура ПриНачалеРаботыСистемы()
	ОповещенияПользователя(СерверныйФункции.ОповещенияНаСегодня());
	ПодключитьОбработчикОжидания("ОповещенияНаСегодня", Часов());
КонецПроцедуры

Процедура ОповещенияПользователя(События)
	Для Каждого Событие Из События Цикл
		ПоказатьОповещениеПользователя(Событие.Ссылка, Событие.Ключ, Событие.Дата, Событие.Картинка, СтатусОповещенияПользователя.Важное, Событие.КлючУникальности);
	КонецЦикла;
КонецПроцедуры

Процедура ОповещенияНаСегодня() Экспорт
	ОповещенияПользователя(СерверныйФункции.ОповещенияНаСегодня(Истина));
КонецПроцедуры
