//	https://football.kulichki.net/england/2019/26/

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игр");
КонецПроцедуры

&НаСервере
Функция УРЛ(Тур)
	Возврат СтрШаблон("https://football.kulichki.net/england/%1/%2/", Формат(Год(Тур.Владелец.ДатаОкончания), "ЧГ=0"), Формат(Тур.Код, "ЧГ=0"));
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, ПараметрКоманды) Тогда
			Оповестить("Матчи", Чемпионат(ПараметрКоманды));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Тур)
	Итого	= 0;

	Чемпионат	= Тур.Владелец;
	ВидСпорта	= СерверныйФункции.Футбол();
	сИгра	= Новый Структура("Тур,Дата,Счет,Гол1,Гол2,КоличествоЗрителей,Комментарий,Команда1,Команда2,Стадион", Тур, Дата(1,1,1), "", 0, 0, 0, "");
	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Если СтрНайти(НРег(Слово), "таблица") > 0 Тогда		// финито
			Прервать;
		ИначеЕсли СтрЧислоСтрок(Слово) > 2
		Или СтрДлина(Слово) < 3
		Тогда
			
		ИначеЕсли Год(сИгра.Дата) < 2 Тогда
			Если СтрокаНачинаетсяЧислом(Слово) Тогда
				сИгра.Дата	= СтрокаКакДата(Слово);
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) И НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			Если СтрЧислоВхождений(Слово, "-") = 1 Тогда
				мСлова = Разделить(Слово, "-");
				сИгра.Команда1	= СерверныйФункции.КомандаНайти(мСлова.Получить(0), ВидСпорта);
				сИгра.Команда2	= СерверныйФункции.КомандаНайти(мСлова.Получить(1), ВидСпорта);
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) Или НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			сИгра.Дата	= Дата(1,1,1);
			сИгра.Команда1	= Неопределено; сИгра.Команда2	= Неопределено;
			
		ИначеЕсли СтрНайти(Слово, ":00") > 0 Или СтрНайти(Слово, ":30") > 0 Тогда
			сИгра.Дата	= Дата(1,1,1);
			сИгра.Команда1	= Неопределено; сИгра.Команда2	= Неопределено;
		ИначеЕсли СтрСравнить(Слово, "ОТМ") = 0 Тогда
			сИгра.Дата	= Дата(1,1,1);
			сИгра.Команда1	= Неопределено; сИгра.Команда2	= Неопределено;
			
		ИначеЕсли СтрЧислоВхождений(Слово, ":") = 2 И СтрЗаканчиваетсяНа(Слово, ")") Тогда
			мСлова = Разделить(Слово);
			сИгра.Счет	= ?(мСлова.Количество() = 0, "", мСлова.Получить(0));
			мСлова = Разделить(сИгра.Счет, ":");
			Если мСлова.Количество() = 2 Тогда
				сИгра.Гол1	= СтрокаКакЧисло(мСлова.Получить(0));
				сИгра.Гол2	= СтрокаКакЧисло(мСлова.Получить(1));
			Иначе
				сИгра.Дата		= Дата(1,1,1);
			КонецЕсли;
			
			Если НЕ ПустаяСтрока(сИгра.Счет)
			И Год(сИгра.Дата) > 2000
			Тогда
				Матч = СерверныйФункции.МатчНайти(сИгра.Команда1, сИгра.Тур);
				Если ЗначениеЗаполнено(Матч) Тогда
					Док = Матч.ПолучитьОбъект();
					Если Док.Проведен Тогда
						//
					Иначе
						Если Док.ПометкаУдаления Тогда
							Док.УстановитьПометкуУдаления(Ложь);
						КонецЕсли;
						Если Док.Команды.Количество() = 2
						И Док.Команды.Получить(0).Команда = сИгра.Команда1
						И Док.Команды.Получить(1).Команда = сИгра.Команда2
						Тогда
							//
						Иначе
							Док.Команды.Очистить();
							Док.СоставыКоманд.Очистить();
						КонецЕсли;
						ЗаполнитьЗначенияСвойств(Док, сИгра);
					КонецЕсли;
				Иначе
					Док = Документы.Матч.СоздатьДокумент();
					ЗаполнитьЗначенияСвойств(Док, сИгра);
				КонецЕсли;
				Если Док.Команды.Количество() = 0 Тогда
					ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Новый Структура("Команда,КоличествоГолов", сИгра.Команда1, сИгра.Гол1));
					ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Новый Структура("Команда,КоличествоГолов", сИгра.Команда2, сИгра.Гол2));
				КонецЕсли;
				Док.Стадион = СерверныйФункции.СтадионНайти(сИгра.Команда1);
				Если Док.ПроверитьЗаполнение() Тогда
					Попытка
						Док.Записать(РежимЗаписиДокумента.Проведение);
						Итого = Итого + 1;
					Исключение
						Сообщить(ОписаниеОшибки());
						Прервать;
					КонецПопытки;
				ИначеЕсли ЗначениеЗаполнено(Док.Ссылка) Тогда
					ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Док.Ссылка);
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
				КонецЕсли;
			КонецЕсли;
			сИгра.Дата		= Дата(1,1,1);
			сИгра.Команда1	= Неопределено; сИгра.Команда2	= Неопределено;
			сИгра.Счет		= "";
		//Иначе
		//	Сообщить(Слово);
		КонецЕсли;
	КонецЦикла;
	
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Процедура ГолыОпределить(Слово, сИгра)
КонецПроцедуры

&НаСервере
Функция ТурПолучить(Слово, Чемпионат, Тур)
	Слова = Разделить(Слово, "-");
	Если Слова.Количество() > 0 И СтрокаКакЧисло(Слова.Получить(0)) > 0 Тогда
		Возврат ТурНайти(Лев(Слово, СтрДлина(Слово) / 2), Чемпионат);
	КонецЕсли;
	Возврат Тур;
КонецФункции

&НаСервере
Функция ТурНайти(Наименование, Чемпионат)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Туры.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.Туры КАК Туры
	               |ГДЕ
	               |	Туры.Владелец = &Чемпионат
	               |	И Туры.ПометкаУдаления = ЛОЖЬ
	               |	И (Туры.Наименование ПОДОБНО &Наименование
	               |			ИЛИ Туры.Код = &Код)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Туры.Код";
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Запрос.УстановитьПараметр("Наименование",	Наименование + "%");
	Запрос.УстановитьПараметр("Код",			СтрокаКакЧисло(Наименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Туры.ПустаяСсылка();
КонецФункции

&НаСервере
Функция Строка2Дата(Слово, Знач ДатаНачала)
	Ответ = Дата(1,1,1);
	Если СтрНайти("123456789", Лев(Слово, 1)) > 0 Тогда
		Попытка
			ДД = СтрокаКакЧисло(Лев(Слово, СтрНайти(Слово, " ") - 1));
			Если ДД > 0 И ДД < 32 Тогда
				Пока День(ДатаНачала) <> ДД Цикл
					ДатаНачала = ДатаНачала + Сутки();
				КонецЦикла;
				Ответ = ДатаНачала;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СтрокаКакДата(Знач Слово)
	Ответ = Дата(1,1,1);
	Если СтрНайти(Слово, " ") = 0 Тогда
		Попытка
			Если СтрДлина(Слово) = 10 Тогда
				Ответ = Дата(Сред(Слово, 7, 4) + Сред(Слово, 4, 2) + Лев(Слово, 2));
			Иначе
				Слова = Разделить(Слово, ".");
				Если Слова.Количество() = 3 Тогда
					Ответ = Дата(Слова.Получить(2) + Прав("0" + Слова.Получить(1), 2) + Прав("0" + Слова.Получить(0), 2));
				КонецЕсли;
			КонецЕсли;
		Исключение КонецПопытки;
	Иначе
		Мезе	= 0;
		Жьорно	= 0;
		Для Каждого Строка Из Разделить(Слово) Цикл
			Если Жьорно = 0 Тогда
				Жьорно	= СтрокаКакЧисло(Строка);
			ИначеЕсли СтрокаКакМесяц(Строка) > 0 Тогда
				Мезе	= СтрокаКакМесяц(Строка);
			КонецЕсли;
		КонецЦикла;
		Если Мезе > 0 И Жьорно > 0 Тогда
			Попытка
				Ответ = Дата(Год(ТекущаяДатаСеанса()), Мезе, Жьорно);
				Если Ответ > ТекущаяДатаСеанса() Тогда
					Ответ = Дата(Год(ТекущаяДатаСеанса()) - 1, Мезе, Жьорно);
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция Чемпионат(Тур)
	Возврат Тур.Владелец;
КонецФункции
