//	https://football.kulichki.net/england/2019/26/

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игр");
КонецПроцедуры

&НаСервере
Функция УРЛ(Тур)
	Ответ = СерверныйФункции.КомментарийКакУРЛ(Тур.Комментарий);
	Возврат ?(ПустаяСтрока(Ответ), СтрШаблон("https://football.kulichki.net/england/%1/%2/", Формат(Год(Тур.Владелец.ДатаОкончания), "ЧГ=0"), Формат(Тур.Код, "ЧГ=0")), Ответ);
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, Тур) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, Тур) Тогда
			Оповестить("Матчи", Чемпионат(Тур));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Тур)
	Возврат СерверныйФункции.ИмпортИгр(Гиперссылка, Тур);
КонецФункции

&НаСервере
Функция Чемпионат(Тур)
	Возврат Тур.Владелец;
КонецФункции
