
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игр");
КонецПроцедуры

&НаСервере
Функция УРЛ(Тур)
	Возврат СерверныйФункции.ИмпортУРЛ(Тур);
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, Тур) Экспорт
	Если ПустаяСтрока(УРЛ) Тогда
		//
	ИначеЕсли ИмпортНаСервере(УРЛ, Тур) Тогда
		НаКлиенте.Оповещение("Матчи", Чемпионат(Тур));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Тур)
	Ответ	= Ложь;
	Если ЭтоУРЛ(Гиперссылка) Тогда
		Ответ	= СерверныйФункции.ИмпортИгрПоГиперссылке(Гиперссылка, Тур);
	Иначе
		Слово = СтрПолучитьСтроку(Гиперссылка, 1);
		Если СтрНайти(Слово, "Счет") > 0 И СтрНайти2(Слово, "дата, время") > 0 Тогда
			Ответ	= СерверныйФункции.ИмпортИгрПоСтроке2(Гиперссылка, Тур);
		Иначе
			Ответ	= СерверныйФункции.ИмпортИгрПоСтроке(Гиперссылка, Тур);
		КонецЕсли;
	КонецЕсли;
	Если Ответ Тогда
		Справочники.Туры.ДатыУстановить(Тур);
		ИтогиОбновить(Тур.Владелец);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция Чемпионат(Тур)
	Возврат Тур.Владелец;
КонецФункции

&НаСервере
Процедура ИтогиОбновить(Чемпионат)
	Если ЗначениеЗаполнено(СерверныйФункции.Чемпион(Чемпионат)) Тогда
		РегистрыСведений.Итоги.Обновить(Чемпионат, Истина);
	КонецЕсли;
КонецПроцедуры
