//	https://football.kulichki.net/england/2019/26/

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игр");
КонецПроцедуры

&НаСервере
Функция УРЛ(Тур)
	Возврат СтрШаблон("https://football.kulichki.net/england/%1/%2/", Формат(Год(Тур.Владелец.ДатаОкончания), "ЧГ=0"), Формат(Тур.Код, "ЧГ=0"));
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, ПараметрКоманды) Тогда
			Оповестить("Матчи", Чемпионат(ПараметрКоманды));
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Тур)
	Итого	= 0;

	Чемпионат	= Тур.Владелец;
	ВидСпорта	= СерверныйФункции.Футбол();
	сИгра	= Новый Структура("Тур,Дата,Счет,Гол1,Гол2,КоличествоЗрителей,Комментарий,Команда1,Команда2,Стадион", Тур, Дата(1,1,1), "", 0, 0, 0, "");
	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Если СтрНайти(НРег(Слово), "таблица") > 0 Тогда		// финито
			Прервать;
		ИначеЕсли СтрЧислоСтрок(Слово) > 2
		Или СтрДлина(Слово) < 3
		Тогда
			
		ИначеЕсли Год(сИгра.Дата) < 2 Тогда
			Если СтрокаНачинаетсяЧислом(Слово) Тогда
				сИгра.Дата	= СтрокаКакДата(Слово, сИгра.Тур);
				Если Год(сИгра.Дата) < 2 Тогда
					сИгра.Тур = ТурПолучить(Слово, Чемпионат, Тур);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) И НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			Если СтрЧислоВхождений(Слово, "-") = 1 Тогда
				мСлова = Разделить(Слово, "-");
				сИгра.Команда1	= СерверныйФункции.КомандаНайти(мСлова.Получить(0), ВидСпорта);
				сИгра.Команда2	= СерверныйФункции.КомандаНайти(мСлова.Получить(1), ВидСпорта);
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) Или НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			Зачистить(сИгра);
			
		ИначеЕсли СтрНайти(Слово, ":00") > 0 Или СтрНайти(Слово, ":30") > 0 Тогда
			Зачистить(сИгра);
		ИначеЕсли СтрСравнить(Слово, "ОТМ") = 0 Тогда
			Зачистить(сИгра);
			
		ИначеЕсли ГолыОпределить(сИгра, Слово) Тогда
			Матч = СерверныйФункции.МатчНайти(сИгра.Команда1, сИгра.Тур);
			Если ЗначениеЗаполнено(Матч) Тогда
				Док = Матч.ПолучитьОбъект();
				Если НачалоДня(Док.Дата) <> сИгра.Дата Тогда
					Док.Дата = сИгра.Дата;
				КонецЕсли;
				Если Док.Проведен Тогда
					//
				Иначе
					Если Док.ПометкаУдаления Тогда
						Док.ПометкаУдаления = Ложь;
					КонецЕсли;
					Если Док.Команды.Количество() = 2
					И Док.Команды.Получить(0).Команда = сИгра.Команда1
					И Док.Команды.Получить(1).Команда = сИгра.Команда2
					Тогда
						//
					Иначе
						Док.Команды.Очистить();
						Док.СоставыКоманд.Очистить();
					КонецЕсли;
					ЗаполнитьЗначенияСвойств(Док, сИгра);
				КонецЕсли;
			Иначе
				Док = Документы.Матч.СоздатьДокумент();
				ЗаполнитьЗначенияСвойств(Док, сИгра);
			КонецЕсли;
			Если Док.Команды.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Новый Структура("Команда,КоличествоГолов", сИгра.Команда1, сИгра.Гол1));
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), Новый Структура("Команда,КоличествоГолов", сИгра.Команда2, сИгра.Гол2));
			КонецЕсли;
			ОбщегоНазначения.УстановитьЗначение(Док.Стадион, СерверныйФункции.СтадионНайти(сИгра.Команда1));
			Если НЕ Док.Модифицированность() Тогда
				//
			ИначеЕсли Док.ПроверитьЗаполнение() Тогда
				Попытка
					Док.Записать(РежимЗаписиДокумента.Проведение);
					Итого = Итого + 1;
				Исключение
					Сообщить(ОписаниеОшибки());
					Прервать;
				КонецПопытки;
			ИначеЕсли ЗначениеЗаполнено(Док.Ссылка) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки(),, Док.Ссылка);
			Иначе
				ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
			КонецЕсли;
			Зачистить(сИгра);
		//Иначе
		//	Сообщить(Слово);
		КонецЕсли;
	КонецЦикла;
	
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Процедура Зачистить(Виктим)
	ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Дата,Счет,Гол1,Гол2,Команда1,Команда2", Дата(1,1,1), "", 0, 0));
КонецПроцедуры

&НаСервере
Функция ГолыОпределить(сИгра, Слово)
	Если СтрЧислоВхождений(Слово, ":") = 2 И СтрЗаканчиваетсяНа(Слово, ")") Тогда
		мСлова = Разделить(Слово);
		сИгра.Счет	= ?(мСлова.Количество() = 0, "", мСлова.Получить(0));
		Если НЕ ПустаяСтрока(сИгра.Счет) Тогда
			мСлова = Разделить(сИгра.Счет, ":");
			Если мСлова.Количество() = 2 Тогда
				сИгра.Гол1	= СтрокаКакЧисло(мСлова.Получить(0));
				сИгра.Гол2	= СтрокаКакЧисло(мСлова.Получить(1));
			Иначе
				Зачистить(сИгра);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат (НЕ ПустаяСтрока(сИгра.Счет));
КонецФункции

&НаСервере
Функция ТурПолучить(Слово, Чемпионат, Тур)
	Слова = Разделить(Слово, "-");
	Если Слова.Количество() = 2
	И СтрНайти(НРег(Слова.Получить(1)), "тур") > 0
	И СтрокаКакЧисло(Слова.Получить(0)) > 0 Тогда
		//Возврат ТурНайти(Лев(Слово, СтрДлина(Слово) / 2), Чемпионат);
		Ответ = ТурНайти(Слова.Получить(0), Чемпионат);
		Если ЗначениеЗаполнено(Ответ) Тогда
			Возврат Ответ;
		КонецЕсли;
	КонецЕсли;
	Возврат Тур;
КонецФункции

&НаСервере
Функция ТурНайти(КодИлиНаименование, Чемпионат)
	Возврат СерверныйФункции.ТурНайти(КодИлиНаименование, Чемпионат);
КонецФункции

&НаСервере
Функция Строка2Дата(Слово, Знач ДатаНачала)
	Ответ = Дата(1,1,1);
	Если СтрНайти("123456789", Лев(Слово, 1)) > 0 Тогда
		Попытка
			ДД = СтрокаКакЧисло(Лев(Слово, СтрНайти(Слово, " ") - 1));
			Если ДД > 0 И ДД < 32 Тогда
				Пока День(ДатаНачала) <> ДД Цикл
					ДатаНачала = ДатаНачала + Сутки();
				КонецЦикла;
				Ответ = ДатаНачала;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция СтрокаКакДата(Знач Слово, Тур)
	Ответ = Дата(1,1,1);
	Если СтрНайти(Слово, " ") = 0 Тогда
		Попытка
			Если СтрДлина(Слово) = 10 Тогда
				Ответ = Дата(Сред(Слово, 7, 4) + Сред(Слово, 4, 2) + Лев(Слово, 2));
			Иначе
				Слова = Разделить(Слово, ".");
				Если Слова.Количество() = 3 Тогда
					Ответ = Дата(Слова.Получить(2) + Прав("0" + Слова.Получить(1), 2) + Прав("0" + Слова.Получить(0), 2));
				КонецЕсли;
			КонецЕсли;
		Исключение КонецПопытки;
	Иначе
		Мезе	= 0;
		Жьорно	= 0;
		Для Каждого Строка Из Разделить(Слово) Цикл
			Если Жьорно = 0 Тогда
				Жьорно	= СтрокаКакЧисло(Строка);
			ИначеЕсли СтрокаКакМесяц(Строка) > 0 Тогда
				Мезе	= СтрокаКакМесяц(Строка);
			КонецЕсли;
		КонецЦикла;
		Если Мезе > 0 И Жьорно > 0 Тогда
			Попытка
				Ответ = Дата(Год(Тур.ДатаНачала), Мезе, Жьорно);
				Если Ответ < Тур.ДатаНачала Тогда
					Ответ = Дата(Год(Тур.ДатаНачала) + 1, Мезе, Жьорно);
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция Чемпионат(Тур)
	Возврат Тур.Владелец;
КонецФункции
