
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игр");
КонецПроцедуры

&НаСервере
Функция УРЛ(Тур)
	Возврат СерверныйФункции.ИмпортУРЛ(Тур);
КонецФункции

&НаКлиенте
Процедура Импорт(УРЛ, Тур) Экспорт
	Если ПустаяСтрока(УРЛ) Тогда
		//
	ИначеЕсли ИмпортНаСервере(УРЛ, Тур) Тогда
		Оповестить("Матчи", Чемпионат(Тур));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Тур)
	Ответ	= Ложь;
	Если ЭтоУРЛ(Гиперссылка) Тогда
		Ответ	= СерверныйФункции.ИмпортИгрПоГиперссылке(Гиперссылка, Тур);
	Иначе
		Ответ	= СерверныйФункции.ИмпортИгрПоСтроке(Гиперссылка, Тур);
	КонецЕсли;
	
	Если Ответ Тогда
		Справочники.Туры.ДатыУстановить(Тур);
		Если ЗначениеЗаполнено(СерверныйФункции.Чемпион(Тур.Владелец)) Тогда
			РегистрыСведений.Итоги.Обновить(Тур.Владелец, Истина);
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция Чемпионат(Тур)
	Возврат Тур.Владелец;
КонецФункции
