
Функция КаталогаФайлов() Экспорт
	Возврат ПараметрыСеанса.КаталогаФайлов;
КонецФункции

Функция НайтиПоНаименованию(Наименование, СправочникИмя="ВидыСпорта")
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Справочник.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ВидыСпорта КАК Справочник
	                      |ГДЕ
	                      |	Справочник.Наименование = &Наименование
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Справочник.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование",			Наименование);
	Запрос.Текст	= СтрЗаменить(Запрос.Текст, "ВидыСпорта", СправочникИмя);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники[СправочникИмя].ПустаяСсылка();
КонецФункции

Процедура ПервоначальноеЗаполнение() Экспорт
	Объект	= Справочники.ВидыСпорта.Футбол.ПолучитьОбъект();
	ОбщегоНазначения.УстановитьЗначение(Объект.Наименование,	"Футбол");
	ОбщегоНазначения.УстановитьЗначение(Объект.Ничья,	1);
	ОбщегоНазначения.УстановитьЗначение(Объект.Победа,	3);
	Если Объект.Модифицированность() Тогда
		Объект.Записать();
	КонецЕсли;
	
	СписокШиндлера = Новый Массив;
	СписокШиндлера.Добавить("Вратарь");
	СписокШиндлера.Добавить("Защитник");
	СписокШиндлера.Добавить("Полузащитник");
	СписокШиндлера.Добавить("Нападающий");
	Для Каждого ТекЭлемент Из СписокШиндлера Цикл
		Если Амплуа(ТекЭлемент).Пустая() Тогда
			Объект = Справочники.Амплуа.СоздатьЭлемент();
			Объект.Наименование	= ТекЭлемент;
			Объект.Владелец		= Футбол();
			Объект.УстановитьНовыйКод();
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Страна = Справочники.Страны.ПустаяСсылка();
	СписокШиндлера.Очистить();
	СписокШиндлера.Добавить("Англия");
	Для Каждого ТекЭлемент Из СписокШиндлера Цикл
		Страна = НайтиПоНаименованию(ТекЭлемент, "Страны");
		Если Страна.Пустая() Тогда
			Объект = Справочники.Страны.СоздатьЭлемент();
			Объект.Код			= "ENG";
			Объект.Наименование	= ТекЭлемент;
			Объект.Записать();
			
			Страна = Объект.Ссылка;
		КонецЕсли;
	КонецЦикла;
	
	Лига = Неопределено;
	СписокШиндлера.Очистить();
	СписокШиндлера.Добавить("Английская премьер лига");
	Для Каждого ТекЭлемент Из СписокШиндлера Цикл
		Ссылка = НайтиПоНаименованию(ТекЭлемент, "Лига");
		Если Ссылка.Пустая() Тогда
			Объект = Справочники.Лига.СоздатьЭлемент();
			Объект.Наименование	= ТекЭлемент;
			Объект.Владелец		= Футбол();
			Объект.Страна		= Страна;
			Объект.КоличествоКоманд		= 20;
			Объект.КоличествоРотация	= 3;
			Объект.Квалификация			= 4;
			Объект.УстановитьНовыйКод();
			Объект.Записать();
			
			Лига = Объект;
		Иначе
			Лига = Ссылка.ПолучитьОбъект();
		КонецЕсли;
	КонецЦикла;
	
	ЧтениеJSON	= Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ПолучитьОбщийМакет("ПервоначальноеЗаполнение").ПолучитьТекст());
	СписокШиндлера = ПрочитатьJSON(ЧтениеJSON);
	
	Для Каждого ТекЭлемент Из СписокШиндлера Цикл
		Если НайтиПоНаименованию(ТекЭлемент.Город, "Города").Пустая() Тогда
			Объект = Справочники.Города.СоздатьЭлемент();
			Объект.Наименование	= ТекЭлемент.Город;
			Объект.Владелец		= Страна;
			Объект.УстановитьНовыйКод();
			Объект.Записать();
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого ТекЭлемент Из СписокШиндлера Цикл
		Команда = КомандаНайти(ТекЭлемент.Наименование, Страна);
		Если Команда.Пустая() Тогда
			Команда = КомандыСоздать(ТекЭлемент.Наименование, ТекЭлемент.Город, Футбол());
			Если СтрСравнить(Команда.Аббревиатура, ТекЭлемент.Аббревиатура) <> 0 Тогда
				Попытка
					оКоманда	= Команда.ПолучитьОбъект();
					оКоманда.Аббревиатура	= ТекЭлемент.Аббревиатура;
					оКоманда.Записать();
				Исключение КонецПопытки;
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Команда) Тогда
			Если ТипЗнч(Лига) = Тип("СправочникОбъект.Лига") Тогда
				Гугл = Новый Структура("Команда", Команда);
				Если Лига.Команды.НайтиСтроки(Гугл).Количество() = 0 Тогда
					ЗаполнитьЗначенияСвойств(Лига.Команды.Добавить(), Гугл);
				КонецЕсли;
			КонецЕсли;
			Если СтрСравнить(ТекЭлемент.Наименование, МояКоманда()) = 0 Тогда
				Константы.МояКоманда.Установить(Команда);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если ТипЗнч(Лига) = Тип("СправочникОбъект.Лига") И Лига.Модифицированность() Тогда
		Объект.Записать();
	КонецЕсли;
	
	НастройкиСохранить();
КонецПроцедуры

Функция МояКомандаПолучить(ТакиАрсенал=Истина) Экспорт
	МояКоманда	= Константы.МояКоманда.Получить();
	Если ТакиАрсенал И НЕ ЗначениеЗаполнено(МояКоманда) Тогда
		МояКоманда	= КомандаНайти(МояКоманда(), СтранаНайти("ENG"));
	КонецЕсли;
	Возврат МояКоманда;
КонецФункции

Функция МояКоманда()
	Возврат "Арсенал";
КонецФункции

Функция КомандыСоздать(Наименование, Город="", ВидыСпорта=Неопределено) Экспорт
	Объект = Справочники.Команды.СоздатьЭлемент();
	Объект.Наименование	= Наименование;
	Объект.Владелец		= ?(ВидыСпорта=Неопределено, Футбол(), ВидыСпорта);
	Объект.Город		= НайтиПоНаименованию(?(ПустаяСтрока(Город), Наименование, Город), "Города");
	Объект.УстановитьНовыйКод();
	Попытка
		Объект.Записать();
		Возврат Объект.Ссылка;
	Исключение
	КонецПопытки;
	Возврат Справочники.Команды.ПустаяСсылка();
КонецФункции

Функция ДанныеИгрока(Игрок, Дата=Неопределено) Экспорт
	Данные = Новый Структура("Команда,Амплуа,Номер", Справочники.Команды.ПустаяСсылка(), Справочники.Амплуа.ПустаяСсылка(), "");
	Если ЗначениеЗаполнено(Игрок) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Перемещения.Команда КАК Команда,
		                      |	Перемещения.Амплуа КАК Амплуа,
		                      |	Перемещения.Номер КАК Номер
		                      |ИЗ
		                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, Игрок = &Игрок) КАК Перемещения");
		Запрос.УстановитьПараметр("Игрок",			Игрок);
		Запрос.УстановитьПараметр("Дата",			?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Данные, Выборка);
		КонецЕсли;
	КонецЕсли;
	Возврат Данные;
КонецФункции

Функция КомандаИгрока(Игрок, Дата=Неопределено) Экспорт
	Если ЗначениеЗаполнено(Игрок) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Перемещения.Команда КАК Команда
		                      |ИЗ
		                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, Игрок = &Игрок) КАК Перемещения");
		Запрос.УстановитьПараметр("Игрок",			Игрок);
		Запрос.УстановитьПараметр("Дата",			?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Команда;
		КонецЕсли;
	КонецЕсли;
	Возврат Справочники.Команды.ПустаяСсылка();
КонецФункции

Функция СоставКоманды(Команда, Дата=Неопределено) Экспорт
	Ответ	= Новый Массив;
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Перемещения.Игрок КАК Игрок
		                      |ИЗ
		                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК Перемещения
		                      |ГДЕ
		                      |	Перемещения.Команда = &Команда");
		Запрос.УстановитьПараметр("Команда",		Команда);
		Запрос.УстановитьПараметр("Дата",			?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса()));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Ответ.Добавить(Выборка.Игрок);
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция КомандыЛиги(Лига, Топ6=Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЧемпионатыКоманды.Команда КАК Команда
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка.Владелец В(&Лига)");
	Если Топ6 Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 6
		               |	ЛигаКоманды.Команда КАК Команда
		               |ИЗ
		               |	Справочник.Лига.Команды КАК ЛигаКоманды
		               |ГДЕ
		               |	ЛигаКоманды.Ссылка = &Лига
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЛигаКоманды.Команда = &Команда УБЫВ";
		Запрос.УстановитьПараметр("Команда",	МояКомандаПолучить());
	ИначеЕсли ЗначениеЗаполнено(Лига.Страна) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЧемпионатыКоманды.Команда КАК Команда
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка.Владелец = &Лига
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция КомандыСтраны(Параметр) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЧемпионатыКоманды.Команда КАК Команда
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
	                      |			ПО Чемпионаты.Владелец = Лига.Ссылка
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	Лига.Страна = &Параметр
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ
	                      |	Команды.Ссылка
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	                      |		ПО Команды.Город = Города.Ссылка
	                      |ГДЕ
	                      |	Команды.ПометкаУдаления = ЛОЖЬ
	                      |	И Города.Владелец = &Параметр
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Команда
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Лига") И ЗначениеЗаполнено(Параметр.Страна) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	СправочникКоманды.Ссылка КАК Команда
		               |ИЗ
		               |	Справочник.Команды КАК СправочникКоманды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
		               |			ПО Города.Владелец = Лига.Страна
		               |		ПО СправочникКоманды.Город = Города.Ссылка
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО СправочникКоманды.Ссылка = ТурнирнаяТаблица.Команда
		               |ГДЕ
		               |	СправочникКоманды.ПометкаУдаления = ЛОЖЬ
		               |	И ВЫБОР
		               |			КОГДА СправочникКоманды.Город = ЗНАЧЕНИЕ(Справочник.Города.ПустаяСсылка)
		               |				ТОГДА ТурнирнаяТаблица.Команда ЕСТЬ NULL
		               |			ИНАЧЕ СправочникКоманды.Владелец = Лига.Владелец
		               |					И Лига.Ссылка = &Параметр
		               |		КОНЕЦ
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЧемпионатыКоманды.Команда
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
		               |ГДЕ
		               |	Чемпионаты.Владелец = &Параметр
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Лига") Тогда
		Возврат КомандыЛиги(Параметр);
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",			Параметр);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция КомандыТура(Тур, Все=Ложь) Экспорт
	Ответ	= Новый Массив;
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ЧемпионатыКоманды.Команда КАК Команда
	      	               |ИЗ
	      	               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО ЧемпионатыКоманды.Команда = ТурнирнаяТаблица.Команда
	      	               |			И (ТурнирнаяТаблица.Тур = &Тур)
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |		ПО ЧемпионатыКоманды.Ссылка = Туры.Владелец
	      	               |ГДЕ
	      	               |	Туры.Ссылка = &Тур
	      	               |	И ТурнирнаяТаблица.Команда ЕСТЬ NULL
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Команда
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если Тур.ОлимпийскаяСистема Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Туры.Ссылка КАК Тур,
		               |	Туры.Владелец КАК Владелец,
		               |	Туры.Код КАК Код,
		               |	Туры.Код - ВЫБОР
		               |		КОГДА Туры.ОлимпийскаяСистема = ИСТИНА
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Код1,
		               |	ВЫБОР
		               |		КОГДА Туры.ОлимпийскаяСистема = ИСТИНА
		               |				И Туры.Код = 1
		               |			ТОГДА 0
		               |		КОГДА Туры.ОлимпийскаяСистема = ИСТИНА
		               |			ТОГДА 3
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Коэффициент
		               |ПОМЕСТИТЬ Туры
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |ГДЕ
		               |	Туры.Ссылка = &Тур
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЧемпионатыКоманды.Команда КАК Команда
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		               |		ПО ЧемпионатыКоманды.Ссылка = Туры.Владелец
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО ЧемпионатыКоманды.Ссылка = ТурнирнаяТаблица.Тур.Владелец
		               |ГДЕ
		               |	ЕСТЬNULL(ТурнирнаяТаблица.Тур.Код, 1) МЕЖДУ Туры.Код1 И Туры.Код
		               |	И ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, Туры.Код1) >= Туры.Коэффициент
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЧемпионатыКоманды.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли Все Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЧемпионатыКоманды.Команда КАК Команда
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО ЧемпионатыКоманды.Команда = ТурнирнаяТаблица.Команда
		               |			И (ТурнирнаяТаблица.Тур = &Тур)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ЧемпионатыКоманды.Ссылка = Туры.Владелец
		               |ГДЕ
		               |	Туры.Ссылка = &Тур
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Тур",			Тур);
	Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Если Ответ.Количество() = 0 И Тур.ОлимпийскаяСистема Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Туры.Ссылка КАК Тур,
		               |	Туры.Владелец КАК Владелец,
		               |	Туры.ДатаОкончания КАК ДатаОкончания,
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество,
		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков
		               |ПОМЕСТИТЬ Туры
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры1
		               |			ПО Туры.Владелец = Туры1.Владелец
		               |				И Туры.Код < Туры1.Код
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Туры1.Ссылка = &Тур
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Туры.Ссылка,
		               |	Туры.ДатаОкончания,
		               |	Туры.Владелец,
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	Туры.ДатаОкончания = МАКСИМУМ(Туры.ДатаОкончания)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Команда КАК Команда
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур = &Тур
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ТурнирнаяТаблица.Команда
		               |
		               |ИМЕЮЩИЕ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) = 1
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ЧемпионатыКоманды.Команда
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Туры КАК Туры
		               |		ПО ЧемпионатыКоманды.Ссылка = Туры.Владелец
		               |ГДЕ
		               |	ВЫБОР
		               |			КОГДА Туры.Количество = 1
		               |				ТОГДА Туры.КоличествоОчков >= 2
		               |			КОГДА Туры.Количество = 2
		               |				ТОГДА Туры.КоличествоОчков > 3
		               |			ИНАЧЕ ЛОЖЬ
		               |		КОНЕЦ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
		Ответ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция КомандыЧемпионата(Чемпионат) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЧемпионатыКоманды.Команда КАК Команда
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Команда
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция КомандаНайти(Наименование, Владелец=Неопределено) Экспорт
	Если ПустаяСтрока(Наименование) Тогда Возврат Справочники.Команды.ПустаяСсылка();
	ИначеЕсли СтрДлина(Наименование) > 99 Тогда Возврат Справочники.Команды.ПустаяСсылка();
	ИначеЕсли ТипЗнч(Владелец) = Тип("Структура") Тогда
		Команда	= Владелец.Команды.Получить(Наименование);
		Если НЕ ЗначениеЗаполнено(Команда) Тогда
			Команда	= КомандаНайти(Наименование, Владелец.Чемпионат);
			Если ЗначениеЗаполнено(Команда) Тогда
				Владелец.Команды.Вставить(Наименование, Команда);
			КонецЕсли;
		КонецЕсли;
		Возврат Команда;
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Команды.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |ГДЕ
	                      |	Команды.Владелец = &ВидСпорта
	                      |	И (Команды.Наименование = &Наименование
	                      |			ИЛИ Команды.Комментарий ПОДОБНО &Комментарий)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Команды.Наименование = &Наименование УБЫВ,
	                      |	Команды.ПометкаУдаления");
	Запрос.УстановитьПараметр("ВидСпорта",		?(ЗначениеЗаполнено(Владелец), Владелец, Футбол()));
	Если ТипЗнч(Владелец) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Тимз.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Тимз
		               |		ПО ЧемпионатыКоманды.Команда = Тимз.Ссылка
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка = &Владелец
		               |	И (Тимз.Наименование = &Наименование
		               |			ИЛИ Тимз.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Тимз.Наименование = &Наименование УБЫВ,
		               |	Тимз.ПометкаУдаления";
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Туры") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Тимз.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Тимз
		               |		ПО ЧемпионатыКоманды.Команда = Тимз.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ЧемпионатыКоманды.Ссылка = Туры.Владелец
		               |ГДЕ
		               |	Туры.Ссылка = &Владелец
		               |	И (Тимз.Наименование = &Наименование
		               |			ИЛИ Тимз.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Тимз.Наименование = &Наименование УБЫВ,
		               |	Тимз.ПометкаУдаления";
	ИначеЕсли ТипЗнч(Владелец) = Тип("СправочникСсылка.Страны") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Команды.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |		ПО Команды.Город = Города.Ссылка
		               |ГДЕ
		               |	(Команды.Наименование = &Наименование
		               |			ИЛИ Команды.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Города.Владелец = &Владелец УБЫВ,
		               |	Команды.Наименование = &Наименование УБЫВ,
		               |	Команды.ПометкаУдаления";
	КонецЕсли;
	Запрос.УстановитьПараметр("Наименование",	СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Комментарий",	Обернуть(Наименование));
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Команды.ПустаяСсылка();
КонецФункции

Функция ГородНайти(Наименование, Страна=Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Города.Ссылка КАК Ссылка,
	                      |	Команды.Город ЕСТЬ NULL КАК Порядок
	                      |ИЗ
	                      |	Справочник.Города КАК Города
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	                      |		ПО Города.Ссылка = Команды.Город
	                      |			И (Команды.Ссылка В (&Команда))
	                      |ГДЕ
	                      |	(Города.Наименование = &Наименование
	                      |			ИЛИ Города.Комментарий ПОДОБНО &Комментарий)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок,
	                      |	Города.Наименование = &Наименование УБЫВ,
	                      |	Города.ПометкаУдаления");
	Если ТипЗнч(Наименование) = Тип("Массив") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Команды.Город КАК Ссылка
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |ГДЕ
		               |	Команды.Ссылка В(&Команда)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Команды.Город.ПометкаУдаления";
	ИначеЕсли ЗначениеЗаполнено(Страна) Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Города.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Города КАК Города
		               |ГДЕ
		               |	(Города.Наименование = &Наименование
		               |			ИЛИ Города.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Города.Владелец = &Страна УБЫВ,
		               |	Города.Наименование = &Наименование УБЫВ,
		               |	Города.ПометкаУдаления";
		Запрос.УстановитьПараметр("Страна",					Страна);
	КонецЕсли;
	Запрос.УстановитьПараметр("Команда",				Наименование);
	Запрос.УстановитьПараметр("Наименование",			СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Комментарий",			Обернуть(Наименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Города.ПустаяСсылка();
КонецФункции

Функция СтадионНайти(Параметр, Все=Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Стадионы.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	(ВЫБРАТЬ
	                      |		Стадионы.Ссылка КАК Ссылка,
	                      |		ВЫБОР
	                      |			КОГДА Стадионы.Ссылка = &Параметр
	                      |				ТОГДА 0
	                      |			КОГДА (ВТ.Владелец ЕСТЬ NULL) = ЛОЖЬ
	                      |				ТОГДА 1
	                      |			КОГДА Стадионы.Владелец.Наименование = &Наименование
	                      |				ТОГДА 2
	                      |			ИНАЧЕ 3
	                      |		КОНЕЦ КАК Порядок
	                      |	ИЗ
	                      |		Справочник.Стадионы КАК Стадионы
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	                      |				Команды.Ссылка КАК Владелец
	                      |			ИЗ
	                      |				Справочник.Команды КАК Команды
	                      |			ГДЕ
	                      |				Команды.Ссылка = &Параметр) КАК ВТ
	                      |			ПО Стадионы.Владелец = ВТ.Владелец
	                      |	ГДЕ
	                      |		Стадионы.ПометкаУдаления = ЛОЖЬ
	                      |		И (Стадионы.Ссылка = &Параметр
	                      |				ИЛИ Стадионы.Наименование = &Наименование
	                      |				ИЛИ Стадионы.Комментарий ПОДОБНО &Комментарий
	                      |				ИЛИ (ВТ.Владелец ЕСТЬ NULL) = ЛОЖЬ
	                      |				ИЛИ Стадионы.Владелец.Наименование = &Наименование)
	                      |	
	                      |	ОБЪЕДИНИТЬ
	                      |	
	                      |	ВЫБРАТЬ
	                      |		Стадионы.Ссылка,
	                      |		ВЫБОР
	                      |			КОГДА Стадионы.Ссылка = &Параметр
	                      |				ТОГДА 0
	                      |			КОГДА Стадионы.Город = &Параметр
	                      |				ТОГДА 1
	                      |			КОГДА Стадионы.Город.Наименование = &Наименование
	                      |				ТОГДА 2
	                      |			ИНАЧЕ 3
	                      |		КОНЕЦ
	                      |	ИЗ
	                      |		Справочник.Стадионы КАК Стадионы
	                      |	ГДЕ
	                      |		Стадионы.ПометкаУдаления = ЛОЖЬ
	                      |		И (Стадионы.Ссылка = &Параметр
	                      |				ИЛИ Стадионы.Наименование = &Наименование
	                      |				ИЛИ Стадионы.Комментарий ПОДОБНО &Комментарий
	                      |				ИЛИ Стадионы.Город = &Параметр
	                      |				ИЛИ Стадионы.Город.Наименование = &Наименование)) КАК Стадионы
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Стадионы.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	МИНИМУМ(Стадионы.Порядок)");
	Если ТипЗнч(Параметр) = Тип("Структура") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	МАКСИМУМ(Туры.ОлимпийскаяСистема = ИСТИНА
		               |			И Туры.Код = Финал.Код) КАК ЭтоФинал,
		               |	МАКСИМУМ(Туры.Владелец.Владелец.Страна.Ссылка) КАК Страна
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Туры.Владелец КАК Владелец,
		               |			Туры.Код КАК Код
		               |		ИЗ
		               |			Справочник.Туры КАК Туры
		               |		ГДЕ
		               |			Туры.Ссылка = &Тур) КАК Финал
		               |		ПО Туры.Владелец = Финал.Владелец
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка КАК Ссылка,
		               |	ВЫБОР
		               |		КОГДА Стадионы.Владелец = &Команда
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		               |		ПО Стадионы.Город = Команды.Город
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |			ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВременнаяТаблица
		               |			ПО (ИСТИНА)
		               |		ПО Стадионы.Город = Города.Ссылка
		               |ГДЕ
		               |	Стадионы.ПометкаУдаления = ЛОЖЬ
		               |	И (Стадионы.Владелец = &Команда
		               |			ИЛИ Команды.Ссылка = &Команда)
		               |	И ЕСТЬNULL(ВременнаяТаблица.ЭтоФинал, ЛОЖЬ) = ЛОЖЬ
		               |	И ВЫБОР
		               |			КОГДА ВременнаяТаблица.Страна ЕСТЬ NULL
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ Города.Владелец = ВременнаяТаблица.Страна
		               |		КОНЕЦ
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка,
		               |	Стадионы.КоличествоЗрителей
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК ВременнаяТаблица
		               |		ПО (ИСТИНА)
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			СРЕДНЕЕ(Стадионы.КоличествоЗрителей) КАК КоличествоЗрителей
		               |		ИЗ
		               |			Справочник.Стадионы КАК Стадионы
		               |		ГДЕ
		               |			Стадионы.ПометкаУдаления = ЛОЖЬ
		               |			И Стадионы.КоличествоЗрителей >= 8088
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			Стадионы.Город.Владелец) КАК Колизеи
		               |		ПО Стадионы.КоличествоЗрителей >= Колизеи.КоличествоЗрителей
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |		ПО (Стадионы.Владелец = Города.Ссылка
		               |				ИЛИ Стадионы.Город = Города.Ссылка)
		               |ГДЕ
		               |	ВременнаяТаблица.ЭтоФинал = ИСТИНА
		               |	И ВЫБОР
		               |			КОГДА ВременнаяТаблица.Страна ЕСТЬ NULL
		               |				ТОГДА ИСТИНА
		               |			ИНАЧЕ Города.Владелец = ВременнаяТаблица.Страна
		               |		КОНЕЦ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок УБЫВ";
		Запрос.УстановитьПараметр("Команда",			Параметр.Команда);
		Запрос.УстановитьПараметр("Тур",				Параметр.Тур);
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка КАК Ссылка,
		               |	ВЫБОР
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |				И Стадионы.КоличествоЗрителей >= 1
		               |			ТОГДА 0
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |			ТОГДА 5
		               |		ИНАЧЕ 10
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ПО Команды.Ссылка = ЧемпионатыКоманды.Команда
		               |		ПО Стадионы.Город = Команды.Город
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка = &Параметр
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Туры") И Все Тогда
		Если Параметр.ОлимпийскаяСистема
		И НЕ ЗначениеЗаполнено(Параметр.Владелец.Владелец.Страна)
		Тогда
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка КАК Ссылка,
		               |	ВЫБОР
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |				И Стадионы.КоличествоЗрителей >= 1
		               |			ТОГДА 0
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |			ТОГДА 5
		               |		ИНАЧЕ 10
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ПО Команды.Ссылка = ЧемпионатыКоманды.Команда
		               |		ПО Стадионы.Город = Команды.Город
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				Туры.Владелец
		               |			ИЗ
		               |				Справочник.Туры КАК Туры
		               |			ГДЕ
		               |				Туры.Ссылка = &Параметр)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка КАК Ссылка,
		               |	ВЫБОР
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |				И Стадионы.КоличествоЗрителей >= 1
		               |			ТОГДА 0
		               |		КОГДА Стадионы.ПометкаУдаления = ЛОЖЬ
		               |			ТОГДА 5
		               |		ИНАЧЕ 10
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ПО Команды.Ссылка = ЧемпионатыКоманды.Команда
		               |		ПО Стадионы.Город = Команды.Город
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				Туры.Владелец
		               |			ИЗ
		               |				Справочник.Туры КАК Туры
		               |			ГДЕ
		               |				Туры.Ссылка = &Параметр)
		               |	И Команды.Ссылка.Город.Владелец = ЧемпионатыКоманды.Ссылка.Владелец.Страна
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок";
		КонецЕсли;
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Туры") Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Стадионы.Ссылка КАК Ссылка,
		               |	Стадионы.ПометкаУдаления КАК Порядок
		               |ИЗ
		               |	Справочник.Стадионы КАК Стадионы
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |			ПО Команды.Ссылка = ЧемпионатыКоманды.Команда
		               |		ПО Стадионы.Город = Команды.Город
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				Туры.Владелец
		               |			ИЗ
		               |				Справочник.Туры КАК Туры
		               |			ГДЕ
		               |				Туры.Ссылка = &Параметр)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок";
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",			Параметр);
	Запрос.УстановитьПараметр("Наименование",		СокрЛП(Параметр));
	Запрос.УстановитьПараметр("Комментарий",		Обернуть(Параметр));
	Если СтрДлина(СокрЛП(Параметр)) < 5 Тогда
		Запрос.Текст = СтрУдалить(Запрос.Текст, "ИЛИ Стадионы.Комментарий ПОДОБНО &Комментарий");
	КонецЕсли;
	Выборка	= Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	Если Все Тогда
		Возврат Выборка;
	КонецЕсли;
	Для Каждого Ответ Из Выборка Цикл
		Возврат Ответ;
	КонецЦикла;
	Возврат Справочники.Стадионы.ПустаяСсылка();
КонецФункции

Функция Чемпион(Чемпионат) Экспорт
	Если Чемпионат.ДатаОкончания > ТекущаяДатаСеанса() Тогда Возврат Справочники.Команды.ПустаяСсылка(); КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Чемпионы.Команда КАК Команда
	                      |ИЗ
	                      |	РегистрСведений.Итоги КАК Чемпионы
	                      |ГДЕ
	                      |	Чемпионы.Чемпионат = &Чемпионат
	                      |	И Чемпионы.Место = 1");
	//Если Чемпионат.Владелец.ОлимпийскаяСистема Тогда
	//	Запрос.Текст	= "ВЫБРАТЬ
	//	            	  |	МАКСИМУМ(ТурнирнаяТаблица.Период) КАК Период,
	//	            	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Тур) КАК Тур
	//	            	  |ПОМЕСТИТЬ Последнее
	//	            	  |ИЗ
	//	            	  |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	//	            	  |ГДЕ
	//	            	  |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	//	            	  |
	//	            	  |ИМЕЮЩИЕ
	//	            	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда)
	//	            	  |;
	//	            	  |
	//	            	  |////////////////////////////////////////////////////////////////////////////////
	//	            	  |ВЫБРАТЬ
	//	            	  |	ТурнирнаяТаблица.Команда КАК Команда
	//	            	  |ИЗ
	//	            	  |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	//	            	  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последнее КАК Последнее
	//	            	  |		ПО ТурнирнаяТаблица.Период = Последнее.Период
	//	            	  |ГДЕ
	//	            	  |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	//					  //|	И (ТурнирнаяТаблица.Команда, Последнее.Тур) В
	//					  //|			(ВЫБРАТЬ
	//					  //|				ТурнирнаяТаблица.Команда,
	//					  //|				КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Тур)
	//					  //|			ИЗ
	//					  //|				РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	//					  //|			ГДЕ
	//					  //|				ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	//					  //|			СГРУППИРОВАТЬ ПО
	//					  //|				ТурнирнаяТаблица.Команда)
	//	            	  |
	//	            	  |СГРУППИРОВАТЬ ПО
	//	            	  |	ТурнирнаяТаблица.Команда
	//	            	  |
	//	            	  |ИМЕЮЩИЕ
	//	            	  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) = 1
	//	            	  |
	//	            	  |УПОРЯДОЧИТЬ ПО
	//	            	  |	СУММА(ТурнирнаяТаблица.КоличествоОчков) УБЫВ";
	//КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Ризалт	= Запрос.Выполнить();
	//Если Ризалт.Пустой() Тогда
	//	Если Чемпионат.Владелец.ОлимпийскаяСистема Тогда
	////		Возврат Справочники.Команды.ПустаяСсылка();
	//	Иначе
	//		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	//		               |	ТурнирнаяТаблица.Команда КАК Команда,
	//		               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
	//		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) - СУММА(Противник.КоличествоГолов) КАК Разница,
	//		               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК Забито
	//		               |ИЗ
	//		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	//		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	//		               |		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	//		               |			И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	//		               |ГДЕ
	//		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	//		               |
	//		               |СГРУППИРОВАТЬ ПО
	//		               |	ТурнирнаяТаблица.Команда
	//		               |
	//		               |УПОРЯДОЧИТЬ ПО
	//		               |	КоличествоОчков УБЫВ,
	//		               |	Разница УБЫВ,
	//		               |	Забито УБЫВ";
	//		Ризалт	= Запрос.Выполнить();
	//		Если Ризалт.Пустой() Тогда
	//			Возврат Справочники.Команды.ПустаяСсылка();
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	Выборка	= Ризалт.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Команда;
КонецФункции

Функция ЧемпионатНайти(Параметр, Дата=Неопределено) Экспорт
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Туры") Тогда
		Возврат Параметр.Владелец;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ЧемпионатыКоманды.Ссылка КАК Ссылка,
	                      |	2 КАК Порядок
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	&ДатаН МЕЖДУ Чемпионаты.ДатаНачала И Чемпионаты.ДатаОкончания
	                      |	И Чемпионаты.ПометкаУдаления = ЛОЖЬ
	                      |	И ЧемпионатыКоманды.Команда В(&Команды)
	                      |
	                      |ОБЪЕДИНИТЬ
	                      |
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Владелец,
	                      |	1
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица.Обороты(&ДатаН, &ДатаК, , Команда В (&Команды)) КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |			ПО Туры.Владелец = Чемпионаты.Ссылка
	                      |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок");
	//Если ТипЗнч(Команды) = Тип("СправочникСсылка.Команды") Тогда
	//КонецЕсли;
	Запрос.УстановитьПараметр("Команды",	Параметр);
	Запрос.УстановитьПараметр("ДатаН",		НачалоДня(?(Дата=Неопределено, ТекущаяДатаСеанса(), Дата)));
	Запрос.УстановитьПараметр("ДатаК",		КонецДня(?(Дата=Неопределено, ТекущаяДатаСеанса(), Дата)));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Чемпионаты.ПустаяСсылка();
КонецФункции

Функция ЧемпионатПолучитьПоследнее(Команды=Неопределено, ОлимпийскаяСистема=Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Тур.Владелец КАК Ссылка
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Команда В(&Команды)
	                      |	И ТурнирнаяТаблица.Тур.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ТурнирнаяТаблица.Период УБЫВ");
	Запрос.УстановитьПараметр("Команды",	?(ЗначениеЗаполнено(Команды), Команды, МояКомандаПолучить()));
	Запрос.УстановитьПараметр("Система",	ОлимпийскаяСистема);
	Если ТипЗнч(Команды) = Тип("СправочникСсылка.Стадионы") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Туры.Владелец КАК Ссылка
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО Матч.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Матч.Проведен = ИСТИНА
		               |	И Матч.Стадион В(&Команды)
		               |	И Туры.ОлимпийскаяСистема = &Система
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Матч.Дата УБЫВ";
	ИначеЕсли ОлимпийскаяСистема Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТурнирнаяТаблица.Тур.Владелец КАК Ссылка
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда В(&Команды)
		               |	И ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ИСТИНА
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Период УБЫВ";
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Чемпионаты.ПустаяСсылка();
КонецФункции

Функция ЧемпионатЛигиПоследний(Параметр) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	ТурнирнаяТаблица.Тур.Владелец КАК Ссылка,
	                      |	ТурнирнаяТаблица.Период КАК Период
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Тур.Владелец.Владелец = &Параметр
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Период УБЫВ");
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Команды") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЧемпионатыКоманды.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |ГДЕ
		               |	ЧемпионатыКоманды.Команда = &Параметр
		               |	И ЧемпионатыКоманды.Ссылка.Владелец.ОлимпийскаяСистема = ЛОЖЬ
		               |	И ЧемпионатыКоманды.Ссылка.Владелец.КоличествоРотация >= 1
		               |	И (ЧемпионатыКоманды.Ссылка.Владелец.Страна.Ссылка ЕСТЬ NULL) = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЧемпионатыКоманды.Ссылка.ПометкаУдаления,
		               |	ЧемпионатыКоманды.Ссылка.ДатаОкончания УБЫВ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",		Параметр);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Справочники.Чемпионаты.ПустаяСсылка());
КонецФункции

Функция ЧемпионатыТекущие(ОлимпийскаяСистема=Ложь) Экспорт
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Туры.Владелец КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Туры КАК Туры
	      	               |ГДЕ
	      	               |	Туры.ОлимпийскаяСистема = ЛОЖЬ
	      	               |	И Туры.ПометкаУдаления = ЛОЖЬ
	      	               |	И Туры.Владелец.ДатаОкончания >= &Дата");
	Если ОлимпийскаяСистема Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Туры.Владелец КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |ГДЕ
		               |	Туры.ПометкаУдаления = ЛОЖЬ
		               |	И Туры.Владелец.ДатаОкончания >= &Дата";
	КонецЕсли;
	Запрос.УстановитьПараметр("Дата",				ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция Тур(Параметр, Дата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК Чемпионаты
	                      |		ПО Туры.Владелец = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	&Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И Чемпионаты.Команда В(&Параметр)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.Код");
	Запрос.УстановитьПараметр("Параметр",		Параметр);
	Запрос.УстановитьПараметр("Дата",			НачалоДня(Дата));
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Туры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО Туры.Владелец = Чемпионаты.Ссылка
		               |ГДЕ
		               |	Туры.Владелец = &Параметр
		               |	И &Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания
		               |	И Туры.ПометкаУдаления = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Туры.Код";
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.ВидыСпорта") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Туры.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО Туры.Владелец = Чемпионаты.Ссылка
		               |ГДЕ
		               |	&Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания
		               |	И Туры.ПометкаУдаления = ЛОЖЬ
		               |	И Чемпионаты.Владелец = &Параметр
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Туры.Код";
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Туры.ПустаяСсылка();
КонецФункции

Функция ТурПоследний(Чемпионат) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.ДатаОкончания УБЫВ,
	                      |	Туры.Код УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Туры.ПустаяСсылка();
КонецФункции

Функция ЭтотМатчТурФинал(Параметр) Экспорт
	Ответ	= Ложь;
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ИСТИНА КАК ЭтоФинал
	      	               |ИЗ
	      	               |	Документ.Матч.Команды КАК МатчКоманды
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Финал
	      	               |			ПО Туры.Владелец = Финал.Владелец
	      	               |		ПО МатчКоманды.Ссылка.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	Туры.Ссылка = &Параметр
	      	               |	И Туры.Владелец.Владелец.ОлимпийскаяСистема = ИСТИНА
	      	               |	И МатчКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Туры.Код
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	МАКСИМУМ(Финал.Код) = Туры.Код И
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчКоманды.Ссылка) = 1 И
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчКоманды.Команда) = 2");
	Если ТипЗнч(Параметр) = Тип("ДокументСсылка.Матч") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Туры.Владелец.Владелец.ОлимпийскаяСистема КАК ЭтоФинал
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Финал
		               |			ПО Туры.Владелец = Финал.Владелец
		               |		ПО Матч.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Матч.Ссылка = &Параметр
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Туры.Код,
		               |	Туры.Владелец.Владелец.ОлимпийскаяСистема
		               |
		               |ИМЕЮЩИЕ
		               |	Туры.Код = МАКСИМУМ(Финал.Код)";
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",	Параметр);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ	= Выборка.ЭтоФинал;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ТурТекущий(Чемпионат)
	Ответ = Справочники.Туры.ПустаяСсылка();
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Ссылка КАК Ссылка,
	                      |	Туры.Код КАК Код,
	                      |	1 + 2 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Регистратор,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда) КАК Команда
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |			И (ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч)
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Итоги КАК ИтогиСрезПоследних
	                      |		ПО Туры.Владелец = ИтогиСрезПоследних.Чемпионат
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |	И ИтогиСрезПоследних.Чемпионат ЕСТЬ NULL
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Ссылка,
	                      |	Туры.Код
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Ссылка КАК Ссылка,
	                      |	ВТ.Код КАК Код
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |ГДЕ
	                      |	ВТ.Код В
	                      |			(ВЫБРАТЬ
	                      |				МАКСИМУМ(ВТ.Код) КАК Код
	                      |			ИЗ
	                      |				ВТ КАК ВТ
	                      |			ГДЕ
	                      |				ВТ.Регистратор >= ВТ.Команда
	                      |				И ВТ.Регистратор >= 1
	                      |		
	                      |			ОБЪЕДИНИТЬ ВСЕ
	                      |		
	                      |			ВЫБРАТЬ
	                      |				МИНИМУМ(ВТ.Код)
	                      |			ИЗ
	                      |				ВТ КАК ВТ
	                      |			ГДЕ
	                      |				ВТ.Регистратор < ВТ.Команда)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Ответ = Выборка.Ссылка;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ВидСпорта(Ссылка) Экспорт
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.ВидыСпорта") Тогда
		Возврат Ссылка;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		Возврат Ссылка.Владелец;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Лига") Тогда
		Возврат Ссылка.Владелец;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Амплуа") Тогда
		Возврат Ссылка.Владелец;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Возврат Ссылка.Владелец.Владелец;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Туры") Тогда
		Возврат Ссылка.Владелец.Владелец.Владелец;
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы") Тогда
		Возврат Ссылка.Владелец.Владелец;
		
	КонецЕсли;
	Возврат Справочники.ВидыСпорта.ПустаяСсылка();
КонецФункции

Функция ВидыСпорта(Наименование="Футбол") Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВидыСпорта.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ВидыСпорта КАК ВидыСпорта
	|ГДЕ
	|	ВидыСпорта.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВидыСпорта.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование",		СокрЛП(Наименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.ВидыСпорта.ПустаяСсылка();
КонецФункции

Функция Лига(Чемпионат) Экспорт
	Если ТипЗнч(Чемпионат) = Тип("СправочникСсылка.Туры") Тогда
		Возврат Чемпионат.Владелец.Владелец;
	КонецЕсли;
	Возврат Чемпионат.Владелец;
КонецФункции

Функция ЛигиКоманды(Команда) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Чемпионаты.Владелец КАК Лига
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Команда В(&Команда)
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Чемпионаты.Владелец
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Ссылка) УБЫВ");
	Запрос.УстановитьПараметр("Команда",			Команда);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ЛигиНациональные() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	ЛигаКоманды.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Лига.Команды КАК ЛигаКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |		ПО ЛигаКоманды.Ссылка = Чемпионаты.Владелец
	                      |ГДЕ
	                      |	ЛигаКоманды.Ссылка.ОлимпийскаяСистема = ЛОЖЬ
	                      |	И (ЛигаКоманды.Ссылка.Страна.Ссылка ЕСТЬ NULL) = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Ссылка
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ЛигаКоличествоКоманд(Лига) Экспорт
	Возврат ?(Лига.КоличествоКоманд = 99, 999, Лига.КоличествоКоманд);
КонецФункции

Функция ЛигаОлимпийскаяСистема(ЛигаЧемпионат) Экспорт
	Если ТипЗнч(ЛигаЧемпионат) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Возврат ЛигаОлимпийскаяСистема(ЛигаЧемпионат.Владелец);
	КонецЕсли;
	Возврат ЛигаЧемпионат.ОлимпийскаяСистема;
КонецФункции

Функция ЛигаКоманды(Команда) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Лига.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
	                      |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
	                      |				ПО Лига.Страна = Страны.Ссылка
	                      |			ПО Чемпионаты.Владелец = Лига.Ссылка
	                      |		ПО ЧемпионатыКоманды.Ссылка = Чемпионаты.Ссылка
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Команда = &Команда
	                      |	И Лига.ОлимпийскаяСистема = ЛОЖЬ
	                      |	И Лига.КоличествоРотация >= 1
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Лига.ПометкаУдаления");
	Запрос.УстановитьПараметр("Команда",		Команда);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Лига.ПустаяСсылка();
КонецФункции

Функция ЛигаСтраны(Страна) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Лига.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Лига КАК Лига
	                      |ГДЕ
	                      |	Лига.Страна = &Страна
	                      |	И Лига.ОлимпийскаяСистема = ЛОЖЬ
	                      |	И Лига.КоличествоРотация >= 1
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Лига.ПометкаУдаления");
	Запрос.УстановитьПараметр("Страна",			Страна);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Лига.ПустаяСсылка();
КонецФункции

Функция МатчиТура(Тур) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Матч.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |ГДЕ
	                      |	Матч.Тур = &Тур
	                      |	И Матч.Проведен = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Матч.Дата");
	Запрос.УстановитьПараметр("Тур",		Тур);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция ТурнирнаяТаблица(Чемпионат, НомерСтроки=0) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЧемпионатыКоманды.Команда КАК Команда,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК КоличествоИгр,
	                      |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов + ТурнирнаяТаблица.Пенальти), 0) КАК КоличествоЗабито,
	                      |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоОчков), 0) КАК КоличествоОчков,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА Противник.КоличествоОчков = 0
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК Выигрыш,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК Ничья,
	                      |	СУММА(ВЫБОР
	                      |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
	                      |				ТОГДА 1
	                      |			ИНАЧЕ 0
	                      |		КОНЕЦ) КАК Проигрыш,
	                      |	ЕСТЬNULL(СУММА(Противник.КоличествоГолов + Противник.Пенальти), 0) КАК КоличествоПропущено,
	                      |	ЕСТЬNULL(СУММА(ТурнирнаяТаблица.КоличествоГолов), 0) - ЕСТЬNULL(СУММА(Противник.КоличествоГолов), 0) КАК Разница
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |			ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |				И (Туры.Владелец = &Чемпионат)
						  //|				И Туры.ОлимпийскаяСистема = ЛОЖЬ
	                      |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	                      |			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	                      |				И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	                      |		ПО ЧемпионатыКоманды.Команда = ТурнирнаяТаблица.Команда
	                      |			И (ТурнирнаяТаблица.НомерСтроки = &НомерСтроки)
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Лига.Команды КАК ЛигаКоманды
						  |		ПО ЧемпионатыКоманды.Команда = ЛигаКоманды.Команда
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
						  |	ЛигаКоманды.Команда,
	                      |	ЧемпионатыКоманды.Команда
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КоличествоОчков УБЫВ,
	                      |	Разница УБЫВ,
	                      |	КоличествоЗабито УБЫВ,
	                      |	Выигрыш УБЫВ,
						  |	ЧемпионатыКоманды.Команда = &Команда УБЫВ,
						  |	ЛигаКоманды.Команда ЕСТЬ NULL,
	                      |	Команда
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Запрос.УстановитьПараметр("Команда",		МояКомандаПолучить());
	Запрос.УстановитьПараметр("НомерСтроки",	НомерСтроки);
	Если НомерСтроки = 0 Тогда
		Запрос.Текст = СтрУдалить(Запрос.Текст, "И (ТурнирнаяТаблица.НомерСтроки = &НомерСтроки)");
	КонецЕсли;
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ТурнирнаяТаблица2(Чемпионат) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТурнирнаяТаблица.Тур КАК Тур,
	|	ТурнирнаяТаблица.ТурКод КАК ТурКод,
	|	ТурнирнаяТаблица.Команда КАК Команда,
	|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
	|	ТурнирнаяТаблица.КоличествоГолов КАК КоличествоГолов,
	|	ТурнирнаяТаблица.Пенальти КАК Пенальти,
	|	ТурнирнаяТаблица.Команда2 КАК Команда2,
	|	ТурнирнаяТаблица.КоличествоОчков2 КАК КоличествоОчков2,
	|	ТурнирнаяТаблица.КоличествоГолов2 КАК КоличествоГолов2,
	|	ТурнирнаяТаблица.Пенальти2 КАК Пенальти2,
	|	ТурнирнаяТаблица.Первая КАК Первая,
	|	ТурнирнаяТаблица.Вторая КАК Вторая,
	|	ТурнирнаяТаблица.КоличествоГолов + ТурнирнаяТаблица.Пенальти КАК Порядок,
	|	ТурнирнаяТаблица.КоличествоМатчей КАК КоличествоМатчей
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТурнирнаяТаблица.Тур КАК Тур,
	|		ТурнирнаяТаблица.Тур.Код КАК ТурКод,
	|		ТурнирнаяТаблица.Команда КАК Команда,
	|		СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
	|		СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоГолов,
	|		СУММА(ТурнирнаяТаблица.Пенальти) КАК Пенальти,
	|		Противник.Команда КАК Команда2,
	|		СУММА(Противник.КоличествоОчков) КАК КоличествоОчков2,
	|		СУММА(Противник.КоличествоГолов) КАК КоличествоГолов2,
	|		СУММА(Противник.Пенальти) КАК Пенальти2,
	|		МАКСИМУМ(ТурнирнаяТаблица.Регистратор) КАК Первая,
	|		МИНИМУМ(ТурнирнаяТаблица.Регистратор) КАК Вторая,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК КоличествоМатчей
	|	ИЗ
	|		РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
	|			ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
	|				И ТурнирнаяТаблица.НомерСтроки <> Противник.НомерСтроки
	|	ГДЕ
	|		ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	|		И ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ИСТИНА
	|		И ТурнирнаяТаблица.НомерСтроки = 1
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ТурнирнаяТаблица.Тур,
	|		ТурнирнаяТаблица.Тур.Код,
	|		ТурнирнаяТаблица.Команда,
	|		Противник.Команда) КАК ТурнирнаяТаблица
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТурКод УБЫВ,
	|	КоличествоОчков УБЫВ,
	|	Порядок УБЫВ
	|ИТОГИ
	|	СУММА(КоличествоМатчей)
	|ПО
	|	Тур");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	//Запрос.УстановитьПараметр("Команда",		МояКомандаПолучить());
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

Функция КомментарииПолучить(Чемпионат, Команда=Неопределено) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТурнирнаяТаблица.Период КАК Дата,
	|	ТурнирнаяТаблица.Регистратор КАК Регистратор,
	|	ВЫБОР
	|		КОГДА ДЛИНАСТРОКИ(СнятиеОчков.Комментарий) = 0
	|			ТОГДА СнятиеОчков.Представление
	|		ИНАЧЕ ПОДСТРОКА(СнятиеОчков.Комментарий, 1, 140)
	|	КОНЕЦ КАК Комментарий,
	|	ТурнирнаяТаблица.Команда КАК Команда,
	|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
	|ИЗ
	|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СнятиеОчков КАК СнятиеОчков
	|		ПО ТурнирнаяТаблица.Регистратор = СнятиеОчков.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	|ГДЕ
	|	Туры.Владелец = &Чемпионат
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Команда");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Если ЗначениеЗаполнено(Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТурнирнаяТаблица.Период КАК Дата,
		               |	ТурнирнаяТаблица.Регистратор КАК Регистратор,
		               |	ВЫБОР
		               |		КОГДА ДЛИНАСТРОКИ(СнятиеОчков.Комментарий) = 0
		               |			ТОГДА СнятиеОчков.Представление
		               |		ИНАЧЕ ПОДСТРОКА(СнятиеОчков.Комментарий, 1, 140)
		               |	КОНЕЦ КАК Комментарий,
		               |	ТурнирнаяТаблица.Команда КАК Команда,
		               |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СнятиеОчков КАК СнятиеОчков
		               |		ПО ТурнирнаяТаблица.Регистратор = СнятиеОчков.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Туры.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Команда = &Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата";
		Запрос.УстановитьПараметр("Команда",		Команда);
	КонецЕсли;
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция ВключитьНапоминания()
	Возврат Константы.ВключитьНапоминания.Получить();
КонецФункции

Функция АвтоудалениеНапоминаний()
	Возврат Константы.АвтоудалениеНапоминаний.Получить();
КонецФункции

Функция СтарыйВидАнонсов() Экспорт
	Возврат Константы.СтарыйВидАнонсов.Получить();
КонецФункции

Функция КоличествоМатчейВАнонсе() Экспорт
	Возврат Макс(5, Константы.КоличествоМатчейВАнонсе.Получить());
КонецФункции

Функция ТурнирнаяТаблицаКакНаBBC() Экспорт
	Возврат Константы.ТурнирнаяТаблицаКакНаBBC.Получить();
КонецФункции

Функция ПоказыватьРазницуМячей() Экспорт
	Возврат ?(ТурнирнаяТаблицаКакНаBBC(), Истина, Константы.ПоказыватьРазницуМячей.Получить());
КонецФункции

Функция ВыводитьТурВместоЧемпионата()
	Возврат Константы.ВыводитьТурВместоЧемпионата.Получить();
КонецФункции

Функция СтатистикаИгр(Команда, Чемпионат=Неопределено) Экспорт
	Итоги	= Новый Структура("Побед,Ничьих,Проигрышей,Количество,Результативность", 0, 0, 0, 0, 0);
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
	                      |	СУММА(1) КАК Количество,
	                      |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоГолов
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |ГДЕ
	                      |	ТурнирнаяТаблица.Команда = &Команда
	                      |	И Туры.Владелец = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТурнирнаяТаблица.КоличествоОчков
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	КоличествоОчков");
	Запрос.УстановитьПараметр("Команда",	Команда);
	Запрос.УстановитьПараметр("Чемпионат",	Чемпионат);
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Запрос.Текст = СтрУдалить(Запрос.Текст, "Туры.Владелец = &Чемпионат");
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоОчков = 0 Тогда
			Итоги.Проигрышей = Выборка.Количество;
		ИначеЕсли Выборка.КоличествоОчков = 1 Тогда
			Итоги.Ничьих = Выборка.Количество;
		Иначе
			Итоги.Побед = Выборка.Количество;
		КонецЕсли;
		Итоги.Количество		= Итоги.Количество + Выборка.Количество;
		Итоги.Результативность	= Итоги.Результативность + Выборка.КоличествоГолов;
	КонецЦикла;
	Ответ = Новый Соответствие;
	Ответ.Вставить("Проигрышей",		Итоги.Проигрышей);
	Ответ.Вставить("Ничьих",			Итоги.Ничьих);
	Ответ.Вставить("Побед",				Итоги.Побед);
	Ответ.Вставить(?(ЗначениеЗаполнено(Чемпионат), "Игр с начала сезона", "Игр за последний год"),		Итоги.Количество);
	Если Итоги.Количество = 0 Тогда
		Ответ.Вставить("Результативность средняя", 0);
	Иначе
		Ответ.Вставить("Результативность средняя", Окр(Итоги.Результативность / Итоги.Количество, 1));
	КонецЕсли;
	Ответ.Вставить("Результативность",	Итоги.Результативность);
	Возврат Ответ;
КонецФункции

Функция МестоВЧемпионате(Команда, Чемпионат=Неопределено) Экспорт
	Ответ = 0;
	ШалостьУдалась = Ложь;
	Выборка = ТурнирнаяТаблица(?(Чемпионат=Неопределено, ЧемпионатПолучитьПоследнее(Команда), Чемпионат));
	Пока НЕ ШалостьУдалась И Выборка.Следующий() Цикл
		Ответ = Ответ + 1;
		Если Выборка.Команда = Команда Тогда
			ШалостьУдалась = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ?(ШалостьУдалась, Ответ, 0);
КонецФункции

Функция ЭтоДерби(Матч) Экспорт
	Запрос	= Новый Запрос(
	"ВЫБРАТЬ
	|	ИСТИНА КАК ЭтоДерби
	|ИЗ
	|	Документ.Матч.Команды КАК МатчКоманды
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	|			ПО Команды.Город = Города.Ссылка
	|		ПО МатчКоманды.Команда = Команды.Ссылка
	|ГДЕ
	|	МатчКоманды.Ссылка = &Матч
	|
	|ИМЕЮЩИЕ
	|	СУММА(МатчКоманды.НомерСтроки) + 10 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МатчКоманды.Команда) + 100 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Город) = 123");
	Запрос.УстановитьПараметр("Матч",	Матч);
	Возврат (НЕ Запрос.Выполнить().Пустой());
КонецФункции

Функция ЕстьИстория(Ссылка, Вторая=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда Возврат Ложь; КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка",			Ссылка);
	Запрос.УстановитьПараметр("Вторая",			Вторая);
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ТурнирнаяТаблица.Период КАК Период
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Команда = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ЧемпионатыКоманды.Ссылка.ДатаНачала
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |ГДЕ
		               |	ЧемпионатыКоманды.Команда = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Игроки") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	МатчСоставыКоманд.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |		ПО МатчСоставыКоманд.Ссылка = ТурнирнаяТаблица.Регистратор
		               |ГДЕ
		               |	МатчСоставыКоманд.Игрок = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ссылка";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Лига") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Чемпионаты.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Чемпионаты КАК Чемпионаты
		               |ГДЕ
		               |	Чемпионаты.Владелец = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ссылка";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Матч.Ссылка КАК Ссылка
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |ГДЕ
		               |	Матч.Стадион = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Ссылка";
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Если Вторая = Неопределено Тогда
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	Туры.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Туры КАК Туры
			               |ГДЕ
			               |	Туры.Владелец = &Ссылка
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Ссылка";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	ТурнирнаяТаблица.Период КАК Период
			               |ИЗ
			               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			               |ГДЕ
			               |	ТурнирнаяТаблица.Тур.Владелец = &Ссылка
			               |	И ТурнирнаяТаблица.Команда В(&Вторая)
			               |
			               |УПОРЯДОЧИТЬ ПО
			               |	Период";
		КонецЕсли;
	КонецЕсли;
	
	Возврат (НЕ ПустаяСтрока(Запрос.Текст) И НЕ Запрос.Выполнить().Пустой());
КонецФункции

Функция ИзображениеПолучить(Ссылка, КакЕсть=Ложь) Экспорт
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы") Тогда
		Возврат ИзображениеПолучить(Ссылка.Владелец, КакЕсть);
	ИначеЕсли Ссылка = Неопределено Тогда
		Возврат ?(КакЕсть, Новый Картинка, "");
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Города") Тогда
		Возврат ?(КакЕсть, Новый Картинка, "");
	ИначеЕсли КакЕсть Тогда
		Картинка = Новый Картинка;
		Попытка
			ДвоичныеДанные = Ссылка.Изображение.Получить();
			Если ТипЗнч(ДвоичныеДанные) = Тип("ДвоичныеДанные") Тогда
				Картинка = Новый Картинка(ДвоичныеДанные);
			КонецЕсли;
		Исключение
			Логировать("СерверныйФункции.ИзображениеПолучить", ОписаниеОшибки(), Ссылка);
		КонецПопытки;
		Возврат Картинка;
	ИначеЕсли Ссылка.Изображение.Получить() = Неопределено Тогда
		Возврат ИзображениеДефолтПолучить();
	КонецЕсли;
	Возврат ПолучитьНавигационнуюСсылку(Ссылка, "Изображение");
КонецФункции

Функция ИзображениеДефолтПолучить() Экспорт
	Возврат "";
КонецФункции

Функция Футбол() Экспорт
	Возврат Справочники.ВидыСпорта.Футбол;
КонецФункции

Функция Амплуа(Наименование="Вратарь") Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Амплуа.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Амплуа КАК Амплуа
	|ГДЕ
	|	Амплуа.Наименование = &Наименование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Амплуа.ПометкаУдаления");
	Запрос.УстановитьПараметр("Наименование",		СокрЛП(Наименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Амплуа.ПустаяСсылка();
КонецФункции

Функция ИгрокНайти(Наименование, Параметр=Неопределено) Экспорт
	Ответ	= Новый Структура("Игрок,Амплуа,Команда", Справочники.Игроки.ПустаяСсылка(), Справочники.Амплуа.ПустаяСсылка(), Справочники.Команды.ПустаяСсылка());
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Игроки.Ссылка КАК Игрок,
	                      |	ЕСТЬNULL(ПеремещенияИгроков.Амплуа, Игроки.Амплуа) КАК Амплуа,
	                      |	ЕСТЬNULL(ПеремещенияИгроков.Команда, ЗНАЧЕНИЕ(Справочник.Команды.ПустаяСсылка)) КАК Команда
	                      |ИЗ
	                      |	Справочник.Игроки КАК Игроки
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
	                      |		ПО Игроки.Ссылка = ПеремещенияИгроков.Игрок
	                      |ГДЕ
	                      |	(Игроки.Наименование ПОДОБНО &Наименование
	                      |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВЫБОР
	                      |		КОГДА Игроки.Наименование = &Наименование
	                      |			ТОГДА 0
	                      |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий
	                      |			ТОГДА 1
	                      |		ИНАЧЕ 2
	                      |	КОНЕЦ,
	                      |	ПеремещенияИгроков.Период УБЫВ,
	                      |	Игроки.ПометкаУдаления");
	Если ПустаяСтрока(Наименование) Тогда
		Возврат Ответ;
	ИначеЕсли ТипЗнч(Параметр) = Тип("СправочникСсылка.Команды")
	Или ТипЗнч(Параметр) = Тип("Массив")
	Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ПеремещенияИгроков.Игрок КАК Игрок,
		               |	ЕСТЬNULL(ПеремещенияИгроков.Амплуа.Ссылка, Игроки.Амплуа) КАК Амплуа,
		               |	ПеремещенияИгроков.Команда КАК Команда,
		               |	ВЫБОР
		               |		КОГДА Игроки.Наименование = &Наименование
		               |			ТОГДА 0
		               |		КОГДА Игроки.Наименование ПОДОБНО &Комментарий
		               |			ТОГДА 1
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий
		               |			ТОГДА 2
		               |		ИНАЧЕ 5
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Игроки КАК Игроки
		               |		ПО ПеремещенияИгроков.Игрок = Игроки.Ссылка
		               |ГДЕ
		               |	ПеремещенияИгроков.Команда В(&Команда)
		               |	И (Игроки.Наименование ПОДОБНО &Наименование
		               |			ИЛИ Игроки.Наименование ПОДОБНО &Комментарий
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ПеремещенияИгроков.Период УБЫВ,
		               |	Порядок,
		               |	Игроки.ПометкаУдаления";
		Запрос.УстановитьПараметр("Команда",			Параметр);
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("Дата") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Игроки.Ссылка КАК Игрок,
		               |	ЕСТЬNULL(Перемещения.Амплуа.Ссылка, Игроки.Амплуа) КАК Амплуа,
		               |	ВЫБОР
		               |		КОГДА Игроки.Наименование = &Наименование
		               |			ТОГДА 10
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Наименование ПОДОБНО &Комментарий
		               |			ТОГДА 6
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий
		               |			ТОГДА 4
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий2
		               |			ТОГДА 2
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий4
		               |			ТОГДА 2
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий6
		               |			ТОГДА 2
		               |		ИНАЧЕ 0
		               |	КОНЕЦ + ВЫБОР
		               |		КОГДА Игроки.Комментарий ПОДОБНО &КомментарийК
		               |			ТОГДА 1
		               |		ИНАЧЕ 0
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	Справочник.Игроки КАК Игроки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(, Игрок.ДатаРождения = &ДатаРождения) КАК Перемещения
		               |		ПО Игроки.Ссылка = Перемещения.Игрок
		               |ГДЕ
		               |	Игроки.ДатаРождения = &ДатаРождения
		               |	И (Игроки.Наименование ПОДОБНО &Наименование
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий2
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий4
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий6
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &КомментарийК)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок УБЫВ,
		               |	Игроки.ПометкаУдаления";
		Запрос.УстановитьПараметр("ДатаРождения",		Параметр);
		Запрос.УстановитьПараметр("Комментарий2",		Обернуть(Сред(Наименование, 2, 4)));
		Запрос.УстановитьПараметр("Комментарий4",		Обернуть(Сред(Наименование, 4, 4)));
		Запрос.УстановитьПараметр("Комментарий6",		Обернуть(Сред(Наименование, 6, 4)));
		Запрос.УстановитьПараметр("КомментарийК",		"%" + Прав(Наименование, 2));
		
	ИначеЕсли ТипЗнч(Параметр) = Тип("ДокументСсылка.Матч") Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ПеремещенияИгроков.Игрок КАК Игрок,
		               |	ЕСТЬNULL(ПеремещенияИгроков.Амплуа.Ссылка, Игроки.Амплуа) КАК Амплуа,
		               |	ПеремещенияИгроков.Команда КАК Команда,
		               |	ВЫБОР
		               |		КОГДА Игроки.Наименование = &Наименование
		               |			ТОГДА 0
		               |		КОГДА Игроки.Наименование ПОДОБНО &Комментарий
		               |			ТОГДА 1
		               |		КОГДА Игроки.Комментарий ПОДОБНО &Комментарий
		               |			ТОГДА 2
		               |		ИНАЧЕ 5
		               |	КОНЕЦ КАК Порядок
		               |ИЗ
		               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроков
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Игроки КАК Игроки
		               |		ПО ПеремещенияИгроков.Игрок = Игроки.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
		               |		ПО ПеремещенияИгроков.Команда = МатчКоманды.Команда
		               |ГДЕ
		               |	МатчКоманды.Ссылка = &Матч
		               |	И (Игроки.Наименование ПОДОБНО &Наименование
		               |			ИЛИ Игроки.Наименование ПОДОБНО &Комментарий
		               |			ИЛИ Игроки.Комментарий ПОДОБНО &Комментарий)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Порядок,
		               |	Игроки.ПометкаУдаления";
		Запрос.УстановитьПараметр("Матч",				Параметр);
		Запрос.УстановитьПараметр("Дата",				Параметр.Дата);
	КонецЕсли;
	Запрос.УстановитьПараметр("Наименование",		СокрЛП(Наименование));
	Запрос.УстановитьПараметр("Комментарий",		Обернуть(Наименование));
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	ИначеЕсли СтрНайти(Наименование, " ") > 1 Или СтрНайти(Наименование, "-") > 1 Тогда
		Траст = СтрЗаменить(СтрЗаменить(Наименование, "-", "%"), " ", "%");
		Запрос.УстановитьПараметр("Наименование",		Траст);
		Запрос.УстановитьПараметр("Комментарий",		Обернуть(Траст));
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(Ответ, Выборка);
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция СтранаКоманды(Команда) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Города.Владелец КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Команды КАК Команды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
	                      |		ПО Команды.Город = Города.Ссылка
	                      |ГДЕ
	                      |	Команды.Ссылка В(&Команда)");
	Запрос.УстановитьПараметр("Команда",		Команда);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Страны.ПустаяСсылка();
КонецФункции

Функция СтранаНайти(Параметр, Глубоко=Ложь) Экспорт
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Страны.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.Страны КАК Страны
	|ГДЕ
	|	(Страны.Наименование = &Наименование
	|			ИЛИ Страны.Код = &Наименование
	|			ИЛИ Страны.Комментарий ПОДОБНО &Комментарий)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Страны.ПометкаУдаления");
	Запрос.УстановитьПараметр("Параметр",		Параметр);
	Запрос.УстановитьПараметр("Наименование",	СокрЛП(Параметр));
	Запрос.УстановитьПараметр("Комментарий",	Обернуть(Параметр));
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Туры") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Туры.Владелец.Владелец.Страна КАК Ссылка
		               |ИЗ
		               |	Справочник.Туры КАК Туры
		               |ГДЕ
		               |	Туры.Ссылка = &Параметр
		               |	И (Туры.Владелец.Владелец.Страна ЕСТЬ NULL) = ЛОЖЬ";
	ИначеЕсли ПустаяСтрока(Параметр) Тогда
		Возврат Справочники.Страны.ПустаяСсылка();
	КонецЕсли;
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Если Глубоко
	И ТипЗнч(Параметр) = Тип("Строка") И СтрДлина(Параметр) > 10
	Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Страны.Ссылка КАК Ссылка
		               |ИЗ
		               |	Справочник.Страны КАК Страны
		               |ГДЕ
		               |	&Наименование ПОДОБНО ""%"" + Страны.Наименование + ""%""
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	&Наименование ПОДОБНО Страны.Наименование + ""%"" УБЫВ";
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Справочники.Страны.ПустаяСсылка();
КонецФункции

Функция СкачатьПоСсылке(Гиперссылка, КомОбъект=Неопределено) Экспорт
	Если ПустаяСтрока(Гиперссылка) Тогда Возврат ""; КонецЕсли;
	Попытка
		Если КомОбъект = Неопределено Тогда
			КомОбъект = Новый COMОбъект("Msxml2.XMLHTTP");
		КонецЕсли;
		КомОбъект.Open("GET", Гиперссылка, false);
		КомОбъект.Send();
		Если КомОбъект.status = 200 Тогда
			Возврат КомОбъект.responseText;
		КонецЕсли;
	Исключение
		Логировать("СерверныйФункции.СкачатьПоСсылке", ОписаниеОшибки(), Гиперссылка);
	КонецПопытки;
	Возврат "";
КонецФункции

Функция ПолучитьЭлементыПоИмени(Гиперссылка, Имя="td") Экспорт
	Текст	= СкачатьПоСсылке(Гиперссылка);
	Если ПустаяСтрока(Текст) Тогда Возврат Новый Массив; КонецЕсли;
	
	Ответ = Новый Массив;
	ЧтениеHTML = Новый ЧтениеHTML;
	ЧтениеHTML.УстановитьСтроку(Текст);
	ПостроительDOM = Новый ПостроительDOM;
	ДокументHTML = ПостроительDOM.Прочитать(ЧтениеHTML);
	Элементы = ДокументHTML.ПолучитьЭлементыПоИмени(Имя);
	Для Каждого Элемент Из Элементы Цикл
		Если НЕ ПустаяСтрока(Элемент.ТекстовоеСодержимое) Тогда
			Ответ.Добавить(СокрЛП(Элемент.ТекстовоеСодержимое));
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Функция ВстречиПоследние5(Команда, Команды, Чемпионат) Экспорт
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	      	               |	ТурнирнаяТаблица.Период КАК Период,
	      	               |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
	      	               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
	      	               |ПОМЕСТИТЬ ВТ
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противники
	      	               |		ПО ТурнирнаяТаблица.Регистратор = Противники.Регистратор
	      	               |			И ТурнирнаяТаблица.НомерСтроки <> Противники.НомерСтроки
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |	И Противники.Команда В(&Команды)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	ВТ.Период КАК Период,
	      	               |	ВЫБОР
	      	               |		КОГДА ВТ.КоличествоОчков = 0
	      	               |			ТОГДА ""LL""
	      	               |		КОГДА ВТ.КоличествоОчков = 1
	      	               |			ТОГДА ""DD""
	      	               |		ИНАЧЕ ""WW""
	      	               |	КОНЕЦ КАК Результат,
	      	               |	&Команда КАК Команда,
	      	               |	ВТ.Регистратор КАК Регистратор
	      	               |ИЗ
	      	               |	ВТ КАК ВТ
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Команда);
	Запрос.УстановитьПараметр("Команды",		Команды);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция МатчиПоследние5(Команда, Чемпионат, Дата=Неопределено, Сколько=5) Экспорт
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 5
	      	               |	ТурнирнаяТаблица.Период КАК Период,
	      	               |	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
	      	               |	ТурнирнаяТаблица.Регистратор КАК Регистратор
	      	               |ПОМЕСТИТЬ ВТ
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |	И ТурнирнаяТаблица.Период МЕЖДУ ТурнирнаяТаблица.Тур.Владелец.ДатаНачала И &ДатаК
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	ВТ.Период КАК Период,
	      	               |	ВЫБОР
	      	               |		КОГДА ВТ.КоличествоОчков = 0
	      	               |			ТОГДА ""LL""
	      	               |		КОГДА ВТ.КоличествоОчков = 1
	      	               |			ТОГДА ""DD""
	      	               |		ИНАЧЕ ""WW""
	      	               |	КОНЕЦ КАК Результат,
	      	               |	&Команда КАК Команда,
	      	               |	ВТ.Регистратор КАК Регистратор
	      	               |ИЗ
	      	               |	ВТ КАК ВТ
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период");
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "5", Формат(Макс(1, Сколько), "ЧН=5; ЧГ=0"));
	//Запрос.УстановитьПараметр("ДатаН",			Чемпионат.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаК",			КонецДня(?(Дата=Неопределено, Чемпионат.ДатаОкончания, Дата - Сутки())));
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Запрос.УстановитьПараметр("Команда",		Команда);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ИмпортЧемпионата(Гиперссылка, Чемпионат) Экспорт
	Итого	= 0;
	Год		= Год(Чемпионат.ДатаОкончания);
	Справочники.Туры.Заполнить(Чемпионат);
	
	Если СтрНайти2(Гиперссылка, "football.kulichki.") = 0 Тогда
		//
	ИначеЕсли СтрНайти2(Гиперссылка, "games") > 0 Тогда
		Тур	= ТурНайти(1, Чемпионат);
		Возврат ИмпортИгрПоГиперссылке(Гиперссылка, Тур);
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Туры.Ссылка КАК Тур,
		                      |	Туры.Код КАК Код
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
		                      |			И (ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч)
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
		                      |ГДЕ
		                      |	Туры.Владелец = &Чемпионат
		                      |	И Туры.ПометкаУдаления = ЛОЖЬ
		                      |
		                      |СГРУППИРОВАТЬ ПО
		                      |	Туры.Ссылка,
		                      |	Туры.Код
		                      |
		                      |ИМЕЮЩИЕ
		                      |	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор), 0) < ЦЕЛ(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда) / 2)
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Туры.Код");
		Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ИмпортИгрПоГиперссылке(СтрШаблон(Гиперссылка + ?(Год > 2010, "%1/", "%1.htm"), ФорматЧГ(Выборка.Код)), Выборка.Тур) Тогда
				Итого	= Итого + 1;
				
				Справочники.Туры.ДатыУстановить(Выборка.Тур);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

Функция МатчПодобрать(Команда, Тур) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	МатчКоманды.Ссылка КАК Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА Матч.Проведен = ИСТИНА
	                      |			ТОГДА 1
	                      |		КОГДА Матч.ПометкаУдаления = ЛОЖЬ
	                      |			ТОГДА 10
	                      |		ИНАЧЕ 100
	                      |	КОНЕЦ КАК Порядок
	                      |ИЗ
	                      |	Документ.Матч.Команды КАК МатчКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	                      |		ПО МатчКоманды.Ссылка = Матч.Ссылка
	                      |ГДЕ
	                      |	МатчКоманды.Команда = &Команда
	                      |	И Матч.Тур = &Тур
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Матч.Ссылка,
	                      |	ВЫБОР
	                      |		КОГДА Матч.Тур = &Тур
	                      |			ТОГДА 200
	                      |		ИНАЧЕ 400
	                      |	КОНЕЦ
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |ГДЕ
	                      |	Матч.ПометкаУдаления = ИСТИНА
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Порядок");
	Запрос.УстановитьПараметр("Команда",	Команда);
	Запрос.УстановитьПараметр("Тур",		Тур);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.Матч.ПустаяСсылка();
КонецФункции

Функция ЦветКоманды(Команда) Экспорт
	Если ТипЗнч(Команда) = Тип("СправочникСсылка.Стадионы") Тогда
		Возврат ЦветКоманды(Команда.Владелец);
	КонецЕсли;
	Возврат ?(ТипЗнч(Команда) = Тип("СправочникСсылка.Команды"), Команда.Цвет.Получить(), Неопределено);
КонецФункции
	
Функция МатчНайти(Команды, Дата, Тур=Неопределено) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Матч.Ссылка КАК Ссылка,
	                      |	Матч.ПометкаУдаления КАК ПометкаУдаления,
	                      |	Матч.Проведен КАК Проведен
	                      |ИЗ
	                      |	Документ.Матч КАК Матч
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
	                      |		ПО Матч.Ссылка = МатчКоманды.Ссылка
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Гости
	                      |		ПО Матч.Ссылка = Гости.Ссылка
	                      |ГДЕ
	                      |	Матч.Дата МЕЖДУ &Дата1 И &Дата2
	                      |	И МатчКоманды.НомерСтроки = 1
	                      |	И МатчКоманды.Команда В(&Команды)
	                      |	И Гости.НомерСтроки = 2
	                      |	И Гости.Команда В(&Команды)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Проведен УБЫВ,
	                      |	ПометкаУдаления");
	Если ЗначениеЗаполнено(Тур) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Матч.Ссылка КАК Ссылка,
		               |	Матч.ПометкаУдаления КАК ПометкаУдаления,
		               |	Матч.Проведен КАК Проведен
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
		               |		ПО Матч.Ссылка = МатчКоманды.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Гости
		               |		ПО Матч.Ссылка = Гости.Ссылка
		               |ГДЕ
		               |	Матч.Тур = &Тур
		               |	И МатчКоманды.НомерСтроки = 1
		               |	И МатчКоманды.Команда В(&Команды)
		               |	И Гости.НомерСтроки = 2
		               |	И Гости.Команда В(&Команды)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Проведен УБЫВ,
		               |	ПометкаУдаления";
	КонецЕсли;
	Запрос.УстановитьПараметр("Команды",	Команды);
	Запрос.УстановитьПараметр("Дата",		НачалоДня(Дата));
	Запрос.УстановитьПараметр("Дата1",		НачалоДня(Дата - Сутки()));
	Запрос.УстановитьПараметр("Дата2",		КонецДня(Дата + Сутки()));
	Запрос.УстановитьПараметр("Тур",		Тур);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Документы.Матч.ПустаяСсылка();
КонецФункции

Процедура ДобавитьВремя(Дата, Время, Сдвиг)
	Попытка
		Дата	= Дата(СтрДата(Дата) + СтрУдалить(СокрЛП(Время)) + "00") + Сдвиг;
	Исключение
	КонецПопытки;
КонецПроцедуры

Функция СтруктураКакКоманда(Команда, Гол, Пенальти=0)
	Возврат Новый Структура("Команда,КоличествоГолов", Команда, Гол, Пенальти);
КонецФункции

Функция ИмпортИгрПоГиперссылке(Гиперссылка, Тур) Экспорт
	Если ПустаяСтрока(Гиперссылка) Тогда Возврат Ложь;
	ИначеЕсли Год(Тур.ДатаОкончания) <= 2010 Тогда Возврат ИмпортИгрПоГиперссылке2010(Гиперссылка, Тур);
	КонецЕсли;
	
	ТекущаяДата	= ТекущаяДатаСеанса();
	Итого		= 0;
	Искать		= Истина;
	
	Параметры	= Новый Структура("Гиперссылка,Тур,Чемпионат", Гиперссылка, Тур, Тур.Владелец);
	Параметры.Вставить("ВсегоИгр",	Цел(Параметры.Чемпионат.Команды.Количество() / 2));
	Параметры.Вставить("Дата",		Дата(1,1,1));
	Параметры.Вставить("Сдвиг",		Часов(-3));
	Параметры.Вставить("Команды",	Новый Соответствие);
	сИгра		= ИмпортНаполнитель(Тур);
	Зачистить(сИгра);
	Слова	= ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Если Итого >= Параметры.ВсегоИгр И СтрНайти2(Слово, "таблица") > 0 Тогда
			Прервать;
		//ИначеЕсли СтрЧислоСтрок(Слово) > Параметры.ВсегоИгр Тогда
		//	Итого = Итого + ИмпортИгрПоСтроке(Слово, Параметры.Тур, Символы.ПС);
		//	Продолжить;
		ИначеЕсли СтрЧислоСтрок(Слово) > 2 Тогда
			Продолжить;
		ИначеЕсли СтрДлина(Слово) < 3 Тогда
			Продолжить;
		ИначеЕсли СтрЧислоСтрок(Слово) = 2 Тогда
			Слово = СтрПолучитьСтроку(Слово, 1) + СтрУдалить(СтрПолучитьСтроку(Слово, 2), Символы.Таб);
		КонецЕсли;
		
		Если СтрокаНачинаетсяЧислом(Слово)
		И СтрНайти2(СтрУдалить(Слово, "."), "тур") > 0
		Тогда
			сИгра.Тур	= ТурНайти(ЧислоПолучить(Слово, Истина), Параметры.Чемпионат);
			Если ЗначениеЗаполнено(сИгра.Тур) Тогда
				Зачистить(сИгра);
			Иначе
				Прервать;
			КонецЕсли;
			
		ИначеЕсли Год(сИгра.Дата) < 2 Или СтрокаПохожаНаДату(Слово) Тогда
			сИгра.Дата	= КакДата(Слово, сИгра.Тур);
			Если Год(сИгра.Дата) < 2 Тогда
				//
			ИначеЕсли сИгра.Дата > ТекущаяДата Тогда
				сИгра.Проведен = Ложь;
			КонецЕсли;
			Продолжить;
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда2) И НЕ ЗначениеЗаполнено(сИгра.Команда1) Тогда
			мСлова = КомандыОпределить(Слово);
			Если мСлова.Количество() = 2 Тогда
				//
			ИначеЕсли СтрЧислоВхождений(Слово, " - ") = 1 Тогда
				мСлова = Разделить(Слово, " - ");
			ИначеЕсли СтрЧислоВхождений(Слово, " : ") = 1 Тогда
				мСлова = Разделить(Слово, " : ");
			КонецЕсли;
			Если мСлова.Количество() = 2 Тогда
				сИгра.Команда1	= КомандаНайти(мСлова.Получить(0), Параметры);
				сИгра.Команда2	= КомандаНайти(мСлова.Получить(1), Параметры);
			КонецЕсли;
			Продолжить;
			
		ИначеЕсли ПустаяСтрока(сИгра.Счет) И СтрЧислоВхождений(Слово, ":") = 2 Тогда
			Если ГолыОпределить(сИгра, СокрЛП(Слово)) Тогда
				сИгра.Проведен	= Истина;
			Иначе
				Зачистить(сИгра);
			КонецЕсли;
			
		ИначеЕсли СтрСравнить(Слово, "ОТМ") = 0 Тогда
			Зачистить(сИгра);
		ИначеЕсли СтрЧислоВхождений(Слово, ":") = 1 И СтрНайти(Слово, "(") = 0
		И СтрНайти("210", Лев(Слово, 1)) > 0 И СтрНайти("05", Прав(Слово, 1)) > 0
		Тогда
			сИгра.Проведен = Ложь;
			ДобавитьВремя(сИгра.Дата, Слово, Параметры.Сдвиг);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(сИгра.Дата)
		И ЗначениеЗаполнено(сИгра.Команда1) И ЗначениеЗаполнено(сИгра.Команда2)
		И ?(сИгра.Проведен, сИгра.Гол1 >= 0 И сИгра.Гол2 >= 0, сИгра.Гол1 < 0 И сИгра.Гол2 < 0)
		Тогда
			//Итого = Итого + 0.01;
			Команды	= Новый Массив;
			Команды.Добавить(сИгра.Команда1);
			Команды.Добавить(сИгра.Команда2);
			Матч = МатчНайти(Команды, сИгра.Дата, сИгра.Тур);
			Если Матч.Проведен Тогда
				Зачистить(сИгра);
				Продолжить;
			ИначеЕсли ЗначениеЗаполнено(Матч) Тогда
				Док = Матч.ПолучитьОбъект();
				Если Док.ПометкаУдаления Тогда
					Док.УстановитьПометкуУдаления(Ложь);
					ЗаполнитьЗначенияСвойств(Док, сИгра);
				КонецЕсли;
				Если ?(Формат(Док.Дата, "ДФ=ddMMyyyy") = Формат(сИгра.Дата, "ДФ=ddMMyyyy"), Минута(Док.Дата) = 0 И Час(Док.Дата) = 0, Истина) Тогда
					ОбщегоНазначения.УстановитьЗначение(Док.Дата, сИгра.Дата);
				КонецЕсли;
				ОбщегоНазначения.УстановитьЗначение(Док.Тур, сИгра.Тур);
				Если Док.Команды.Получить(0).Команда = сИгра.Команда1
				И Док.Команды.Получить(0).КоличествоГолов = Макс(0, сИгра.Гол1)
				И Док.Команды.Получить(1).Команда = сИгра.Команда2
				И Док.Команды.Получить(1).КоличествоГолов = Макс(0, сИгра.Гол2)
				Тогда
					//
				Иначе
					Док.Команды.Очистить();
					Док.СоставыКоманд.Очистить();
				КонецЕсли;
			Иначе
				Док = МатчСоздать(Искать);
				Док.Заполнить(сИгра);
			КонецЕсли;
			Если Док.Команды.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда1, сИгра.Гол1));
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда2, сИгра.Гол2));
			КонецЕсли;
			ОбщегоНазначения.УстановитьЗначение(Док.Стадион, СтадионНайти(Новый Структура("Команда,Тур", сИгра.Команда1, сИгра.Тур)));
			Если НЕ ЗначениеЗаполнено(Док.Стадион) И Док.КоличествоЗрителей > 0 Тогда
				Док.КоличествоЗрителей = 0;
			КонецЕсли;
			Если Док.Модифицированность() Или Док.Проведен <> сИгра.Проведен Тогда
				Если ?(сИгра.Проведен, Док.ПроверитьЗаполнение(), Истина) Тогда
					Ошибка = МатчЗаписать(Док, сИгра.Проведен);
					Если ПустаяСтрока(Ошибка) Тогда
						Итого = Итого + 1;
					Иначе
						Сообщить(Ошибка);
						Логировать("СерверныйФункции.ИмпортИгрПоГиперссылке", Ошибка, Параметры.Гиперссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Зачистить(сИгра);
		КонецЕсли;
	КонецЦикла;
	//Если Итого >= 1 И ПустаяСтрока(Тур.Комментарий) Тогда
	//	Попытка
	//		Объект = Тур.ПолучитьОбъект();
	//		Объект.Комментарий = Гиперссылка;
	//		Объект.Записать();
	//	Исключение
	//		Логировать("СерверныйФункции.ИмпортИгрПоГиперссылке", ОписаниеОшибки(), Гиперссылка);
	//	КонецПопытки;
	//КонецЕсли;
	
	Возврат (Итого > 0);
КонецФункции

Функция МатчЗаписать(Док, Проводить)
	Ответ = "";
	Попытка
		Док.ДополнительныеСвойства.Вставить("Импорт", Истина);
		Док.Записать(?(Проводить, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
	Исключение
		Ответ = ОписаниеОшибки();
	КонецПопытки;
	Возврат Ответ;
КонецФункции

Функция ИмпортДокументСоздать(сИгра, Параметры)
	Итого	= 0;
	
	Если ЗначениеЗаполнено(сИгра.Дата)
	И ЗначениеЗаполнено(сИгра.Команда1) И ЗначениеЗаполнено(сИгра.Команда2)
	И сИгра.Гол2 >= 0 И сИгра.Гол1 >= 0
	Тогда
		Итого = Итого + 0.01;
		
		Док		= Неопределено;

		Команды	= Новый Массив;
		Команды.Добавить(сИгра.Команда1);
		Команды.Добавить(сИгра.Команда2);
		Матч = МатчНайти(Команды, сИгра.Дата, сИгра.Тур);
		Если Матч.Проведен Тогда
			//
		ИначеЕсли ЗначениеЗаполнено(Матч) Тогда
			Док = Матч.ПолучитьОбъект();
			Если Док.ПометкаУдаления Тогда
				Док.УстановитьПометкуУдаления(Ложь);
			КонецЕсли;
			ОбщегоНазначения.УстановитьЗначение(Док.Дата, сИгра.Дата);
			ОбщегоНазначения.УстановитьЗначение(Док.Тур, сИгра.Тур);
			Если Док.Команды.Получить(0).Команда = сИгра.Команда1
			И Док.Команды.Получить(0).КоличествоГолов = сИгра.Гол1
			И Док.Команды.Получить(1).Команда = сИгра.Команда2
			И Док.Команды.Получить(1).КоличествоГолов = сИгра.Гол2
			Тогда
				//
			Иначе
				Док.Команды.Очистить();
				Док.СоставыКоманд.Очистить();
			КонецЕсли;
		Иначе
			Док = МатчСоздать();
			Док.Заполнить(сИгра);
		КонецЕсли;
		Если ТипЗнч(Док) = Тип("ДокументОбъект.Матч") Тогда
			Если Док.Команды.Количество() = 0 Тогда
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда1, сИгра.Гол1));
				ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда2, сИгра.Гол2));
			КонецЕсли;
			ОбщегоНазначения.УстановитьЗначение(Док.Комментарий, сИгра.Комментарий);
			ОбщегоНазначения.УстановитьЗначение(Док.Стадион, СтадионНайти(Новый Структура("Команда,Тур", сИгра.Команда1, сИгра.Тур)));
			Если НЕ ЗначениеЗаполнено(Док.Стадион) И Док.КоличествоЗрителей > 0 Тогда
				Док.КоличествоЗрителей = 0;
			Иначе
				ОбщегоНазначения.УстановитьЗначение(Док.КоличествоЗрителей, сИгра.КоличествоЗрителей);
			КонецЕсли;
			Если Док.Модифицированность() Или Док.Проведен <> сИгра.Проведен Тогда
				Если ?(сИгра.Проведен, Док.ПроверитьЗаполнение(), Истина) Тогда
					Ошибка = МатчЗаписать(Док, сИгра.Проведен);
					Если ПустаяСтрока(Ошибка) Тогда
						Итого = Итого + 1;
					Иначе
						Сообщить(Ошибка);
						Логировать("СерверныйФункции.ИмпортИгрПоГиперссылке", Ошибка, Параметры.Гиперссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Зачистить(сИгра,, Истина);
	КонецЕсли;
	
	Возврат Итого;
КонецФункции

Функция ИмпортИгрПоФрагменту(Слова, Параметры)
	Итого	= 0;
	сИгра	= ИмпортНаполнитель(Параметры.Тур);
	Для Каждого Слово Из Разделить(Слова, Символы.ПС) Цикл
		Если СтрДлина(Слово) < 3 Тогда
			Продолжить;
		ИначеЕсли ПустаяСтрока(Слово) Тогда
			Продолжить;
		КонецЕсли;
		
		ИмпортСтроки(сИгра, Слово, Параметры);
		Итого = Итого + ИмпортДокументСоздать(сИгра, Параметры);
	КонецЦикла;
	Возврат Итого;
КонецФункции

Процедура ИмпортСтроки(сИгра, Слово, Параметры)
	Если СтрокаПохожаНаДату(Слово) Тогда
		сИгра.Дата	= КакДата(Слово, сИгра.Тур);
		Если Год(сИгра.Дата) >= 2000 Тогда
			Параметры.Дата = сИгра.Дата;
		ИначеЕсли Год(Параметры.Дата) >= 2000 Тогда
			сИгра.Дата = Параметры.Дата;
		КонецЕсли;
	ИначеЕсли Год(Параметры.Дата) < 2 Тогда
		//
	ИначеЕсли СтрНайти2(Слово, "зрителей") > 0 Тогда
		сИгра.КоличествоЗрителей = ЧислоПолучить(Слово);
	ИначеЕсли СтрНайти(Слово, " - ") > 0
	И НЕ ЗначениеЗаполнено(сИгра.Команда2) И НЕ ЗначениеЗаполнено(сИгра.Команда1)
	Тогда
		Комментарий = "";
		Если СтрНайти(Слово, ".") > 0 Тогда
			мСлова	= Разделить(СтрУдалить(Слово, Символ(9)), ".", Истина);
			//Если мСлова.Количество() > 1 Тогда
			//	Комментарий = Слово;
			//КонецЕсли;
			Слово	= мСлова.Получить(0);
		КонецЕсли;
		мСлова = КомандыОпределить(СтрУдалить(СтрУдалить(Слово, Символ(9)), Символы.ПС));
		Если мСлова.Количество() >= 2 Тогда
			сИгра.Команда1	= КомандаНайти(мСлова.Получить(0), Параметры.Чемпионат);
			сИгра.Команда2	= КомандаНайти(мСлова.Получить(1), Параметры.Чемпионат);
			Если ЗначениеЗаполнено(сИгра.Команда1) И ЗначениеЗаполнено(сИгра.Команда2) Тогда
				Если мСлова.Количество() >= 3 И ГолыОпределить(сИгра, мСлова.Получить(2)) Тогда
					//Если НЕ ПустаяСтрока(Комментарий) Тогда
					//	сИгра.Комментарий = Комментарий;
					//КонецЕсли;
				Иначе
					Зачистить(сИгра,, Истина);
				КонецЕсли;
			Иначе
				Зачистить(сИгра,, Истина);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ИмпортНаполнитель(Тур)
	Возврат Новый Структура("Чемпионат,Тур,Дата,Счет,Гол1,Гол2,Пенальти1,Пенальти2,КоличествоЗрителей,Проведен,Комментарий,Команда1,Команда2,Стадион", Тур.Владелец, Тур, Дата(1,1,1), "", -1, -1, 0, 0, 0, Истина, "");
КонецФункции

Функция ИмпортИгрПоГиперссылке2010(Гиперссылка, Тур)
	Итого	= 0;

	Параметры	= Новый Структура("Гиперссылка,Тур,Чемпионат", Гиперссылка, Тур, Тур.Владелец);
	Параметры.Вставить("ВсегоИгр",	Цел(Параметры.Чемпионат.Команды.Количество() / 2));
	Параметры.Вставить("Дата",		Дата(1,1,1));
	сИгра	= ИмпортНаполнитель(Тур);
	Зачистить(сИгра);
	Слова	= ПолучитьЭлементыПоИмени(Параметры.Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Если Итого >= Параметры.ВсегоИгр И СтрНайти2(Слово, "таблица") > 0 Тогда
			Прервать;
		ИначеЕсли СтрДлина(Слово) < 3 Тогда
			Если Итого > 0 И (Итого - Цел(Итого)) * 100 >= Параметры.ВсегоИгр Тогда
				Прервать;
			Иначе
				Продолжить;
			КонецЕсли;
		ИначеЕсли СтрЧислоВхождений(Слово, "document.") > 1
		Или СтрЧислоВхождений(Слово, "window.") > 1
		Тогда
			Итого = Итого + ИмпортИгрПоФрагменту(Слово, Параметры);
			Продолжить;
		ИначеЕсли СтрЧислоСтрок(Слово) > Параметры.ВсегоИгр Тогда
			Если СтрНайти(Слово, "тур") > 0 Тогда
				Итого = Итого + ИмпортИгрПоФрагменту(СтрЗаменить(СтрУдалить(Слово, Символы.ПС), ".", Символы.ПС), Параметры);
			КонецЕсли;
			Продолжить;
		КонецЕсли;
	
		ИмпортСтроки(сИгра, Слово, Параметры);
		Итого = Итого + ИмпортДокументСоздать(сИгра, Параметры);
	КонецЦикла;
	
	//Если Итого >= 1 И ПустаяСтрока(Тур.Комментарий) Тогда
	//	Попытка
	//		Объект = Тур.ПолучитьОбъект();
	//		Объект.Комментарий = Параметры.Гиперссылка;
	//		Объект.Записать();
	//	Исключение
	//		Логировать("СерверныйФункции.ИмпортИгрПоГиперссылке", ОписаниеОшибки(), Параметры.Гиперссылка);
	//	КонецПопытки;
	//КонецЕсли;
	
	Возврат (Итого > 0);
КонецФункции

Функция ИмпортИгрПоСтроке(Текст, Тур, Разделитель="¶") Экспорт
	Итого	= 0;
	ТриЧаса	= Часов(-3);
	Искать	= Истина;
	
	сИгра	= ИмпортНаполнитель(Тур);
	Зачистить(сИгра);
	Слова	= Разделить(СтрЗаменить(Текст, "	", Разделитель), Разделитель);
	Для Каждого Слово Из Слова Цикл
		Если ПустаяСтрока(Слово) Тогда
			Продолжить;
		ИначеЕсли СтрДлина(Слово) < 3 Тогда
			Продолжить;
		ИначеЕсли СтрНайти2(Слово, "раунд") > 0 Тогда
			Продолжить;
		
		ИначеЕсли Год(сИгра.Дата) < 2 Тогда
			Если СтрДлина(Слово) > 13 Тогда
				мСлова	= Разделить(Слово);
				Если мСлова.Количество() = 2 Тогда
					сИгра.Дата	= СтрокаКакДата(мСлова.Получить(0));
					Если ЗначениеЗаполнено(сИгра.Дата) Тогда
						ДобавитьВремя(сИгра.Дата, мСлова.Получить(1), ТриЧаса);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
				мСлова	= Разделить(Слово, "-", Истина);
				Если мСлова.Количество() = 1 Тогда
					сИгра.Дата	= КакДата(Слово, Тур);
				КонецЕсли;
				Если Год(сИгра.Дата) < 2 Тогда
					сИгра.Дата	= СтрокаКакДата(мСлова.Получить(0) + "." + ФорматЧГ(Тур.ДатаНачала));
					Если ЗначениеЗаполнено(сИгра.Дата) Тогда
						ДобавитьВремя(сИгра.Дата, мСлова.Получить(1), ТриЧаса);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) И НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			Если СтрНайти(Слово, " : ") > 0 Тогда
				мСлова	= Разделить(СтрЗаменить(Слово, " : ", "="), "=");
			ИначеЕсли СтрНайти(Слово, " – ") > 0 Тогда
				мСлова	= Разделить(СтрЗаменить(Слово, " – ", "="), "=");
			Иначе
				мСлова	= Разделить(СтрЗаменить(Слово, " - ", "="), "=");
			КонецЕсли;
			Если мСлова.Количество() >= 2 Тогда
				сИгра.Команда1	= КомандаНайти(мСлова.Получить(0), сИгра.Чемпионат);
				Если НЕ ЗначениеЗаполнено(сИгра.Команда1) И СтрНайти(мСлова.Получить(0), "(") > 0 Тогда
					сИгра.Команда1	= КомандаНайти(Разделить(мСлова.Получить(0), "(").Получить(0), сИгра.Чемпионат);
				//ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) Тогда
				//	сИгра.Команда1	= КомандаНайти(мСлова.Получить(0), Тур);
				КонецЕсли;
				сИгра.Команда2	= КомандаНайти(мСлова.Получить(1), сИгра.Чемпионат);
				Если НЕ ЗначениеЗаполнено(сИгра.Команда2) И СтрНайти(мСлова.Получить(1), "(") > 0 Тогда
					сИгра.Команда2	= КомандаНайти(Разделить(мСлова.Получить(1), "(").Получить(0), сИгра.Чемпионат);
				//ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
				//	сИгра.Команда2	= КомандаНайти(мСлова.Получить(1), Тур);
				КонецЕсли;
				Если мСлова.Количество() > 2 Тогда
					ГолыОпределить(сИгра, мСлова.Получить(2));
				ИначеЕсли СтрНайти(Слово, "(") > 0
				И (ЗначениеЗаполнено(сИгра.Команда1) Или ЗначениеЗаполнено(сИгра.Команда2))
				Тогда
					сИгра.Проведен	= Ложь;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда2) И ЗначениеЗаполнено(сИгра.Команда1) Тогда
			сИгра.Команда2	= КомандаНайти(Слово, сИгра.Чемпионат);
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) Или НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
			Продолжить;
		
		ИначеЕсли ПустаяСтрока(сИгра.Счет) И ?(СтрНайти(Слово, "(") = 0, СтрЧислоВхождений(Слово, ":") = 1, СтрЧислоВхождений(Слово, ":") = 2) Тогда
			Если Слово = "– : –" Тогда
				сИгра.Проведен	= Ложь;
			ИначеЕсли ГолыОпределить(сИгра, СокрЛП(Слово)) Тогда
				сИгра.Проведен	= Истина;
			Иначе
				Зачистить(сИгра);
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(сИгра.Дата)
		И ?(сИгра.Проведен, сИгра.Гол1 >= 0 И сИгра.Гол2 >= 0, сИгра.Гол1 < 0 И сИгра.Гол2 < 0)
		И ЗначениеЗаполнено(сИгра.Команда1) И ЗначениеЗаполнено(сИгра.Команда2)
		Тогда
			Итого = Итого + 0.01;
			
			Если НЕ ИмпортМатчЗаписать(сИгра, Итого, Искать) Тогда
				Прервать;
			КонецЕсли;
			Зачистить(сИгра);
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ЗначениеЗаполнено(сИгра.Дата) И Итого = 0 Тогда
		сИгра.Дата	= Тур.ДатаНачала;
		Для Каждого Слово Из Слова Цикл
			Если ПустаяСтрока(Слово) Тогда
				//
			ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) И НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
				мСлова	= Разделить(СтрЗаменить(Слово, " - ", "="), "=");
				Если мСлова.Количество() >= 2 Тогда
					сИгра.Команда1	= КомандаНайти(мСлова.Получить(0), сИгра.Чемпионат);
					сИгра.Команда2	= КомандаНайти(мСлова.Получить(1), сИгра.Чемпионат);
					Если ЗначениеЗаполнено(сИгра.Команда1)
					И ЗначениеЗаполнено(сИгра.Команда2)
					Тогда
						Если мСлова.Количество() > 2 Тогда
							ГолыОпределить(сИгра, СтрУдалить(мСлова.Получить(2), "ДВ"));
							Если сИгра.Гол1 = сИгра.Гол2 И СтрНайти(мСлова.Получить(2), "(") > 0 Тогда
								мПенальти	= СтрРазделить(СтрУдалить(Сред(мСлова.Получить(2), СтрНайти(мСлова.Получить(2), "(") + 1), ")"), ":");
								Если мПенальти.Количество() = 2 Тогда
									сИгра.Пенальти1 = СтрокаКакЧисло(мПенальти.Получить(0));
									сИгра.Пенальти2 = СтрокаКакЧисло(мПенальти.Получить(1));
									Если сИгра.Пенальти1 + сИгра.Пенальти2 = 0 Тогда
										Зачистить(сИгра,, Истина);
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;
					ИначеЕсли ЗначениеЗаполнено(сИгра.Команда1) Тогда
						Сообщить(сИгра.Команда2);
					ИначеЕсли ЗначениеЗаполнено(сИгра.Команда2) Тогда
						Сообщить(сИгра.Команда1);
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли НЕ ЗначениеЗаполнено(сИгра.Команда1) Или НЕ ЗначениеЗаполнено(сИгра.Команда2) Тогда
				Сообщить(Слово);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(сИгра.Команда1) И ЗначениеЗаполнено(сИгра.Команда2)
			И сИгра.Гол1 >= 0 И сИгра.Гол2 >= 0
			Тогда
				Итого = Итого + 0.01;
				
				Если НЕ ИмпортМатчЗаписать(сИгра, Итого, Искать) Тогда
					Прервать;
				КонецЕсли;
				Зачистить(сИгра,, Истина);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат (Итого >= 1);
КонецФункции

Функция ИмпортМатчЗаписать(сИгра, Итого, Искать)
	Ответ = Истина;
	
	Команды	= Новый Массив;
	Команды.Добавить(сИгра.Команда1);
	Команды.Добавить(сИгра.Команда2);
	Матч = МатчНайти(Команды, сИгра.Дата);
	Если Матч.Проведен Тогда
		Возврат Истина
	ИначеЕсли ЗначениеЗаполнено(Матч) Тогда
		Док = Матч.ПолучитьОбъект();
		Если Док.ПометкаУдаления Тогда
			Док.УстановитьПометкуУдаления(Ложь);
			ЗаполнитьЗначенияСвойств(Док, сИгра);
		КонецЕсли;
		Если НачалоДня(Док.Дата) <> НачалоДня(сИгра.Дата) Тогда
			ОбщегоНазначения.УстановитьЗначение(Док.Дата, сИгра.Дата);
		КонецЕсли;
		ОбщегоНазначения.УстановитьЗначение(Док.Тур, сИгра.Тур);
		Если Док.Команды.Получить(0).Команда = сИгра.Команда1
		И Док.Команды.Получить(1).Команда = сИгра.Команда2
		Тогда
			Если Док.Команды.Получить(0).КоличествоГолов <> Макс(0, сИгра.Гол1) Тогда
				Док.Команды.Получить(0).КоличествоГолов	= Макс(0, сИгра.Гол1);
			КонецЕсли;
			Если Док.Команды.Получить(1).КоличествоГолов <> Макс(0, сИгра.Гол2) Тогда
				Док.Команды.Получить(1).КоличествоГолов	= Макс(0, сИгра.Гол2);
			КонецЕсли;
		Иначе
			Док.Команды.Очистить();
			Док.СоставыКоманд.Очистить();
		КонецЕсли;
	Иначе
		Док = МатчСоздать(Искать);
		Док.Заполнить(сИгра);
	КонецЕсли;
	Если Док.Команды.Количество() = 0 Тогда
		ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда1, Макс(0, сИгра.Гол1), сИгра.Пенальти1));
		ЗаполнитьЗначенияСвойств(Док.Команды.Добавить(), СтруктураКакКоманда(сИгра.Команда2, Макс(0, сИгра.Гол2), сИгра.Пенальти2));
	КонецЕсли;
	Если НЕ сИгра.Тур.ОлимпийскаяСистема Тогда
		Стадионы	= СтадионНайти(Новый Структура("Команда,Тур", сИгра.Команда1, сИгра.Тур), Истина);
		Если Стадионы.Количество() >= 1 Тогда
			ОбщегоНазначения.УстановитьЗначение(Док.Стадион, Стадионы.Получить(0));
		КонецЕсли;
	КонецЕсли;
	Если (Док.Модифицированность() Или сИгра.Проведен И сИгра.Гол1 = 0 И сИгра.Гол2 = 0) И ?(сИгра.Проведен, Док.ПроверитьЗаполнение(), Истина) Тогда
		Ошибка = МатчЗаписать(Док, сИгра.Проведен);
		Если ПустаяСтрока(Ошибка) Тогда
			Итого = Итого + 1;
		Иначе
			Сообщить(Ошибка);
			Логировать("СерверныйФункции.ИмпортИгрПоСтроке", Ошибка);
			Ответ = Ложь;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция МатчСоздать(Искать=Истина)
	Если Искать Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Матч.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Документ.Матч КАК Матч
		                      |ГДЕ
		                      |	Матч.ПометкаУдаления = ИСТИНА
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Матч.Дата");
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Попытка
				Док	= Выборка.Ссылка.ПолучитьОбъект();
				Док.УстановитьПометкуУдаления(Ложь);
				ЗаполнитьЗначенияСвойств(Док, Новый Структура("Стадион,Счет,Тур,КоличествоЗрителей,Комментарий,Изображение"));
				Док.Команды.Очистить();
				Док.СоставыКоманд.Очистить();
			Исключение
				Искать	= Ложь;
				Док		= Документы.Матч.СоздатьДокумент();
			КонецПопытки;
		Иначе
			Искать	= Ложь;
			Док		= Документы.Матч.СоздатьДокумент();
		КонецЕсли;
	Иначе
		Док	= Документы.Матч.СоздатьДокумент();
	КонецЕсли;
	Возврат Док;
КонецФункции

Функция КомандыОпределить(Знач Слова)
	мСлова	= Новый Массив;
	Если СтрЧислоСтрок(Слова) = 2 Тогда
		Слова = СтрПолучитьСтроку(Слова, 1) + СтрПолучитьСтроку(Слова, 2);
	КонецЕсли;
	Если СтрНайти(Слова, " : ") > 0 Тогда
		Слова = СтрЗаменить(Слова, " : ", " - ");
	КонецЕсли;
	
	Если СтрНайти(Слова, " - ") > 0 Тогда
		Для Каждого Слово Из Разделить(СтрЗаменить(Слова, " - ", "="), "=") Цикл
			Слово = СокрЛП(Слово);
			Пока СтрНайти(Слово, "  ") > 0 Цикл
				Слово = СтрЗаменить(Слово, "  ", " ");
			КонецЦикла;
			Если СтрДлина(Слово) <= 25 Тогда
				мСлова.Добавить(Слово);
			Иначе
				мСлова.Очистить();
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат мСлова;
КонецФункции

Функция КакДата(Слово, Тур)
	Ответ = Дата(1,1,1);
	Если СтрНайти(Слово, " ") = 0 Тогда
		Ответ = СтрокаКакДата(Слово);
	Иначе
		Мезе	= 0;
		Жьорно	= 0;
		Для Каждого Строка Из Разделить(Слово) Цикл
			Если Жьорно = 0 Тогда
				Жьорно	= СтрокаКакЧисло(Строка);
				Если Жьорно = 0 Тогда
					Прервать;
				КонецЕсли;
			ИначеЕсли СтрокаКакМесяц(Строка) > 0 Тогда
				Мезе	= СтрокаКакМесяц(Строка);
			КонецЕсли;
		КонецЦикла;
		Если Мезе > 0 И Жьорно > 0 И Жьорно <= 31 Тогда
			Попытка
				Ответ = Дата(Год(Тур.ДатаОкончания), Мезе, Жьорно);
				Если Ответ > Тур.ДатаОкончания Тогда
					Ответ = Дата(Год(Тур.ДатаОкончания) - 1, Мезе, Жьорно);
				КонецЕсли;
			Исключение КонецПопытки;
			Если Год(Ответ) < 2 И ЧислоЧетное(Год(Тур.ДатаОкончания)) Тогда
				Попытка
					Ответ = Дата(Год(Тур.ДатаОкончания), Мезе, Жьорно);
				Исключение КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Процедура Зачистить(Виктим, ЭтоСобытие=Ложь, ОставитьДату=Ложь)
	ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("ЭтоСобытие,Счет,Гол1,Гол2,Пенальти1,Пенальти2,КоличествоЗрителей,Проведен,Команды,Комментарий,Комментарий2,ТурКод,Стадион,Команда1,Команда2", ЭтоСобытие, "", -1, -1, 0, 0, 0, Истина, Новый Массив, "", "", 0));
	Если НЕ ОставитьДату Тогда
		ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Дата", Дата(1,1,1)));
	КонецЕсли;
КонецПроцедуры

Функция ГолыОпределить(сИгра, Знач Слова)
	Если СтрЧислоВхождений(Слова, ":") = 2 Тогда
		Если СтрНайти(Слова, "(") = 0 Тогда
			сИгра.Счет	= Слова;
		Иначе
			мСлова = Разделить(Слова, "(");
			сИгра.Счет	= ?(мСлова.Количество() = 0, "", СокрЛП(мСлова.Получить(0)));
		КонецЕсли;
		Если НЕ ПустаяСтрока(сИгра.Счет) Тогда
			мСлова = Разделить(сИгра.Счет, ":");
			Если мСлова.Количество() = 2 Тогда
				сИгра.Гол1	= СтрокаКакЧисло(мСлова.Получить(0));
				сИгра.Гол2	= СтрокаКакЧисло(мСлова.Получить(1));
			ИначеЕсли Год(сИгра.Дата) <= 2010 Тогда
				Зачистить(сИгра,, Истина);
			Иначе
				Зачистить(сИгра);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли СтрЧислоВхождений(Слова, ":") = 1 Тогда
		Если СтрНайти(Слова, "(") = 0 Тогда
			сИгра.Счет	= Слова;
		Иначе
			мСлова = Разделить(СтрЗаменить(Слова, "(", " ("));
			сИгра.Счет	= ?(мСлова.Количество() = 0, "", мСлова.Получить(0));
		КонецЕсли;
		Если НЕ ПустаяСтрока(сИгра.Счет) Тогда
			мСлова = Разделить(сИгра.Счет, ":");
			Для Итератор = 0 По мСлова.ВГраница() Цикл
				Слово	= СокрЛП(мСлова.Получить(Итератор));
				Если СтрокаНачинаетсяЧислом(Слово) Тогда
					Если Итератор = 0 Тогда
						сИгра.Гол1	= СтрокаКакЧисло(Слово);
					ИначеЕсли Итератор = 1 Тогда
						сИгра.Гол2	= СтрокаКакЧисло(Слово);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
			Если сИгра.Гол1 >= 0 И сИгра.Гол2 >= 0 Тогда
				сИгра.Счет	= СокрЛП(сИгра.Счет);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат (НЕ ПустаяСтрока(сИгра.Счет));
КонецФункции

Функция ТурНайти(КодИлиНаименование, Чемпионат) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |	И (Туры.Наименование ПОДОБНО &Наименование
	                      |			ИЛИ Туры.Код = &Код)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Туры.Код = &Код УБЫВ,
	                      |	Туры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Запрос.УстановитьПараметр("Наименование",	?(ТипЗнч(КодИлиНаименование)=Тип("Строка"), КодИлиНаименование, ФорматЧГ(КодИлиНаименование)) + "-%");
	Запрос.УстановитьПараметр("Код",			?(ТипЗнч(КодИлиНаименование)=Тип("Строка"), СтрокаКакЧисло(КодИлиНаименование), КодИлиНаименование));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Туры.ПустаяСсылка();
КонецФункции

Функция ТурыЧемпионата(Чемпионат, ДляИтогов=Ложь) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ");
	Если ДляИтогов Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ТурнирнаяТаблица.Тур КАК Ссылка
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |	И ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ЛОЖЬ
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ТурнирнаяТаблица.Тур.Код";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",		Чемпионат);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция КомментарийКакУРЛ(Комментарий, КакЕсть=Ложь) Экспорт
	Если ПустаяСтрока(Комментарий) Тогда Возврат ""; КонецЕсли;
	Ответ = "";
	Для Строка = 1 По СтрЧислоСтрок(Комментарий) Цикл
		Если ЭтоУРЛ(СтрПолучитьСтроку(Комментарий, Строка)) Тогда
			Ответ = СтрПолучитьСтроку(Комментарий, Строка);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат ?(КакЕсть Или СтрНайти(Ответ, "/%1/") = 0, Ответ, СтрЗаменить(Ответ, "%1", ФорматЧГ(ТекущаяДатаСеанса())));
КонецФункции

Функция ОповещенияНаСегодня(ТолькоМатчи=Ложь) Экспорт
	Если НЕ ВключитьНапоминания() Тогда Возврат Новый Массив; КонецЕсли;
	
	Ответ	= Новый Массив;
	Авто	= АвтоудалениеНапоминаний();
	Старье	= ?(Авто, НастройкиВосстановить(), Новый Массив);
	Дата	= ТекущаяУниверсальнаяДата();
	Сдвиг	= ТекущаяДатаСеанса() - Дата;
	Тим		= МояКомандаПолучить();
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	      	               |	Матч.Ссылка КАК Ссылка,
	      	               |	Матч.Счет КАК Представление,
	      	               |	Матч.Дата КАК Дата,
	      	               |	ВЫБОР
	      	               |		КОГДА НАЧАЛОПЕРИОДА(Матч.Дата, ДЕНЬ) = Матч.Дата
	      	               |			ТОГДА Матч.Дата
	      	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(Матч.Дата, СЕКУНДА, &Сдвиг)
	      	               |	КОНЕЦ КАК Сдвиг,
	      	               |	РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) КАК Час,
	      	               |	РАЗНОСТЬДАТ(&Дата, Матч.Дата, МИНУТА) КАК Минута,
	      	               |	ЛОЖЬ КАК ЭтоИгрок
	      	               |ИЗ
	      	               |	Документ.Матч КАК Матч
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
	      	               |		ПО Матч.Ссылка = МатчКоманды.Ссылка
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Контроль
	      	               |		ПО Матч.Ссылка = Контроль.Ссылка
	      	               |ГДЕ
	      	               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
	      	               |	И Матч.Проведен = ЛОЖЬ
	      	               |	И Матч.ПометкаУдаления = ЛОЖЬ
	      	               |	И ВЫБОР
	      	               |			КОГДА РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) >= 13
	      	               |					ИЛИ Матч.Дата = &ДатаН
	      	               |				ТОГДА (Матч.Ссылка В (&Старье)) = ЛОЖЬ
	      	               |			ИНАЧЕ РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) >= 0
	      	               |		КОНЕЦ
	      	               |	И МатчКоманды.Команда = &Команда
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Матч.Ссылка,
	      	               |	Матч.Счет,
	      	               |	Матч.Дата
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	МАКСИМУМ(Контроль.НомерСтроки) = 2
	      	               |
	      	               |ОБЪЕДИНИТЬ ВСЕ
	      	               |
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	      	               |	Игроки.Ссылка,
	      	               |	Игроки.Наименование,
	      	               |	Игроки.ДатаРождения,
	      	               |	Игроки.ДатаРождения,
	      	               |	РАЗНОСТЬДАТ(Игроки.ДатаРождения, &Дата, ГОД),
	      	               |	0,
	      	               |	ИСТИНА
	      	               |ИЗ
	      	               |	Справочник.Игроки КАК Игроки
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков КАК ПеремещенияИгроков
	      	               |		ПО Игроки.Ссылка = ПеремещенияИгроков.Игрок
	      	               |ГДЕ
	      	               |	ДЕНЬ(Игроки.ДатаРождения) = &ДД
	      	               |	И МЕСЯЦ(Игроки.ДатаРождения) = &ММ
	      	               |	И (Игроки.Ссылка В (&Старье)) = ЛОЖЬ
	      	               |	И ПеремещенияИгроков.Команда = &Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЭтоИгрок,
	      	               |	Час");
	Если ТолькоМатчи Тогда
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	Матч.Ссылка КАК Ссылка,
		               |	Матч.Счет КАК Представление,
		               |	Матч.Дата КАК Дата,
		               |	ВЫБОР
		               |		КОГДА НАЧАЛОПЕРИОДА(Матч.Дата, ДЕНЬ) = Матч.Дата
		               |			ТОГДА Матч.Дата
		               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(Матч.Дата, СЕКУНДА, &Сдвиг)
		               |	КОНЕЦ КАК Сдвиг,
		               |	РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) КАК Час,
		               |	РАЗНОСТЬДАТ(&Дата, Матч.Дата, МИНУТА) КАК Минута,
		               |	ЛОЖЬ КАК ЭтоИгрок
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
		               |		ПО Матч.Ссылка = МатчКоманды.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Контроль
		               |		ПО Матч.Ссылка = Контроль.Ссылка
		               |ГДЕ
		               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
		               |	И Матч.Проведен = ЛОЖЬ
		               |	И Матч.ПометкаУдаления = ЛОЖЬ
		               |	И ВЫБОР
		               |			КОГДА РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) >= 13
		               |					ИЛИ Матч.Дата = &ДатаН
		               |				ТОГДА (Матч.Ссылка В (&Старье)) = ЛОЖЬ
		               |			ИНАЧЕ РАЗНОСТЬДАТ(&Дата, Матч.Дата, ЧАС) >= 0
		               |		КОНЕЦ
		               |	И МатчКоманды.Команда = &Команда
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Матч.Ссылка,
		               |	Матч.Счет,
		               |	Матч.Дата
		               |
		               |ИМЕЮЩИЕ
		               |	МАКСИМУМ(Контроль.НомерСтроки) = 2
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Дата";
	КонецЕсли;
	Запрос.УстановитьПараметр("Команда",			Тим);
	Запрос.УстановитьПараметр("ДД",					День(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ММ",					Месяц(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаН",				НачалоДня(Дата));
	Запрос.УстановитьПараметр("ДатаК",				КонецДня(Дата + Сутки()));
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("Сдвиг",				Сдвиг);
	Запрос.УстановитьПараметр("Старье",				Старье);
	Результат	= Запрос.Выполнить();
	Если НЕ Результат.Пустой() Тогда
		Дата	= НачалоДня(ТекущаяДатаСеанса());
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Событие	= Новый Структура("Повторить,Ссылка,Ключ,КлючУникальности,Дата,Картинка", Ложь, Выборка.Представление, ПолучитьНавигационнуюСсылку(Выборка.Ссылка), Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			Если Выборка.ЭтоИгрок Тогда
				Событие.Дата		= СтрШаблон("%1 (%2)", Формат(Выборка.Дата, "ДЛФ=D"), Выборка.Час);
				Событие.Картинка	= ИзображениеПолучить(Выборка.Ссылка, Истина);
			Иначе
				Если Выборка.Дата = Дата Тогда
					Событие.Дата		= "Сегодня";
				ИначеЕсли Выборка.Минута <= 1 Тогда
					Событие.Дата		= "Матч начался";
				ИначеЕсли Выборка.Минута < 60 Тогда
					Событие.Дата		= "Через " + СтрокаСЧислом(";%1 минуту;%1 минуты;%1 минуты;%1 минут;", Выборка.Минута, ВидЧисловогоЗначения.Количественное);
				ИначеЕсли Выборка.Час <= 12 Тогда
					Событие.Дата		= "Через " + СтрокаСЧислом(";%1 час;%1 часа;%1 часа;%1 часов;", Выборка.Час, ВидЧисловогоЗначения.Количественное);
					Событие.Повторить	= Истина;
				ИначеЕсли НачалоДня(Выборка.Сдвиг) = Дата Тогда
					Событие.Дата		= "Сегодня " + Формат(Выборка.Сдвиг, "ДФ='HH:mm'");
				ИначеЕсли Выборка.Сдвиг <= КонецДня(Дата + Сутки()) Тогда
					Событие.Дата		= "Завтра" + ?(Час(Выборка.Сдвиг) <= 4, ",ну почти", "") + Формат(Выборка.Сдвиг, "ДФ=' d MMM HH:mm'");
				Иначе
					Событие.Дата		= Формат(Выборка.Сдвиг, "ДФ='d MMM HH:mm'");
				КонецЕсли;
				Событие.Картинка	= ИзображениеПолучить(Тим, Истина);
			КонецЕсли;
			Если Событие.Картинка.Вид = ВидКартинки.Пустая Тогда
				Событие.Картинка	= ?(Выборка.ЭтоИгрок, БиблиотекаКартинок.Пользователь, БиблиотекаКартинок.Goal);
			КонецЕсли;
			Если Авто И Старье.Найти(Выборка.Ссылка) = Неопределено Тогда
				Старье.Добавить(Выборка.Ссылка);
			КонецЕсли;
			
			Ответ.Добавить(Событие);
		КонецЦикла;
		Если Авто Тогда
			НастройкиСохранить(Старье);
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ОповещенияПользователяИмя()
	Возврат "ОповещенияПользователя";
КонецФункции

Процедура НастройкиСохранить(Значение=Неопределено)
	Если Значение = Неопределено Тогда
		ХранилищеОбщихНастроек.Удалить(ОповещенияПользователяИмя(),, ИмяПользователя());
	Иначе
		ХранилищеОбщихНастроек.Сохранить(ОповещенияПользователяИмя(),, Значение,, ИмяПользователя());
	КонецЕсли;
КонецПроцедуры

Функция НастройкиВосстановить()
	Ответ	= Новый Массив;
	Попытка
		Настройки = ХранилищеОбщихНастроек.Выбрать(Новый Структура("КлючОбъекта,Пользователь", ОповещенияПользователяИмя(), ИмяПользователя()));
		Если Настройки.Следующий()
		И НачалоДня(Настройки.ДатаИзменения) = НачалоДня(ТекущаяУниверсальнаяДата())
		Тогда
			Ответ	= Настройки.Настройки;
		КонецЕсли;
	Исключение КонецПопытки;
	Возврат Ответ;
КонецФункции

Функция ТурИлиЧемпионат(Чемпионат)
	Тур		= ?(ВыводитьТурВместоЧемпионата(), ТурТекущий(Чемпионат), Чемпионат);
	Возврат ?(ЗначениеЗаполнено(Тур), Тур, Чемпионат);
КонецФункции

Функция ЗаголовокПолучить(Параметры) Экспорт
	Если НЕ Параметры.Свойство("ВыводитьЧемпионат") Тогда
		Параметры.Вставить("Чемпионат", ТурИлиЧемпионат(Параметры.Чемпионат));
	КонецЕсли;
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Заполнить(Параметры);
	Изображение	= ИзображениеПолучить(Параметры.Лига, Истина);
	Если Изображение.Вид <> ВидКартинки.Пустая Тогда
		ОбластьМакета.Рисунки.Получить(0).Картинка = Изображение;
	КонецЕсли;
	Возврат ОбластьМакета;
КонецФункции

Процедура ПередЗаписьюНаСервереИзображение(ТекущийОбъект, Адрес, Отказ) Экспорт
	Если Отказ Тогда
		//
	ИначеЕсли ЭтоАдресВременногоХранилища(Адрес) Тогда
		Изображение = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес));
		Если ТекущийОбъект.Изображение.Получить() <> Изображение.Получить() Тогда
			ТекущийОбъект.Изображение = Изображение;
		КонецЕсли;
	ИначеЕсли ПустаяСтрока(Адрес) И ЗначениеЗаполнено(ТекущийОбъект.Изображение.Получить()) Тогда
		ТекущийОбъект.Изображение = NULL;
	КонецЕсли;
КонецПроцедуры

Процедура Логировать(ИмяСобытия, Ошибка, Данные=Неопределено, Уровень=Неопределено) Экспорт
	ЗаписьЖурналаРегистрации(ИмяСобытия, ?(Уровень=Неопределено, УровеньЖурналаРегистрации.Ошибка, Уровень),, Данные, Ошибка);
КонецПроцедуры

Функция Внятно(Слово, Целиком=Ложь)
	Если Целиком Тогда
		Возврат СтрУдалить(Слово, "\");
	КонецЕсли;
	
	Ответ	= "";
	Для Индекс = 1 По СтрДлина(Слово) Цикл
		Если СтрСравнить("\", Сред(Слово, Индекс, 1)) = 0 Тогда
			Прервать;
		Иначе
			Ответ = Ответ + Сред(Слово, Индекс, 1);
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Функция ПервоеДороже(Слова, Первое=Ложь)
	Ответ	= "";
	мСлова = Разделить(Слова, ":", Истина);
	Если Первое Тогда
		Если мСлова.Количество() > 1
		И НЕ ПустаяСтрока(мСлова.Получить(0))
		Тогда
			Ответ = мСлова.Получить(0);
		КонецЕсли;
	Иначе
		Если мСлова.Количество() = 1 Тогда
			Ответ	= Слова;
		Иначе
			Если мСлова.Количество() >= 2 Тогда
				Ответ	= мСлова.Получить(1);
				Для Индекс = 2 По мСлова.ВГраница() Цикл
					Ответ	= Ответ + ":" + мСлова.Получить(Индекс);
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция Причесать(Текст) Экспорт
	Если ПустаяСтрока(Текст) Тогда Возврат ""; КонецЕсли;
	Ответ	= "";
	Слова	= СтрЗаменить(СтрЗаменить(Текст, "\n\n", Символы.ПС), "\n", " ");
	Для НомерСтроки = 1 По СтрЧислоСтрок(Слова) Цикл
		Слово	= СтрПолучитьСтроку(Слова, НомерСтроки);
		Если СтрНайти2(Слово, "http") = 0 Тогда
			Ответ	= ?(ПустаяСтрока(Ответ), Слово, Ответ + Символы.ПС + Слово);
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Функция СтадионПодобрать(Слово, Стадионы)
	Стадион	= Стадионы.Получить(Слово);
	Если Стадион = Неопределено Тогда
		Стадион	= СтадионНайти(Слово);
		Если ЗначениеЗаполнено(Стадион) Тогда
			Стадионы.Вставить(Слово, Стадион);
		КонецЕсли;
	КонецЕсли;
	Возврат ?(ЗначениеЗаполнено(Стадион), Стадион, Справочники.Стадионы.ПустаяСсылка());
КонецФункции

Функция СтадионыЧемпионата(Чемпионат) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Стадионы.Ссылка КАК Стадион
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
	                      |		ПО ЧемпионатыКоманды.Команда = Стадионы.Владелец
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Стадион
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

Функция СтрокаКакКоманды(Знач Слова, Тимз, ВидСпорта)
	Ответ	= Новый Массив;
	Слова	= СокрЛП(СтрУдалить(СтрУдалить(Слова, "(A)"), "(H)"));
	Солянка	= "";
	мСлова	= Новый Массив;
	Для Каждого Слово Из Разделить(Слова) Цикл
		Если СтрСравнить(Слово, "vs") = 0 Тогда
			мСлова.Добавить(Солянка);
			Солянка	= "";
		ИначеЕсли ПустаяСтрока(Солянка) Тогда
			Солянка	= Слово;
		Иначе
			Солянка	= Солянка + " " + Слово;
		КонецЕсли;
	КонецЦикла;
	мСлова.Добавить(Солянка);
	
	Для Каждого Слово Из мСлова Цикл
		Команда	= Тимз.Получить(Слово);
		Если Команда = Неопределено Тогда
			Команда	= КомандаНайти(Слово, ВидСпорта);
			Если ЗначениеЗаполнено(Команда) Тогда
				Тимз.Вставить(Слово, Команда);
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(Команда) Тогда
			Ответ.Добавить(Команда);
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Функция ОписаниеПолучить(Слова)
	Данные	= Новый Структура("ТурКод,Комментарий2", 0, "");
	Для Каждого Слово Из Разделить(Слова, "|", Истина) Цикл
		Если СтрНайти2(Слово, "matchweek") > 0 Тогда
			Данные.ТурКод	= СтрокаКакЧисло(СтрУдалить(НРег(Слово), "matchweek"));
		ИначеЕсли ПустаяСтрока(Данные.Комментарий2) Тогда
			Данные.Комментарий2	= Слово;
		КонецЕсли;
	КонецЦикла;
	Возврат Данные;
КонецФункции

Функция ТурПодобрать(Матч)
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Код = &ТурКод
	                      |	И (&Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания
	                      |			ИЛИ &Дата МЕЖДУ Туры.Владелец.ДатаНачала И Туры.Владелец.ДатаОкончания)
	                      |	И Туры.Владелец.Команды.Команда В(&Команды)
	                      |	И Туры.Владелец.Владелец.Комментарий ПОДОБНО &Комментарий
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	&Дата МЕЖДУ Туры.ДатаНачала И Туры.ДатаОкончания УБЫВ,
	                      |	Туры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Команды",		Матч.Команды);
	Запрос.УстановитьПараметр("Дата",			НачалоДня(Матч.Дата));
	Запрос.УстановитьПараметр("ТурКод",			Матч.ТурКод);
	Запрос.УстановитьПараметр("Комментарий",	Обернуть(Матч.Комментарий));
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	Возврат Справочники.Туры.ПустаяСсылка();
КонецФункции

Функция ИмпортИгрПоКалендарю(Текст, Команда) Экспорт
	Если ПустаяСтрока(Текст) Тогда Возврат 0; КонецЕсли;
	Ответ	= 0;
	Тимз	= Новый Соответствие;
	Стадионы	= Новый Соответствие;
	ВидСпорта	= Справочники.ВидыСпорта.ПустаяСсылка();
	Если ЗначениеЗаполнено(Команда) Тогда
		ВидСпорта	= ВидСпорта(Команда);
	КонецЕсли;
	Искать	= Истина;
	Элемент = Новый Структура("ЭтоСобытие,Дата,Команды,Стадион,Комментарий,Комментарий2,ТурКод");
	Зачистить(Элемент);
	Для НомерСтроки = 1 По СтрЧислоСтрок(Текст) Цикл
		Слово	= СтрПолучитьСтроку(Текст, НомерСтроки);
		Первое	= ПервоеДороже(Слово, Истина);
		Если СтрСравнить(Первое, "BEGIN") = 0 Тогда
			Зачистить(Элемент, СтрСравнить(ПервоеДороже(Слово), "VEVENT") = 0);
			
		ИначеЕсли НЕ Элемент.ЭтоСобытие Тогда
			//
		ИначеЕсли ПустаяСтрока(Первое) Тогда
			Если НЕ ПустаяСтрока(Элемент.Комментарий) Тогда
				Элемент.Комментарий = Элемент.Комментарий + ПервоеДороже(Слово);
			КонецЕсли;
		ИначеЕсли СтрСравнить(Первое, "DTSTART") = 0 Тогда
			Элемент.Дата	= СтрокаКакДата(ПервоеДороже(Слово));
			Если Элемент.Дата <= ТекущаяУниверсальнаяДата() Тогда
				Зачистить(Элемент);
			КонецЕсли;
		ИначеЕсли СтрСравнить(Первое, "SUMMARY") = 0 Тогда
			Элемент.Команды = СтрокаКакКоманды(ПервоеДороже(Слово), Тимз, ВидСпорта);
		ИначеЕсли СтрСравнить(Первое, "LOCATION") = 0 Тогда
			Слово	= Внятно(ПервоеДороже(Слово), Истина);
			Элемент.Стадион = СтадионПодобрать(Слово, Стадионы);
		ИначеЕсли СтрСравнить(Первое, "DESCRIPTION") = 0 Тогда
			Если Ложь Тогда
				Элемент.Комментарий = ПервоеДороже(Слово);
				ЗаполнитьЗначенияСвойств(Элемент, ОписаниеПолучить(ПервоеДороже(Слово)));
			КонецЕсли;
		ИначеЕсли СтрСравнить(Первое, "END") = 0 Тогда
			Если Элемент.Дата < ТекущаяДатаСеанса() Тогда
				//
			ИначеЕсли Элемент.Команды.Количество() = 2 Тогда
				Матч	= МатчНайти(Элемент.Команды, Элемент.Дата);
				Если Матч.Проведен Тогда
					//
				ИначеЕсли ЗначениеЗаполнено(Матч) Тогда
					МатчОбъект	= Матч.ПолучитьОбъект();
					Если МатчОбъект.ПометкаУдаления Тогда
						МатчОбъект.УстановитьПометкуУдаления(Ложь);
					КонецЕсли;
					ОбщегоНазначения.УстановитьЗначение(МатчОбъект.Дата, Элемент.Дата);
					Если НЕ ЗначениеЗаполнено(МатчОбъект.Стадион)
					И ЗначениеЗаполнено(Элемент.Стадион)
					Тогда
						МатчОбъект.Стадион	= Элемент.Стадион;
					КонецЕсли;
					Если НЕ ЗначениеЗаполнено(МатчОбъект.Тур) Тогда
						ОбщегоНазначения.УстановитьЗначение(МатчОбъект.Тур, ТурПодобрать(Элемент));
					КонецЕсли;
					//ОбщегоНазначения.УстановитьЗначение(МатчОбъект.Комментарий, Причесать(Элемент.Комментарий));
				Иначе
					МатчОбъект	= МатчСоздать(Искать);
					МатчОбъект.Заполнить(Элемент);
				КонецЕсли;
				Если МатчОбъект.Модифицированность() Тогда
					МатчОбъект.Записать(РежимЗаписиДокумента.Запись);
					МатчОбъект.УстановитьПометкуУдаления(Ложь);
					Ответ	= Ответ + 1;
				КонецЕсли;
			//ИначеЕсли Элемент.Команды.Количество() < 2 Тогда
			КонецЕсли;
			Зачистить(Элемент);
		КонецЕсли;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Процедура КомандыСвернуть(Команды) Экспорт
	ТЧ	= Команды.Выгрузить();
	ТЧ.Свернуть("Команда");
	Если ТЧ.Количество() < Команды.Количество() Тогда
		Команды.Свернуть("Команда");
	КонецЕсли;
КонецПроцедуры

Функция КоличествоМатчей(Параметр) Экспорт
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец = &Параметр
	      	               |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч");
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Туры") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) КАК Количество
		               |ИЗ
		               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |ГДЕ
		               |	ТурнирнаяТаблица.Тур = &Параметр
		               |	И ТурнирнаяТаблица.Регистратор ССЫЛКА Документ.Матч";
	КонецЕсли;
	Запрос.УстановитьПараметр("Параметр",			Параметр);
	Выборка	= Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Количество;
	КонецЕсли;
	Возврат 0;
КонецФункции

Процедура СерииЗаполнить(График, ЗабитоПропущено=Ложь) Экспорт
	Если ЗабитоПропущено Тогда
		Серия		= График.УстановитьСерию("Забито");
		Серия.Цвет	= ЦветаСтиля.ЦветАкцента;
		Серия		= График.УстановитьСерию("Пропущено");
		Серия.Цвет	= ЦветаСтиля.ЦветОтрицательногоЧисла;
	Иначе
		Серия		= График.УстановитьСерию("Проигрыш");
		Серия.Цвет	= ЦветаСтиля.ЦветОтрицательногоЧисла;
		Серия		= График.УстановитьСерию("Ничья");
		Серия.Цвет	= ЦветаСтиля.ЦветАктивности;
		Серия		= График.УстановитьСерию("Выигрыш");
		Серия.Цвет	= ЦветаСтиля.ЦветАкцента;
	КонецЕсли;
КонецПроцедуры

Процедура УстановитьЗначение(График, Точка, Серия, Значение)
	//Если Значение <> 0 Тогда
		Попытка
			Если ЗначениеЗаполнено(Точка.Расшифровка) Тогда
				График.УстановитьЗначение(Точка, График.Серии.Получить(Серия), Значение, Серия);
			Иначе
				График.УстановитьЗначение(Точка, График.Серии.Получить(Серия), Значение);
			КонецЕсли;
		Исключение КонецПопытки;
	//КонецЕсли;
КонецПроцедуры

Процедура ГрафикОбновить(График, Данные, ЗабитоПропущено=Ложь) Экспорт
	ШалостьУдалась	= Ложь;
	Если График.Серии.Количество() = 0 Или График.Серии.Количество() <> ?(ЗабитоПропущено, 2, 3) Тогда
		График.Очистить();
		СерииЗаполнить(График, ЗабитоПропущено);
	Иначе
		График.Точки.Очистить();
	КонецЕсли;
	Расшифровка = Новый Структура("Команда");
	Для Каждого Детали Из Данные Цикл
		ЗаполнитьЗначенияСвойств(Расшифровка, Детали);
		Если ЗначениеЗаполнено(Расшифровка.Команда) Тогда
			Точка	= График.УстановитьТочку(Расшифровка.Команда);
			Точка.Расшифровка	= Расшифровка.Команда;
		Иначе
			Точка	= График.УстановитьТочку(".");
		КонецЕсли;
		Если ЗабитоПропущено Тогда
			УстановитьЗначение(График, Точка, 0, Детали.КоличествоЗабито);
			УстановитьЗначение(График, Точка, 1, Детали.КоличествоПропущено);
		Иначе
			УстановитьЗначение(График, Точка, 0, Детали.Проигрыш);
			УстановитьЗначение(График, Точка, 1, Детали.Ничья);
			УстановитьЗначение(График, Точка, 2, Детали.Выигрыш);
		КонецЕсли;
		Если НЕ ШалостьУдалась
		И ?(ЗабитоПропущено, Детали.КоличествоЗабито + Детали.КоличествоПропущено, Детали.Проигрыш + Детали.Ничья + Детали.Выигрыш) > 0
		Тогда
			ШалостьУдалась	= Истина;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ШалостьУдалась Тогда
		График.Точки.Очистить();
	КонецЕсли;
КонецПроцедуры

Функция Выборка2СписокЗначений(Выборка, Количество=10) Экспорт
	Ответ	= Новый СписокЗначений;
	Пока Ответ.Количество() <= Количество И Выборка.Следующий() Цикл
		Ответ.Добавить(Выборка.Значение, Выборка.Представление);
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Функция ДанныеРасшифровкиПолучитьЗначение(ДанныеРасшифровки, Расшифровка) Экспорт
	Ответ	= Неопределено;
	Данные	= ПолучитьИзВременногоХранилища(ДанныеРасшифровки);
	Поля	= Данные.Элементы[Расшифровка].ПолучитьПоля();
	Если Поля.Количество() > 0 Тогда
		Ответ	= Поля.Получить(0).Значение;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ИмпортУРЛ(Тур) Экспорт
	Ответ = КомментарийКакУРЛ(Тур.Комментарий);
	Если ПустаяСтрока(Ответ) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Чемпионаты.Владелец.Комментарий КАК Комментарий,
		                      |	Чемпионаты.ДатаОкончания КАК ДатаОкончания,
		                      |	Туры.Код КАК Код,
		                      |	2 КАК Порядок
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		                      |		ПО Туры.Владелец = Чемпионаты.Ссылка
		                      |ГДЕ
		                      |	Туры.Ссылка = &Тур
		                      |	И Чемпионаты.Владелец.Комментарий ПОДОБНО ""%http%""
		                      |
		                      |ОБЪЕДИНИТЬ ВСЕ
		                      |
		                      |ВЫБРАТЬ
		                      |	Чемпионаты.Комментарий,
		                      |	Чемпионаты.ДатаОкончания,
		                      |	Туры.Код,
		                      |	1
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		                      |		ПО Туры.Владелец = Чемпионаты.Ссылка
		                      |ГДЕ
		                      |	Туры.Ссылка = &Тур
		                      |	И Чемпионаты.Комментарий ПОДОБНО ""%http%""
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	Порядок");
		Запрос.УстановитьПараметр("Тур",			Тур);
		Выборка = Запрос.Выполнить().Выбрать();
		Пока ПустаяСтрока(Ответ) И Выборка.Следующий() Цикл
			Год		= ФорматЧГ(Выборка.ДатаОкончания);
			Код		= ФорматЧГ(Выборка.Код);
			Ответ	= КомментарийКакУРЛ(Выборка.Комментарий);
			Если ПустаяСтрока(Ответ) Тогда
				//
			ИначеЕсли СтрНайти(Ответ, "/%2/") > 0 И СтрНайти(Ответ, "/%1/") > 0 Тогда
				Ответ = СтрШаблон(Ответ, Год, Код);
			ИначеЕсли СтрНайти(Ответ, "/%1/") > 0 Тогда
				Ответ = СтрШаблон(Ответ, Код);
			ИначеЕсли СтрНайти(Ответ, "%") = 0 Тогда
				Если СтрНайти(Ответ, Год) = 0
				И СтрНайти(Ответ, "/" + Код + "/") = 0
				Тогда
					Ответ = СтрШаблон(Ответ + ?(Год(Выборка.ДатаОкончания) > 2010, "%1/%2/", "%1/%2.htm"), Год, Код);
				ИначеЕсли СтрНайти(Ответ, Год) > 0 Тогда
					Ответ = СтрШаблон(Ответ + ?(Год(Выборка.ДатаОкончания) > 2010, "%1/", "%1.htm"), Код);
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Процедура ЗапуститьРегламентноеЗадание(Имя="ИмпортИгр") Экспорт
	Регламент	= Метаданные.РегламентныеЗадания.Найти(?(ПустаяСтрока(Имя), "ИмпортИгр", Имя));
	ИмяМетода	= Регламент.ИмяМетода;
	Если ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода,Состояние", ИмяМетода, СостояниеФоновогоЗадания.Активно)).Количество() = 0 Тогда
		ФоновыеЗадания.Выполнить(ИмяМетода,,, СтрШаблон("Запуск вручную: %1", Регламент.Синоним));
	КонецЕсли;
КонецПроцедуры

Функция ИгрокиКоманды(Команда, Дата)
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок,
	      	               |	ПеремещенияИгроков.Команда КАК Команда,
	      	               |	ПеремещенияИгроков.Амплуа КАК Амплуа,
	      	               |	ПеремещенияИгроков.Номер КАК Номер
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроков
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда");
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("Команда",			Команда);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ИгрокНайти2(Наименование, ДатаРождения)
	Игрок	= ИгрокНайти(Наименование, ДатаРождения);
	Возврат Игрок.Игрок;
КонецФункции

Функция ИмпортНаполнитель2(Команда, Дата)
	Возврат Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Комментарий,Амплуа,Страна,Игрок", Команда, Дата, 0, Дата(1,1,1), "", "");
КонецФункции

Процедура ИмпортСтроки2(сИгрок, Слово, Параметры)
	Если ПустаяСтрока(Слово) Тогда
		//
	ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
		Если ПустаяСтрока(сИгрок.Наименование) Тогда
			Если сИгрок.Номер = 0 Тогда
				сИгрок.Номер = СтрокаКакЧисло(Слово);
			КонецЕсли;
		// ДатаРождения заполняется только после имени
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.ДатаРождения) Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа)
	И Параметры.Амплуа.Найти(НРег(Слово)) <> Неопределено
	Тогда
		сИгрок.Амплуа = Амплуа(Слово);
	КонецЕсли;
КонецПроцедуры

Функция НовоеСтарье(Новое, Старье, Параметры)
	Итого = 0;
	Для Каждого ТекСтрока Из Старье Цикл
		Номер	= Новое.Получить(ТекСтрока.Игрок);
		Если Номер = Неопределено Или ДобавитьМесяц(Параметры.ДатаНачала, 11) < ТекущаяДатаСеанса() Тогда		//	уволить
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок", Параметры.ДатаНачала, ТекСтрока.Игрок));
		ИначеЕсли Номер <> ТекСтрока.Номер Тогда
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок,Команда,Амплуа,Номер", Параметры.ДатаНачала, ТекСтрока.Игрок, ТекСтрока.Команда, ТекСтрока.Амплуа, Номер));
		Иначе
			Продолжить;
		КонецЕсли;
		ОбъектЗаписать(Запись);
		
		Итого = Итого + 0.01;
	КонецЦикла;
	Возврат Итого;
КонецФункции

Функция ДатаНачалаСезона(Гиперссылка="", Команда)
	Если НЕ ПустаяСтрока(Гиперссылка) Тогда
		Слова = Разделить(Гиперссылка, "/");
		Для Каждого Слово Из Слова Цикл
			Год	= СтрокаКакЧисло(Слово);
			Если Год >= 2007 И Год <= 1 + Год(ТекущаяДатаСеанса()) Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	НАЧАЛОПЕРИОДА(ЧемпионатыКоманды.Ссылка.ДатаНачала, МЕСЯЦ) КАК ДатаНачала
				                      |ИЗ
				                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
				                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
				                      |		ПО ЧемпионатыКоманды.Ссылка.Владелец.Страна = Страны.Ссылка
				                      |ГДЕ
				                      |	ЧемпионатыКоманды.Команда = &Команда
				                      |	И ГОД(ЧемпионатыКоманды.Ссылка.ДатаОкончания) = &Год
				                      |	И ЧемпионатыКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
				                      |
				                      |УПОРЯДОЧИТЬ ПО
				                      |	ЧемпионатыКоманды.Ссылка.Владелец.ОлимпийскаяСистема");
				Запрос.УстановитьПараметр("Команда",			Команда);
				Запрос.УстановитьПараметр("Год",				Год);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Возврат Выборка.ДатаНачала;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Чемпионат	= ЧемпионатЛигиПоследний(Команда);
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			Возврат НачалоМесяца(Чемпионат.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
	Ответ = Дата(Год(ТекущаяДатаСеанса()), 7, 1);
	Пока Ответ > ТекущаяДатаСеанса() Цикл
		Ответ = ДобавитьМесяц(Ответ, -6);
	КонецЦикла;
	Возврат Ответ;
КонецФункции

Процедура Зачистить2(Виктим, АмплуаУдалить=Ложь)
	ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Номер,ДатаРождения,Наименование,Комментарий,Страна,Игрок", 0, Дата(1,1,1), "", ""));
	Если АмплуаУдалить Тогда
		ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Амплуа"));
	КонецЕсли;
КонецПроцедуры

Функция ОбъектЗаписать(Объект) Экспорт
	Ответ	= Ложь;
	Если Объект.ПроверитьЗаполнение() Тогда
		Попытка
			Объект.Записать();
			Ответ	= Истина;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ИмпортИгроковНаСервере(Гиперссылка, Команда) Экспорт
	Итого		= 0;
	
	Параметры	= Новый Структура("ДатаНачала", ДатаНачалаСезона(Гиперссылка, Команда));
	Параметры.Вставить("Исключения",	Разделить("-,№,м,г,ж,к,гражданство,год рожд.,игры,голы", ","));
	ВсеПлохо	= НРег(Команда.Наименование);
	Старье		= ИгрокиКоманды(Команда, Параметры.ДатаНачала + Сутки());
	Новое		= Новый Соответствие;

	Слова	= ПолучитьЭлементыПоИмени(Гиперссылка, "font");
	сИгрок	= ИмпортНаполнитель2(Команда, Параметры.ДатаНачала);
	Для Каждого Слово Из Слова Цикл
		Если СтрСравнить(Слово, "Соперник") = 0 Тогда
			Прервать;
		ИначеЕсли СтрСравнить(Слово, "Игроки") = 0 Тогда
			сИгрок.Команда	= Неопределено;
			сИгрок.Период	= КонецГода(Параметры.ДатаНачала);
			сИгрок.Амплуа	= Справочники.Амплуа.ПустаяСсылка();
			
		ИначеЕсли СтрЧислоСтрок(Слово) > 1 Тогда
			//
		ИначеЕсли Параметры.Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
			Если ПустаяСтрока(сИгрок.Наименование) Тогда
				сИгрок.Номер = 0;
			КонецЕсли;
			
		ИначеЕсли НЕ ПустаяСтрока(ВсеПлохо) Тогда
			Если СтрНайти2(Слово, ВсеПлохо) > 0 Тогда
				ВсеПлохо = "";
			ИначеЕсли СтрНайти2(Команда.Комментарий, НРег(Слово)) > 0 Тогда
				ВсеПлохо = "";
			КонецЕсли;
		ИначеЕсли СтрЧислоСтрок(Слово) > 1 Тогда
			сИгрок.Номер = 0;
		ИначеЕсли СтрСравнить(Слово, "Вратари") = 0 Тогда
			сИгрок.Амплуа = Амплуа("Вратарь");
		ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
			сИгрок.Амплуа = Амплуа("Защитник");
		ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
			сИгрок.Амплуа = Амплуа("Полузащитник");
		ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
			сИгрок.Амплуа = Амплуа("Нападающий");
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа) Тогда
			//
		ИначеЕсли сИгрок.Номер = 0 И ЗначениеЗаполнено(сИгрок.Команда) Тогда
			сИгрок.Номер = ?(СтрСравнить(Слово, "n") = 0, -1, Макс(0, СтрокаКакЧисло(Слово)));
			сИгрок.Наименование	= "";
			
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрокаСодержитЧисло(Слово) Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрНайти(Слово, ".") > 0 Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрДлина(Слово) >= 3 Тогда
				сИгрок.Наименование = СтрЗаменить(Слово, "  ", " ");
			Иначе
				сИгрок.Номер = 0;
			КонецЕсли;

		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			Если СтрокаКакЧисло(Слово) <> 0 Тогда Продолжить; КонецЕсли;
			
			сИгрок.Страна = СтранаНайти(Слово);
			//
			сИгрок.Игрок = ИгрокНайти2(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если ОбъектЗаписать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Новое.Вставить(сИгрок.Игрок, Макс(0, сИгрок.Номер));
			
			Если ?(ЗначениеЗаполнено(сИгрок.Команда), сИгрок.Команда <> КомандаИгрока(сИгрок.Игрок, сИгрок.Период), Команда = КомандаИгрока(сИгрок.Игрок)) Тогда
				Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, сИгрок);
				Если ОбъектЗаписать(Запись) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить2(сИгрок);
		КонецЕсли;
	КонецЦикла;
	Если Итого > 0 Тогда
		Итого = Итого + НовоеСтарье(Новое, Старье, Параметры);
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

Функция ИмпортИгроковНаСервере2(Гиперссылка, Команда) Экспорт
	Итого	= 0;
	Шагов	= 0;
	
	сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Страна,Игрок", Команда, ДатаНачалаСезона(Гиперссылка, Команда), 0, Дата(1,1,1), "");
	//Амплуа
	
	Слова	= ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Шагов	= Шагов + 1;
		Если Шагов > 321 Тогда
			Прервать;
		ИначеЕсли Шагов = 1 Тогда
			Если СтрСравнить(Слово, Команда.Наименование) <> 0 Тогда	// возможно ошибка урл
				Прервать;
			КонецЕсли;
		ИначеЕсли СтрСравнить(Слово, "-") = 0 Тогда
			сИгрок.Номер = 0;
		//ИначеЕсли Макс(0, СтрокаКакЧисло(Слово)) > 0 Тогда
		//	сИгрок.Номер		= СтрокаКакЧисло(Слово);
		//	сИгрок.Наименование	= "";
		ИначеЕсли сИгрок.Номер = 0 Тогда
			сИгрок.Номер		= СтрокаКакЧисло(Слово);
			сИгрок.Наименование	= "";
		//ИначеЕсли СтрНайти("тур,дата,соперник,голы", НРег(Слово)) > 0 И Шагов > 0 Тогда
		//	Прервать;
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрДлина(Слово) > 7 И Год(СтрокаКакДата(Слово)) > 2000 Тогда
				Прервать;
			ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
				Прервать;
			ИначеЕсли СтрДлина(Слово) >= 3 Тогда
				сИгрок.Наименование = Слово;
			КонецЕсли;
			
		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			сИгрок.Страна = СтранаНайти(Слово);
			
	//	КонецЕсли;
	//
	//	Если НЕ ПустаяСтрока(сИгрок.Наименование)
	//	И Год(сИгрок.ДатаРождения) > 1
	//	И сИгрок.Номер > 0
	//	И ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны")
	//	Тогда
		ИначеЕсли ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны") Тогда
 			сИгрок.Игрок = ИгрокНайти2(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если ОбъектЗаписать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Последнее = РегистрыСведений.ПеремещенияИгроков.ПолучитьПоследнее(сИгрок.Период, Новый Структура("Игрок", сИгрок.Игрок));
			Если Последнее.Команда <> Команда
			//Или Последнее.Номер <> сИгрок.Номер
			Тогда
				НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НЗ, сИгрок);
				Если ОбъектЗаписать(НЗ) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить2(сИгрок);
		КонецЕсли;
	КонецЦикла;
	Возврат (Итого > 0);
КонецФункции

Функция ИмпортИгроковПоСтроке(Гиперссылка, Команда) Экспорт
	Итого		= 0;
	
	Параметры	= Новый Структура("ДатаНачала", ДатаНачалаСезона(, Команда));
	Параметры.Вставить("Амплуа",		Разделить("вратарь защитник полузащитник нападающий"));
	Параметры.Вставить("Исключения",	Разделить("№ игрок амплуа др рост вес"));
	Старье		= ИгрокиКоманды(Команда, Параметры.ДатаНачала + Сутки());
	Новое		= Новый Соответствие;
	сИгрок		= ИмпортНаполнитель2(Команда, Параметры.ДатаНачала);
	Для Каждого Слово Из Разделить(Гиперссылка, "¶") Цикл
		Если ПустаяСтрока(Слово) Тогда
			Продолжить;
		ИначеЕсли СтрСравнить(Слово, "отзаявлены") = 0 Тогда
			Прервать;
		ИначеЕсли СтрНайти(Слово, Символ(9)) > 0 Тогда
			Для Каждого ПодСтрока Из Разделить(Слово, Символ(9)) Цикл
				Если Параметры.Исключения.Найти(НРег(ПодСтрока)) = Неопределено Тогда
					ИмпортСтроки2(сИгрок, ПодСтрока, Параметры);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Параметры.Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
			Продолжить;
		ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
			Если сИгрок.Номер = 0 Тогда
				сИгрок.Номер = СтрокаКакЧисло(Слово);
			ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.ДатаРождения) Тогда
				сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа)
		И Параметры.Амплуа.Найти(НРег(Слово)) <> Неопределено
		Тогда
			сИгрок.Амплуа = Амплуа(Слово);
		//ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.ДатаРождения) Тогда
			Если НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда					// может это страна
				сИгрок.Страна = СтранаНайти(Слово, Истина);
				Если ЗначениеЗаполнено(сИгрок.Страна) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если СтрНайти(Слово, " ") > 0 Тогда
				Если СтрЧислоВхождений(Слово, " ") = 1 Тогда
					сИгрок.Наименование = Слово;
				Иначе
					сИгрок.Комментарий = Слово;
					мСлова	= Разделить(Слово);
					Префикс	= "";
					Предлоги= Разделить("ван де ди ла");
					Для Каждого Ван Из мСлова Цикл
						Если ПустаяСтрока(Префикс) Тогда
							Для Каждого Предлог Из Предлоги Цикл
								Если СтрСравнить(Ван, Предлог) = 0 Тогда
									Префикс = Ван;
									Прервать;
								КонецЕсли;
							КонецЦикла;
						Иначе
							Прервать;
						КонецЕсли;
					КонецЦикла;
					Если ПустаяСтрока(Префикс) Тогда
						сИгрок.Наименование = мСлова.Получить(0) + " " + мСлова.Получить(мСлова.ВГраница());
					Иначе
						Для Итератор = 1 По мСлова.ВГраница() Цикл
							Если ПустаяСтрока(сИгрок.Наименование) И СтрСравнить(Префикс, мСлова.Получить(Итератор)) = 0 Тогда
								сИгрок.Наименование = мСлова.Получить(0) + " " + Префикс;
							ИначеЕсли НЕ ПустаяСтрока(сИгрок.Наименование) Тогда
								сИгрок.Наименование = сИгрок.Наименование + " " + мСлова.Получить(Итератор);
								Прервать;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(сИгрок.Наименование)
		И ЗначениеЗаполнено(сИгрок.ДатаРождения)
		//И ЗначениеЗаполнено(сИгрок.Амплуа)
		//И сИгрок.Номер <> 0
		Тогда
			сИгрок.Игрок = ИгрокНайти2(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				Если ЗначениеЗаполнено(сИгрок.Амплуа) Тогда
					ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				КонецЕсли;
				Если ЗначениеЗаполнено(сИгрок.Страна) Тогда
					ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
				КонецЕсли;
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если ОбъектЗаписать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Новое.Вставить(сИгрок.Игрок, Макс(0, сИгрок.Номер));
			
			Если сИгрок.Команда <> КомандаИгрока(сИгрок.Игрок, сИгрок.Период) Тогда
				Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, сИгрок);
				Если ОбъектЗаписать(Запись) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить2(сИгрок, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Итого = Итого + НовоеСтарье(Новое, Старье, Параметры);
	
	Возврат (Итого > 0);
КонецФункции
