
Функция ФазаЦикличность(Фаза) Экспорт
	Возврат ?(Фаза=3, 33, ?(Фаза=2, 28, 23));
КонецФункции

Функция ФЭИ(Фаза=1) Экспорт
	Возврат ?(Фаза=3, "Интеллектуальный", ?(Фаза=2, "Эмоциональный", "Физический"));
КонецФункции

Функция МояКомандаПолучить() Экспорт
	Возврат Константы.МояКоманда.Получить();
КонецФункции

Функция ТурнирнаяТаблицаКакНаBBC() Экспорт
	Возврат Константы.ТурнирнаяТаблицаКакНаBBC.Получить();
КонецФункции

Функция ПоказыватьРазницуМячей() Экспорт
	Возврат ?(ТурнирнаяТаблицаКакНаBBC(), Истина, Константы.ПоказыватьРазницуМячей.Получить());
КонецФункции

Функция СтарыйВидАнонсов() Экспорт
	Возврат Константы.СтарыйВидАнонсов.Получить();
КонецФункции

Функция КоличествоМатчейВАнонсе() Экспорт
	Возврат Макс(5, Константы.КоличествоМатчейВАнонсе.Получить());
КонецФункции

Функция ВыводитьТурВместоЧемпионата() Экспорт
	Возврат Константы.ВыводитьТурВместоЧемпионата.Получить();
КонецФункции

Функция ПоказыватьПредстоящиеМатчи() Экспорт
	Возврат Константы.ПоказыватьПредстоящиеМатчи.Получить();
КонецФункции

Функция Сессия() Экспорт
	Возврат 1000 * НомерСоединенияИнформационнойБазы() + НомерСеансаИнформационнойБазы();
КонецФункции

Функция ВыводитьЛоготипыКоманд() Экспорт
	Возврат Константы.ВыводитьЛоготипыКоманд.Получить();
КонецФункции
