
Функция ФазыРасчитать(Знач ДатаРождения, Знач ТекущаяДата=Неопределено) Экспорт
	ТекущаяДата	= НачалоДня(?(ТекущаяДата=Неопределено, ТекущаяДатаСеанса(), ТекущаяДата));
	Ответ	= Новый Структура("Физический,Эмоциональный,Интеллектуальный", 0, 0, 0);
	Ответ.Физический		= ФазаРасчитать2((ТекущаяДата - ДатаРождения) / Сутки(), 1);
	Ответ.Эмоциональный		= ФазаРасчитать2((ТекущаяДата - ДатаРождения) / Сутки(), 2);
	Ответ.Интеллектуальный	= ФазаРасчитать2((ТекущаяДата - ДатаРождения) / Сутки(), 3);
	Возврат Ответ;
КонецФункции

Функция ФазаРасчитать1(ДатаРождения, Знач Фаза=1, Знач ТекущаяДата=Неопределено) Экспорт
	Возврат ФазаРасчитать2(Цел((НачалоДня(?(ТекущаяДата=Неопределено, ТекущаяДатаСеанса(), ТекущаяДата)) - ДатаРождения) / Сутки()), Фаза);
КонецФункции

Функция ФазаРасчитать2(КоличествоДней, Фаза=1) Экспорт
	Количество	= ФазаЦикличность(Фаза);									//	общее количество дней фазы
	Ответ		= КоличествоДней - Количество * Цел(КоличествоДней / Количество);		//	день фазы
	Если Ответ <= Окр(Количество / 4, 1) Тогда
		Ответ	= Окр(Ответ * 25 / Количество, 1);
	ИначеЕсли Ответ <= Окр(Количество / 2, 1) Тогда
		Ответ	= Окр((Количество / 4 - (Ответ - Количество / 4)) * 25 / Количество, 1);
	ИначеЕсли Ответ <= Окр(Количество / 4 * 3, 1) Тогда	// минус
		Ответ	= - Окр((Ответ - Количество / 2) * 25 / Количество, 1);
	Иначе	//Если Ответ <= Окр(Фаза / 2, 1) Тогда	// минус
		Ответ	= - Окр((Количество / 4 - (Ответ - Количество / 4 * 3)) * 25 / Количество, 1);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ФЭИ(Фаза=1) Экспорт
	Возврат ?(Фаза=3, "Интеллектуальный", ?(Фаза=2, "Эмоциональный", "Физический"));
КонецФункции

Функция ФазаЦикличность(Фаза) Экспорт
	Возврат ?(Фаза=3, 33, ?(Фаза=2, 28, 23));
КонецФункции

Функция Цвет(Фаза, Дефолт=Ложь) Экспорт
	Ответ	= Неопределено;
	Цвета = ?(Дефолт, Неопределено, Константы.Цвета.Получить().Получить());
	Если ТипЗнч(Цвета) = Тип("Соответствие") Тогда
		Если Фаза = 3 Тогда
			Ответ = Цвета.Получить(3);
		ИначеЕсли Фаза = 2 Тогда
			Ответ = Цвета.Получить(2);
		Иначе
			Ответ = Цвета.Получить(1);
		КонецЕсли;
	КонецЕсли;
	Если Ответ = Неопределено Тогда
		Если Фаза = 3 Тогда
			Возврат ЦветаСтиля.ЦветФонаВыделенияПоля;
		ИначеЕсли Фаза = 2 Тогда
			Возврат ЦветаСтиля.ЦветОтрицательногоЧисла;
		КонецЕсли;
		Возврат ЦветаСтиля.ЦветАкцента;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ЦветаСохранить(Цвета) Экспорт
	Ответ = "";
	Попытка
		Константы.Цвета.Установить(Новый ХранилищеЗначения(Цвета));
	Исключение
		Ответ = ОписаниеОшибки();
	КонецПопытки;
	Возврат Ответ;
КонецФункции
