
Процедура ОбъектПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда
		//
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		//
	ИначеЕсли Источник.Модифицированность() Тогда
		Исправитель	= Новый Структура("Наименование,Комментарий", "", "");
		ЗаполнитьЗначенияСвойств(Исправитель, Источник);
		Исправитель.Наименование	= СокрЛП(Исправитель.Наименование);
		Исправитель.Комментарий		= СокрЛП(Лев(Исправитель.Комментарий, 10000));
		ЗаполнитьЗначенияСвойств(Источник, Исправитель);
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектПриКопировании(Источник, ОбъектКопирования) Экспорт
	ЗаполнитьЗначенияСвойств(Источник, Новый Структура("Комментарий,Изображение", ""));
КонецПроцедуры

Процедура СправочникПередУдалением(Источник, Отказ) Экспорт
	Если НЕ Источник.ПометкаУдаления Тогда
		Отказ = Истина;
	ИначеЕсли СерверныйФункции.ЕстьИстория(Источник.Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		Если Источник.ДополнительныеСвойства.Свойство("Импорт") = Ложь Тогда
			РегистрыСведений.Итоги.Обновить(Источник.Тур.Владелец);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		РегистрыСведений.Итоги.Очистить(Источник.Тур.Владелец);
	КонецЕсли;
КонецПроцедуры
