
Процедура ОбъектПередЗаписью(Источник, Отказ) Экспорт
	Если Отказ Тогда
		//
	ИначеЕсли Источник.ОбменДанными.Загрузка Тогда
		//
	ИначеЕсли Источник.Модифицированность() Тогда
		Исправитель	= Новый Структура("Наименование,Комментарий", "", "");
		ЗаполнитьЗначенияСвойств(Исправитель, Источник);
		Исправитель.Наименование	= СокрЛП(Исправитель.Наименование);
		Исправитель.Комментарий		= СокрЛП(Лев(Исправитель.Комментарий, 10000));
		ЗаполнитьЗначенияСвойств(Источник, Исправитель);
	КонецЕсли;
КонецПроцедуры

Процедура ОбъектПриКопировании(Источник, ОбъектКопирования) Экспорт
	ЗаполнитьЗначенияСвойств(Источник, Новый Структура("Комментарий,Изображение", ""));
КонецПроцедуры

Процедура СправочникПередУдалением(Источник, Отказ) Экспорт
	Если НЕ Источник.ПометкаУдаления Тогда
		Отказ = Истина;
	ИначеЕсли СерверныйФункции.ЕстьИстория(Источник.Ссылка) Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		Если Источник.ДополнительныеСвойства.Свойство("Импорт") = Ложь Тогда
			РегистрыСведений.Итоги.Обновить(Источник.Тур.Владелец);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	Если ЗначениеЗаполнено(Источник.Тур) Тогда
		РегистрыСведений.Итоги.Очистить(Источник.Тур.Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура ИмпортИгр() Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Владелец КАК Чемпионат,
	                      |	Туры.Ссылка КАК Тур,
	                      |	МАКСИМУМ(ЕСТЬNULL(ТурнирнаяТаблица.Период, Туры.ДатаОкончания)) КАК Период
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
	                      |ГДЕ
	                      |	Туры.ПометкаУдаления = ЛОЖЬ
	                      |	И Туры.Владелец.ПометкаУдаления = ЛОЖЬ
	                      |	И Туры.Владелец.ДатаОкончания >= &ДатаН
	                      |	И Туры.Владелец.ДатаНачала <= &ДатаК
	                      |	И Туры.Владелец.Владелец.ОлимпийскаяСистема = ЛОЖЬ
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Ссылка,
	                      |	Туры.Владелец
	                      |
	                      |ИМЕЮЩИЕ
	                      |	1 + 2 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) < КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда)
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Чемпионат,
	                      |	Тур
	                      |ИТОГИ ПО
	                      |	Чемпионат");
	Запрос.УстановитьПараметр("ДатаН",			ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.УстановитьПараметр("ДатаК",			ТекущаяДатаСеанса());
	Чемпионаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Чемпионаты.Следующий() Цикл
		Выборка = Чемпионаты.Выбрать();
		КоличествоОшибок = 0;
		Пока Выборка.Следующий() И КоличествоОшибок < 3 Цикл
			Гиперссылка	= СерверныйФункции.ИмпортУРЛ(Выборка.Тур);
			Если НЕ СерверныйФункции.ИмпортИгрПоГиперссылке(Гиперссылка, Выборка.Тур) Тогда
				КоличествоОшибок = КоличествоОшибок + ?(Выборка.Период > ТекущаяДатаСеанса(), 3, 1);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Матч.Ссылка КАК Ссылка,
	               |	Матч.Дата КАК Период,
	               |	Матч.Комментарий КАК Комментарий
	               |ИЗ
	               |	Документ.Матч КАК Матч
	               |ГДЕ
	               |	Матч.Дата МЕЖДУ &ДатаН И &ДатаК
	               |	И Матч.Проведен = ЛОЖЬ
	               |	И Матч.ПометкаУдаления = ЛОЖЬ
	               |	И Матч.Комментарий ПОДОБНО ""http%""
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Период";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() И КоличествоОшибок <= 3 Цикл
		Гиперссылка	= СерверныйФункции.КомментарийКакУРЛ(Выборка.Комментарий);
		Если НЕ СерверныйФункции.ИмпортМатча(Гиперссылка, Выборка.Ссылка) Тогда
			КоличествоОшибок = КоличествоОшибок + ?(Выборка.Период > ТекущаяДатаСеанса(), 3, 1);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Функция КвизУдалить(Параметры) Экспорт
	Попытка
		НЗ = РегистрыСведений.Квиз.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
		
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции
