
&НаКлиенте
Процедура Скомпоновать() Экспорт
	Если ПроверитьЗаполнение() Тогда
		Попытка
			СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Команда) Тогда
		Команда = МояКоманда();
	КонецЕсли;
	Если НастройкиУстановить() Тогда
		ПодключитьОбработчикОжидания("Скомпоновать", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НастройкиУстановить()
	Ответ		= Ложь;
	Для Каждого Настройка Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если СтрСравнить(Настройка.Параметр, "Команда") = 0 Тогда
			Настройка.Значение = Команда;
			Ответ		= Истина;
		КонецЕсли;
		Настройка.Использование = Истина;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Если ЗначениеЗаполнено(Параметры.Команда) Тогда
			ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма);
			Команда	= Параметры.Команда;
			
			Элемент = Элементы.Найти("ФормаНастройки");
			Если ТипЗнч(Элемент) = Тип("ГруппаФормы") Тогда
				Элемент.Видимость = Ложь;
			КонецЕсли;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
