
&НаКлиенте
Процедура Скомпоновать() Экспорт
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Отчет.Игрок) Тогда
		//
	ИначеЕсли НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Отчет.Команда = МояКоманда();
	КонецЕсли;
	ПодключитьОбработчикОжидания("Скомпоновать", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Игрок	= Параметры.Игрок;
	ИначеЕсли Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Команда	= Параметры.Команда;
	Иначе
		Элементы.Команда.АвтоОтметкаНезаполненного = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.Команда.АвтоОтметкаНезаполненного
	И НЕ ЗначениеЗаполнено(Отчет.Команда)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите команду", Отказ,, "Отчет.Команда");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ОбщегоНазначения.СостояниеОтобразить(Элементы.Результат.ОтображениеСостояния);
КонецПроцедуры
