
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Команда") Тогда
		Если ЗначениеЗаполнено(Параметры.Команда) Тогда
			Команда		= Параметры.Команда;
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Команда) Тогда
		Команда = МояКоманда();
	КонецЕсли;
	НастройкиУстановить();
	Если ПроверитьЗаполнение() Тогда
		Попытка
			СкомпоноватьРезультат();
		Исключение
		КонецПопытки;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура НастройкиУстановить()
	Для Каждого Настройка Из Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы Цикл
		Если СтрСравнить(Настройка.Параметр, "Команда") = 0 Тогда
			Настройка.Значение = Команда;
		КонецЕсли;
		Настройка.Использование = Истина;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
