
&НаКлиенте
Процедура Скомпоновать() Экспорт
	СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(Отчет.Игрок) Тогда
		//
	ИначеЕсли НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
		Отчет.Команда = МояКоманда();
	КонецЕсли;
	ПодключитьОбработчикОжидания("Скомпоновать", 0.1, Истина);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Игрок	= Параметры.Игрок;
	ИначеЕсли Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Команда	= Параметры.Команда;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
