
&НаКлиенте
Процедура Скомпоновать() Экспорт
	СкомпоноватьРезультат();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Элементы.Команда.АвтоОтметкаНезаполненного Тогда
		Если НЕ ЗначениеЗаполнено(Отчет.Команда) Тогда
			Отчет.Команда = МояКоманда();
			СкомпоноватьРезультат(РежимКомпоновкиРезультата.Фоновый);
		КонецЕсли;
	ИначеЕсли Результат.ВысотаТаблицы <= 1 Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Игрок") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Игрок	= Параметры.Игрок;
	ИначеЕсли Параметры.Свойство("Команда") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Команда	= Параметры.Команда;
	ИначеЕсли Параметры.Свойство("Тур") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Тур	= Параметры.Тур;
	ИначеЕсли Параметры.Свойство("Чемпионат") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
		Отчет.Чемпионат	= Параметры.Чемпионат;
	Иначе
		Элементы.Команда.АвтоОтметкаНезаполненного = Истина;
		Возврат;
	КонецЕсли;
	СкомпоноватьРезультат();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Если Элементы.Команда.АвтоОтметкаНезаполненного
	И НЕ ЗначениеЗаполнено(Отчет.Команда)
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Укажите команду", Отказ,, "Отчет.Команда");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ОбщегоНазначения.СостояниеОтобразить(Элементы.Результат.ОтображениеСостояния);
КонецПроцедуры
