
Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Поля.Добавить("Наименование");
    Поля.Добавить("Владелец");
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Данные.Владелец) Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон("%1 (%2)", Данные.Наименование, Данные.Владелец);
	КонецЕсли;
КонецПроцедуры

Функция ГородаПолучить(Страна) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Города.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Города КАК Города
	                      |ГДЕ
	                      |	Города.Владелец = &Страна
	                      |	И Города.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Страна",	Страна);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
