
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Страны") Тогда
		Владелец	= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Владелец") Тогда
			ОбработкаЗаполнения(ДанныеЗаполнения.Владелец, ТекстЗаполнения, Ложь);
		КонецЕсли;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СписокЗначений") Тогда
		Для Каждого ТекЭлемент Из ДанныеЗаполнения Цикл
			ОбработкаЗаполнения(ТекЭлемент.Значение, ТекстЗаполнения, Ложь);
			Прервать;
		КонецЦикла;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Массив") Тогда
		Для Каждого ТекЭлемент Из ДанныеЗаполнения Цикл
			ОбработкаЗаполнения(ТекЭлемент, ТекстЗаполнения, Ложь);
			Прервать;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование	= "";
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Города.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Города КАК Города
	                      |ГДЕ
	                      |	Города.Владелец = &Владелец
	                      |	И Города.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Запрос.УстановитьПараметр("Владелец",		Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> Ссылка Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрШаблон("Есть такой город (%1)", Выборка.Ссылка), Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		//
	ИначеЕсли ПустаяСтрока(Комментарий) Тогда
		Комментарий = Варианты(Наименование);
	КонецЕсли;
КонецПроцедуры

Функция Варианты(Слова)
	Ответ = Новый Массив;
	Если СтрНайти(Слова, "э") > 0 Тогда
		Ответ.Добавить(СтрЗаменить(Слова, "э", "а"));
		Ответ.Добавить(СтрЗаменить(Слова, "э", "е"));
	КонецЕсли;
	Если СтрНайти(Слова, "ё") > 0 Тогда
		Ответ.Добавить(СтрЗаменить(Слова, "ё", "е"));
	КонецЕсли;
	Если СтрНайти(Слова, "й") > 0 Тогда
		Ответ.Добавить(СтрЗаменить(Слова, "й", "и"));
	КонецЕсли;
	Возврат ?(Ответ.Количество() = 0, "", СтрСоединить(Ответ, Символы.ПС));
КонецФункции
