
&НаСервереБезКонтекста
Функция СписокПередУдалениемНаСервере(Параметры)
	Попытка
		НЗ = РегистрыСведений.КвизРезультаты.СоздатьНаборЗаписей();
		НЗ.Отбор.Период.Установить(Параметры.Период);
		НЗ.Отбор.Сессия.Установить(Параметры.Сессия);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
	Исключение
		Возврат Ложь;
	КонецПопытки;
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Если СписокПередУдалениемНаСервере(Новый Структура("Период,Сессия", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.Сессия)) Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НаКлиенте.Показать(Элемент.ТекущиеДанные.Вопрос, СтандартнаяОбработка);
КонецПроцедуры
