
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
	Если Элемент.ТекущиеДанные.Свойство("Период")
	И Элемент.ТекущиеДанные.Свойство("Сессия")
	И ПодпискиНаСобытие.КвизУдалить(Новый Структура("Период,Сессия", Элемент.ТекущиеДанные.Период, Элемент.ТекущиеДанные.Сессия))
	Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Элемент.ТекущиеДанные.Свойство("Вопрос") Тогда
		НаКлиенте.Показать(Элемент.ТекущиеДанные.Вопрос, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры
