
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игроков");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Параметр) Экспорт
	Если ЭтоУРЛ(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, Параметр) Тогда
			ГиперссылкаЗаписать(УРЛ, Параметр);
			НаКлиенте.Оповещение("Команда", Параметр);
		КонецЕсли;
	ИначеЕсли НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортИгроковПоСтроке(УРЛ, Параметр) Тогда
			НаКлиенте.Оповещение("Команда", Параметр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгроковПоСтроке(Гиперссылка, Команда)
	Возврат СерверныйФункции.ИмпортИгроковПоСтроке(Гиперссылка, Команда);
КонецФункции

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Команда)
	Возврат ?(Год(ТекущаяДатаСеанса()) >= 2022, СерверныйФункции.ИмпортИгроковНаСервере(Гиперссылка, Команда), СерверныйФункции.ИмпортИгроковНаСервере2(Гиперссылка, Команда));
КонецФункции

&НаСервере
Функция УРЛ(Команда)
	УРЛ	= СерверныйФункции.КомментарийКакУРЛ(Команда.Комментарий, Истина);
	Если СтрНайти(УРЛ, "%1") > 0 Тогда
		УРЛ	= СтрЗаменить(УРЛ, "%1", СерверныйФункции.ТекущийГод(Команда));
	КонецЕсли;
	Возврат УРЛ;
КонецФункции

&НаСервере
Функция Записать(Объект)
	Возврат СерверныйФункции.ОбъектЗаписать(Объект);
КонецФункции

&НаСервере
Процедура ГиперссылкаЗаписать(Гиперссылка, Команда)
	Объект = Команда.ПолучитьОбъект();
	Если СтрНайти(Объект.Комментарий, Лев(Гиперссылка, 11)) = 0 Тогда
		Если ПустаяСтрока(Объект.Комментарий) Тогда
			Объект.Комментарий	= Гиперссылка;
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ТекущаяДатаСеанса()), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ТекущаяДатаСеанса()), "%1");
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "%1");
		Иначе
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + Гиперссылка;
		КонецЕсли;
		Записать(Объект);
	КонецЕсли;
КонецПроцедуры
