//	https://football.kulichki.net/england/2019/teams/arsenal.htm
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = "";
	//Если ВвестиСтроку(УРЛ, "Импорт игроков") И ЗначениеЗаполнено(УРЛ) Тогда
	//	Если ИмпортИгроковНаСервере(ПараметрКоманды, УРЛ) Тогда
	//		Оповестить(, ПараметрКоманды);
	//	КонецЕсли;
	//КонецЕсли;
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ИмпортИгроков", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игроков");
КонецПроцедуры

&НаКлиенте
Процедура ИмпортИгроков(УРЛ, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортИгроковНаСервере2(ПараметрКоманды, УРЛ) Тогда
			Оповестить(, ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгроковНаСервере2(Команда, Гиперссылка)
	Итого	= 0;
	Шагов	= 0;
	
	ШалостьУдалась	= Ложь;
	сИгрок			= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Амплуа,Страна,Игрок", Команда, ДатаНачалаСезона(Гиперссылка), 0, Дата(1,1,1), "");
	
	Слова = СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка, "td");
	Для Каждого Слово Из Слова Цикл
	//	Если СтрСравнить(Слово, "№") = 0 Тогда
	//		сИгрок.Амплуа	= Неопределено;
	//		ШалостьУдалась	= Истина;
	//		
	//	ИначеЕсли ШалостьУдалась Тогда
	//		Если СтрСравнить(Слово, "Вратари") = 0 Тогда
	//			сИгрок.Амплуа = СерверныйФункции.Амплуа();
	//			
	//		ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
	//			сИгрок.Амплуа = СерверныйФункции.Амплуа("Защитник");
	//			
	//		ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
	//			сИгрок.Амплуа = СерверныйФункции.Амплуа("Полузащитник");
	//			
	//		ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
	//			сИгрок.Амплуа = СерверныйФункции.Амплуа("Нападающий");
	//			
	//		КонецЕсли;
	//		ШалостьУдалась = Ложь;
	//	
	//	//ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа) Тогда
	//	//	Продолжить;
	//Иначе
		Если Макс(0, СтрокаКакЧисло(Слово)) > 0 Тогда
			сИгрок.Номер		= СтрокаКакЧисло(Слово);
			сИгрок.Наименование	= "";
		ИначеЕсли сИгрок.Номер = 0 Тогда
			Продолжить;
		//ИначеЕсли СтрНайти("тур,дата,соперник,голы", НРег(Слово)) > 0 И Шагов > 0 Тогда
		//	Прервать;
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрДлина(Слово) > 7 И Год(СтрокаКакДата(Слово)) > 2000 Тогда
				Прервать;
			ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
				Прервать;
			ИначеЕсли СтрДлина(Слово) > 3 Тогда
				сИгрок.Наименование = Слово;
			КонецЕсли;
			
		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			сИгрок.Страна = СерверныйФункции.Страна(Слово);
			
		КонецЕсли;
	
		Если НЕ ПустаяСтрока(сИгрок.Наименование)
		И Год(сИгрок.ДатаРождения) > 1
		И сИгрок.Номер > 0
		И ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны")
		Тогда
 			сИгрок.Игрок = СерверныйФункции.Игрок(сИгрок.Наименование);
			Если сИгрок.Игрок.Пустая() Тогда
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
			Иначе
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				Если ЗначениеЗаполнено(сИгрок.Амплуа) И НовыйИгрок.Амплуа <> сИгрок.Амплуа Тогда
					НовыйИгрок.Амплуа = сИгрок.Амплуа;
				КонецЕсли;
				Если НовыйИгрок.ДатаРождения <> сИгрок.ДатаРождения Тогда
					НовыйИгрок.ДатаРождения = сИгрок.ДатаРождения;
				КонецЕсли;
			КонецЕсли;
			//Если НовыйИгрок.ПометкаУдаления Тогда
			//	НовыйИгрок.УстановитьПометкуУдаления(Ложь);
			//КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				НовыйИгрок.Записать();
			КонецЕсли;
			сИгрок.Игрок = НовыйИгрок.Ссылка;
			
			НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьНаборЗаписей();
			НЗ.Отбор.Игрок.Установить(сИгрок.Игрок);
			Запись = НЗ.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, сИгрок);
			Попытка
				НЗ.Записать();
				
				Итого = Итого + 1;
			Исключение
			КонецПопытки;
			
			сИгрок.Номер		= 0;
			сИгрок.ДатаРождения	= Дата(1,1,1);
			сИгрок.Наименование	= "";
			сИгрок.Игрок		= Неопределено;
			сИгрок.Страна		= Неопределено;
			
			Шагов	= Шагов + 1;
		КонецЕсли;
	КонецЦикла;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ИмпортИгроковНаСервере(Команда, Гиперссылка)
	Итого	= 0;
	Текст	= СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
	Если НЕ ПустаяСтрока(Текст) Тогда
		Контрол = Новый ФорматированныйДокумент;
		Контрол.УстановитьHTML(Текст, Новый Структура);
		
		Начало	= Контрол.НайтиТекст("№");
		Конец	= Контрол.НайтиТекст("Соперник");
		Если Начало = Неопределено Тогда
			Возврат Ложь;
		ИначеЕсли Конец = Неопределено Тогда
			мЭлементы = Контрол.СформироватьЭлементы(Начало.ЗакладкаКонца);
		Иначе
			мЭлементы = Контрол.СформироватьЭлементы(Начало.ЗакладкаНачала, Конец.ЗакладкаНачала);
		КонецЕсли;
		
		ШалостьУдалась	= Ложь;
		сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Амплуа,Игрок", Команда, ДатаНачалаСезона(Гиперссылка), 0, Дата(1,1,1), "");
		Для Каждого тЭлемент Из мЭлементы Цикл
			Попытка
				Слово = СокрЛП(тЭлемент.Текст);
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если Слово = "№" Тогда
				ШалостьУдалась = Истина;
				
			ИначеЕсли ШалостьУдалась Тогда
				Если СтрСравнить(Слово, "Вратари") = 0 Тогда
					сИгрок.Амплуа = СерверныйФункции.Амплуа();
					
				ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
					сИгрок.Амплуа = СерверныйФункции.Амплуа("Защитник");
					
				ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
					сИгрок.Амплуа = СерверныйФункции.Амплуа("Полузащитник");
					
				ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
					сИгрок.Амплуа = СерверныйФункции.Амплуа("Нападающий");
					
				КонецЕсли;
				ШалостьУдалась = Ложь;
			
			ИначеЕсли сИгрок.Номер = 0 Тогда
				сИгрок.Номер = СтрокаКакЧисло(Слово);
				
			ИначеЕсли сИгрок.Номер > 0
			И ПустаяСтрока(сИгрок.Наименование)
			Тогда
				Если СтрДлина(Слово) > 3 Тогда
					сИгрок.Наименование = Слово;
				Иначе
					сИгрок.Номер = 0;
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли НЕ ПустаяСтрока(сИгрок.Наименование)
			И Год(сИгрок.ДатаРождения) < 2
			Тогда
				Попытка
					сИгрок.ДатаРождения = Дата(Сред(Слово, 7) + Сред(Слово, 4, 2) + Лев(Слово, 2));
				Исключение
					Продолжить;
				КонецПопытки;
				
				Если Год(сИгрок.ДатаРождения) > 1 Тогда
					сИгрок.Игрок = СерверныйФункции.Игрок(сИгрок.Наименование);
					Если сИгрок.Игрок.Пустая() Тогда
						НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
						ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
						
					Иначе
						НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
						Если ЗначениеЗаполнено(сИгрок.Амплуа) И НовыйИгрок.Амплуа <> сИгрок.Амплуа Тогда
							НовыйИгрок.Амплуа = сИгрок.Амплуа;
						КонецЕсли;
						Если НовыйИгрок.ДатаРождения <> сИгрок.ДатаРождения Тогда
							НовыйИгрок.ДатаРождения = сИгрок.ДатаРождения;
						КонецЕсли;
					КонецЕсли;
					//Если НовыйИгрок.ПометкаУдаления Тогда
					//	НовыйИгрок.УстановитьПометкуУдаления(Ложь);
					//КонецЕсли;
					Если НовыйИгрок.Модифицированность() Тогда
						НовыйИгрок.Записать();
					КонецЕсли;
					сИгрок.Игрок = НовыйИгрок.Ссылка;
					
					НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьНаборЗаписей();
					НЗ.Отбор.Игрок.Установить(сИгрок.Игрок);
					НЗ.Прочитать();
					Если НЗ.Количество() = 0 Тогда
						Запись = НЗ.Добавить();
						ЗаполнитьЗначенияСвойств(Запись, сИгрок);
					Иначе
						Для Каждого Запись Из НЗ Цикл
							Если Запись.Команда <> сИгрок.Команда Тогда
								Запись.Команда = сИгрок.Команда;
							КонецЕсли;
							Если ЗначениеЗаполнено(сИгрок.Амплуа) И Запись.Амплуа <> сИгрок.Амплуа Тогда
								Запись.Амплуа = сИгрок.Амплуа;
							КонецЕсли;
							Если Запись.Номер <> сИгрок.Номер Тогда
								Запись.Номер = сИгрок.Номер;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если НЗ.Модифицированность() Тогда
						Попытка
							НЗ.Записать();
							
							Итого = Итого + 1;
						Исключение
						КонецПопытки;
					КонецЕсли;
					
					сИгрок.Номер		= 0;
					сИгрок.ДатаРождения	= Дата(1,1,1);
					сИгрок.Наименование	= "";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ДатаНачалаСезона(Гиперссылка="")
	Слова	= СтрРазделить(Гиперссылка, "/");
	Год		= ?(Месяц(ТекущаяДатаСеанса())<8, Год(ТекущаяДатаСеанса()) - 1, Год(ТекущаяДатаСеанса()));
	Для Каждого Слово Из Слова Цикл
		Если СтрокаКакЧисло(Слово) > 2000 Тогда
			Год = СтрокаКакЧисло(Слово) - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Дата(Год, 8, 1);
КонецФункции

&НаСервере
Функция СтрокаКакДата(Знач Слово)
	Ответ = Дата(1,1,1);
	Попытка
		Если СтрДлина(Ответ) = 10 Тогда
			Ответ = Дата(Сред(Слово, 7, 4) + Сред(Слово, 4, 2) + Лев(Слово, 2));
		Иначе
			Слова = СтрРазделить(Слово, ".", Ложь);
			Если Слова.Количество() = 3 Тогда
				Ответ = Дата(Слова.Получить(2) + Прав("0" + Слова.Получить(1), 2) + Прав("0" + Слова.Получить(0), 2));
			КонецЕсли;
		КонецЕсли;
	Исключение КонецПопытки;
	Возврат Ответ;
КонецФункции
