//	https://football.kulichki.net/england/2019/teams/arsenal.htm
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = "";
	Если ВвестиСтроку(УРЛ, "Импорт игроков") И ЗначениеЗаполнено(УРЛ) Тогда
		Если ИмпортИгроков(ПараметрКоманды, УРЛ) Тогда
			Оповестить(, ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгроков(Команда, Гиперссылка)
	Итого	= 0;
	Текст	= СерверныйФункции.СкачатьПоСсылке(Гиперссылка);
	Если НЕ ПустаяСтрока(Текст) Тогда
		Контрол = Новый ФорматированныйДокумент;
		Контрол.УстановитьHTML(Текст, Новый Структура);
		
		Начало	= Контрол.НайтиТекст("№");
		Конец	= Контрол.НайтиТекст("Соперник");
		Если Начало = Неопределено Тогда
			Возврат Ложь;
		ИначеЕсли Конец = Неопределено Тогда
			мЭлементы = Контрол.СформироватьЭлементы(Начало.ЗакладкаКонца);
		Иначе
			мЭлементы = Контрол.СформироватьЭлементы(Начало.ЗакладкаНачала, Конец.ЗакладкаНачала);
		КонецЕсли;
		
		ШалостьУдалась	= Ложь;
		сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Амплуа,Игрок", Команда, Дата(2018, 8, 1), 0, Дата(1,1,1), "");
		Для Каждого тЭлемент Из мЭлементы Цикл
			Попытка
				Слово = СокрЛП(тЭлемент.Текст);
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если Слово = "№" Тогда
				ШалостьУдалась = Истина;
				
			ИначеЕсли ШалостьУдалась Тогда
				Если СтрСравнить(Слово, "Вратари") = 0 Тогда
					сИгрок.Амплуа = Амплуа();
					
				ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
					сИгрок.Амплуа = Амплуа("Защитник");
					
				ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
					сИгрок.Амплуа = Амплуа("Полузащитник");
					
				ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
					сИгрок.Амплуа = Амплуа("Нападающий");
					
				КонецЕсли;
				ШалостьУдалась = Ложь;
			
			ИначеЕсли сИгрок.Номер = 0 Тогда
				сИгрок.Номер = СтрокаКакЧисло(Слово);
				
			ИначеЕсли сИгрок.Номер > 0
			И ПустаяСтрока(сИгрок.Наименование)
			Тогда
				Если СтрДлина(Слово) > 5 Тогда
					сИгрок.Наименование = Слово;
				Иначе
					сИгрок.Номер = 0;
					Продолжить;
				КонецЕсли;
				
			ИначеЕсли НЕ ПустаяСтрока(сИгрок.Наименование)
			И Год(сИгрок.ДатаРождения) < 2
			Тогда
				Попытка
					сИгрок.ДатаРождения = Дата(Сред(Слово, 7) + Сред(Слово, 4, 2) + Лев(Слово, 2));
				Исключение
					Продолжить;
				КонецПопытки;
				
				Если Год(сИгрок.ДатаРождения) > 1 Тогда
					сИгрок.Игрок = Справочники.Игроки.НайтиПоНаименованию(сИгрок.Наименование);
					Если сИгрок.Игрок.Пустая() Тогда
						НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
						ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
						НовыйИгрок.Записать();
						
						сИгрок.Игрок = НовыйИгрок.Ссылка;
					Иначе
						НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
						Если НовыйИгрок.Амплуа <> сИгрок.Амплуа Тогда
							НовыйИгрок.Амплуа = сИгрок.Амплуа;
						КонецЕсли;
						Если НовыйИгрок.ДатаРождения <> сИгрок.ДатаРождения Тогда
							НовыйИгрок.ДатаРождения = сИгрок.ДатаРождения;
						КонецЕсли;
						Если НовыйИгрок.Модифицированность() Тогда
							НовыйИгрок.Записать();
						КонецЕсли;
					КонецЕсли;
					
					НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьНаборЗаписей();
					НЗ.Отбор.Игрок.Установить(сИгрок.Игрок);
					НЗ.Прочитать();
					Если НЗ.Количество() = 0 Тогда
						Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
						ЗаполнитьЗначенияСвойств(Запись, сИгрок);
					Иначе
						Для Каждого Запись Из НЗ Цикл
							Если Запись.Команда <> сИгрок.Команда Тогда
								Запись.Команда = сИгрок.Команда;
							КонецЕсли;
							Если Запись.Амплуа <> сИгрок.Амплуа Тогда
								Запись.Амплуа = сИгрок.Амплуа;
							КонецЕсли;
							Если Запись.Номер <> сИгрок.Номер Тогда
								Запись.Номер = сИгрок.Номер;
							КонецЕсли;
						КонецЦикла;
					КонецЕсли;
					Если НЗ.Модифицированность() Тогда
						Попытка
							Запись.Записать(Ложь);
							
							Итого = Итого + 1;
						Исключение
						КонецПопытки;
					КонецЕсли;
					
					сИгрок.Номер		= 0;
					сИгрок.ДатаРождения	= Дата(1,1,1);
					сИгрок.Наименование	= "";
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

Функция Амплуа(Наименование="Вратарь")
	Возврат СерверныйФункции.Амплуа(Наименование);
КонецФункции
