
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игроков");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Параметр) Экспорт
	Если ЭтоУРЛ(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, Параметр) Тогда
			ГиперссылкаЗаписать(УРЛ, Параметр);
			Оповестить("Команда", Параметр);
		КонецЕсли;
	ИначеЕсли НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортИгроковПоСтроке(УРЛ, Параметр) Тогда
			Оповестить("Команда", Параметр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

//	https://www.cham pionat. com/football/_england/tournament/6584/teams/268388/players/
&НаСервере
Функция ИмпортИгроковПоСтроке(Гиперссылка, Команда)
	Возврат СерверныйФункции.ИмпортИгроковПоСтроке(Гиперссылка, Команда);
КонецФункции

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Команда)
	Возврат ?(Год(ТекущаяДатаСеанса()) >= 2022, СерверныйФункции.ИмпортИгроковНаСервере(Гиперссылка, Команда), СерверныйФункции.ИмпортИгроковНаСервере2(Гиперссылка, Команда));
КонецФункции

&НаСервере
Функция УРЛ(Команда)
	УРЛ	= СерверныйФункции.КомментарийКакУРЛ(Команда.Комментарий);
	Если СтрокаСодержитЧисло(УРЛ) Тогда
		Чемпионат	= СерверныйФункции.ЧемпионатЛигиПоследний(Команда);
		Если СтрНайти(УРЛ, "%1") = 0 Тогда
			//Слова	= Разделить(УРЛ, "/");
		Иначе
			Если ЗначениеЗаполнено(Чемпионат.ДатаОкончания) Тогда
				УРЛ	= СтрШаблон(УРЛ, ФорматЧГ(Чемпионат.ДатаОкончания));
			Иначе
				УРЛ	= СтрШаблон(УРЛ, ФорматЧГ(ТекущаяДатаСеанса()));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат УРЛ;
КонецФункции

&НаСервере
Функция Записать(Объект)
	Возврат СерверныйФункции.ОбъектЗаписать(Объект);
КонецФункции

&НаСервере
Процедура ГиперссылкаЗаписать(Гиперссылка, Команда)
	Объект = Команда.ПолучитьОбъект();
	Если СтрНайти(Объект.Комментарий, Лев(Гиперссылка, 11)) = 0 Тогда
		Если ПустаяСтрока(Объект.Комментарий) Тогда
			Объект.Комментарий	= Гиперссылка;
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ТекущаяДатаСеанса()), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ТекущаяДатаСеанса()), "%1");
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "%1");
		Иначе
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + Гиперссылка;
		КонецЕсли;
		Записать(Объект);
	КонецЕсли;
КонецПроцедуры
