
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игроков");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ?(Истина, ИмпортИгроковНаСервере(УРЛ, ПараметрКоманды), ИмпортИгроковНаСервере2(УРЛ, ПараметрКоманды)) Тогда
			ГиперссылкаЗаписать(УРЛ, ПараметрКоманды);
			Оповестить("Команда", ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортИгроковНаСервере2(Гиперссылка, Команда)
	Итого	= 0;
	Шагов	= 0;
	
	сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Страна,Игрок", Команда, ДатаНачалаСезона(Гиперссылка, Команда), 0, Дата(1,1,1), "");
	//Амплуа
	
	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Шагов	= Шагов + 1;
		Если Шагов > 321 Тогда
			Прервать;
		ИначеЕсли Шагов = 1 Тогда
			Если СтрСравнить(Слово, Команда.Наименование) <> 0 Тогда	// возможно ошибка урл
				Прервать;
			КонецЕсли;
		ИначеЕсли СтрСравнить(Слово, "-") = 0 Тогда
			сИгрок.Номер = 0;
		//ИначеЕсли Макс(0, СтрокаКакЧисло(Слово)) > 0 Тогда
		//	сИгрок.Номер		= СтрокаКакЧисло(Слово);
		//	сИгрок.Наименование	= "";
		ИначеЕсли сИгрок.Номер = 0 Тогда
			сИгрок.Номер		= СтрокаКакЧисло(Слово);
			сИгрок.Наименование	= "";
		//ИначеЕсли СтрНайти("тур,дата,соперник,голы", НРег(Слово)) > 0 И Шагов > 0 Тогда
		//	Прервать;
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрДлина(Слово) > 7 И Год(СтрокаКакДата(Слово)) > 2000 Тогда
				Прервать;
			ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
				Прервать;
			ИначеЕсли СтрДлина(Слово) > 3 Тогда
				сИгрок.Наименование = Слово;
			КонецЕсли;
			
		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			сИгрок.Страна = СерверныйФункции.СтранаНайти(Слово);
			
	//	КонецЕсли;
	//
	//	Если НЕ ПустаяСтрока(сИгрок.Наименование)
	//	И Год(сИгрок.ДатаРождения) > 1
	//	И сИгрок.Номер > 0
	//	И ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны")
	//	Тогда
		ИначеЕсли ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны") Тогда
 			сИгрок.Игрок = ИгрокНайти(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.ДатаРождения, сИгрок.ДатаРождения);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если Записать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Последнее = РегистрыСведений.ПеремещенияИгроков.ПолучитьПоследнее(сИгрок.Период, Новый Структура("Игрок", сИгрок.Игрок));
			Если Последнее.Команда <> Команда
			//Или Последнее.Номер <> сИгрок.Номер
			Тогда
				НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НЗ, сИгрок);
				Если Записать(НЗ) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			сИгрок.Номер		= 0;
			сИгрок.ДатаРождения	= Дата(1,1,1);
			сИгрок.Наименование	= "";
			сИгрок.Игрок		= Неопределено;
			сИгрок.Страна		= Неопределено;
		КонецЕсли;
	КонецЦикла;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ИгрокиКоманды(Команда, Дата)
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок,
	      	               |	ПеремещенияИгроков.Команда КАК Команда,
	      	               |	ПеремещенияИгроков.Амплуа КАК Амплуа,
	      	               |	ПеремещенияИгроков.Номер КАК Номер
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроков
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда");
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("Команда",			Команда);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ИмпортИгроковНаСервере(Гиперссылка, Команда)
	ДатаНачала	= ДатаНачалаСезона(Гиперссылка, Команда);
	
	Итого		= 0;
	ВсеПлохо	= НРег(Команда.Наименование);
	Старье		= ИгрокиКоманды(Команда, ДатаНачала + Сутки());
	Новое		= Новый Соответствие;
	Исключения	= Разделить("-,м,г,ж,к,гражданство,год рожд.", ",");

	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка, "font");
	сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Амплуа,Страна,Игрок", Команда, ДатаНачала, 0, Дата(1,1,1), "");
	Для Каждого Слово Из Слова Цикл
		Если СтрСравнить(Слово, "Соперник") = 0 Тогда
			Прервать;
		ИначеЕсли СтрСравнить(Слово, "Игроки") = 0 Тогда
			сИгрок.Команда	= Неопределено;
			сИгрок.Период	= КонецГода(ДатаНачала);
			сИгрок.Амплуа	= Справочники.Амплуа.ПустаяСсылка();
			
		ИначеЕсли Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
			сИгрок.Номер = 0;
			
		ИначеЕсли НЕ ПустаяСтрока(ВсеПлохо) Тогда
			Если СтрНайти2(Слово, ВсеПлохо) > 0 Тогда
				ВсеПлохо = "";
			ИначеЕсли СтрНайти2(Команда.Комментарий, НРег(Слово)) > 0 Тогда
				ВсеПлохо = "";
			КонецЕсли;
		ИначеЕсли СтрЧислоСтрок(Слово) > 1 Тогда
			сИгрок.Номер = 0;
		ИначеЕсли СтрСравнить(Слово, "Вратари") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Вратарь");
		ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Защитник");
		ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Полузащитник");
		ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Нападающий");
		ИначеЕсли сИгрок.Амплуа = Неопределено Тогда
		
		ИначеЕсли сИгрок.Номер = 0 И ЗначениеЗаполнено(сИгрок.Команда) Тогда
			сИгрок.Номер = ?(СтрСравнить(Слово, "n") = 0, -1, Макс(0, СтрокаКакЧисло(Слово)));
			сИгрок.Наименование	= "";
			
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрокаСодержитЧисло(Слово) Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрНайти(Слово, ".") > 0 Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрДлина(Слово) > 3 Тогда
				сИгрок.Наименование = Слово;
			Иначе
				сИгрок.Номер = 0;
			КонецЕсли;

		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			сИгрок.Страна = СерверныйФункции.СтранаНайти(Слово);
			//
			сИгрок.Игрок = ИгрокНайти(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.ДатаРождения, сИгрок.ДатаРождения);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если Записать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Новое.Вставить(сИгрок.Игрок, Макс(0, сИгрок.Номер));
			
			Если ?(ЗначениеЗаполнено(сИгрок.Команда), сИгрок.Команда <> СерверныйФункции.КомандаИгрока(сИгрок.Игрок, сИгрок.Период), Команда = СерверныйФункции.КомандаИгрока(сИгрок.Игрок)) Тогда
				Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, сИгрок);
				Если Записать(Запись) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
				
			сИгрок.Номер		= 0;
			сИгрок.ДатаРождения	= Дата(1,1,1);
			сИгрок.Наименование	= "";
			сИгрок.Игрок		= Неопределено;
			сИгрок.Страна		= Неопределено;
		КонецЕсли;
	КонецЦикла;
	//Если Итого > 0 И ПустаяСтрока(Команда.Комментарий) Тогда
	//	оКоманда = Команда.ПолучитьОбъект();
	//	оКоманда.Комментарий = Гиперссылка;
	//	Попытка
	//		оКоманда.Записать();
	//	Исключение КонецПопытки;
	//КонецЕсли;
	Для Каждого ТекСтрока Из Старье Цикл
		Номер	= Новое.Получить(ТекСтрока.Игрок);
		Если Номер = Неопределено Тогда		//	уволить
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок", ДатаНачала, ТекСтрока.Игрок));
		ИначеЕсли Номер <> ТекСтрока.Номер Тогда
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок,Команда,Амплуа,Номер", ДатаНачала, ТекСтрока.Игрок, ТекСтрока.Команда, ТекСтрока.Амплуа, Номер));
		Иначе
			Продолжить;
		КонецЕсли;
		Записать(Запись);
		
		Итого = Итого + 0.01;
	КонецЦикла;

	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ДатаНачалаСезона(Гиперссылка, Команда)
	мСлова = Разделить(Гиперссылка, "/");
	Для Каждого Слово Из мСлова Цикл
		Год	= СтрокаКакЧисло(Слово);
		Если Год >= 2010 И Год <= 1 + Год(ТекущаяДатаСеанса()) Тогда
			Возврат Дата(Год - 1, 8, 1);
		КонецЕсли;
	КонецЦикла;
	
	Чемпионат	= СерверныйФункции.ЧемпионатЛигиПоследний(Команда);
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат НачалоМесяца(Чемпионат.ДатаНачала);
	КонецЕсли;
	
	Ответ = Дата(Год(ТекущаяДатаСеанса()), 8, 1);
	Если Ответ < ТекущаяДатаСеанса() Тогда
		Ответ = Дата(Год(ТекущаяДатаСеанса()) - 1, 8, 1);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ФорматГод(ЧислоИлиДата)
	Возврат "/" + ФорматЧГ(ЧислоИлиДата) + "/";
КонецФункции

&НаСервере
Функция УРЛ(Команда)
	УРЛ	= СерверныйФункции.КомментарийКакУРЛ(Команда.Комментарий);
	Если СтрокаСодержитЧисло(УРЛ) Тогда
		Чемпионат	= СерверныйФункции.ЧемпионатЛигиПоследний(Команда);
		Если ЗначениеЗаполнено(Чемпионат.ДатаОкончания) Тогда
			ТекГод	= ФорматГод(Чемпионат.ДатаОкончания);
			Если СтрНайти(УРЛ, ТекГод) = 0 Тогда
				Для Год = 2010 По 1 + Год(Чемпионат.ДатаОкончания) Цикл
					Если СтрНайти(УРЛ, ФорматГод(Год)) > 0 Тогда
						УРЛ	= СтрЗаменить(УРЛ, ФорматГод(Год), ТекГод);
						Прервать;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат УРЛ;
КонецФункции

&НаСервере
Функция ИгрокНайти(Наименование, ДатаРождения)
	Игрок	= СерверныйФункции.ИгрокНайти(Наименование, ДатаРождения);
	Возврат Игрок.Игрок;
КонецФункции

&НаСервере
Функция Записать(Объект)
	Ответ	= Ложь;
	Если Объект.ПроверитьЗаполнение() Тогда
		Попытка
			Объект.Записать();
			Ответ	= Истина;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ГиперссылкаЗаписать(Гиперссылка, Команда)
	Объект = Команда.ПолучитьОбъект();
	Если СтрНайти(Объект.Комментарий, Гиперссылка) = 0 Тогда
		Если ПустаяСтрока(Объект.Комментарий) Тогда
			Объект.Комментарий	= Гиперссылка;
		Иначе
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + Гиперссылка;
		КонецЕсли;
		Записать(Объект);
	КонецЕсли;
КонецПроцедуры
