
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт игроков");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, Параметр) Экспорт
	Если ЭтоУРЛ(УРЛ) Тогда
		Если ИмпортНаСервере(УРЛ, Параметр) Тогда
			ГиперссылкаЗаписать(УРЛ, Параметр);
			Оповестить("Команда", Параметр);
		КонецЕсли;
	ИначеЕсли НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортИгроковПоСтроке(УРЛ, Параметр) Тогда
			Оповестить("Команда", Параметр);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура Зачистить(Виктим, АмплуаУдалить=Ложь)
	ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Номер,ДатаРождения,Наименование,Страна,Игрок", 0, Дата(1,1,1), ""));
	Если АмплуаУдалить Тогда
		ЗаполнитьЗначенияСвойств(Виктим, Новый Структура("Амплуа"));
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаполнитель(Команда, Дата)
	Возврат Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Амплуа,Страна,Игрок", Команда, Дата, 0, Дата(1,1,1), "");
КонецФункции

&НаСервере
Процедура ИмпортСтроки(сИгрок, Слово, Параметры)
	Если ПустаяСтрока(Слово) Тогда
		//
	ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
		Если сИгрок.Номер = 0 Тогда
			сИгрок.Номер = СтрокаКакЧисло(Слово);
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.ДатаРождения) Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
		КонецЕсли;
	ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа)
	И Параметры.Амплуа.Найти(НРег(Слово)) <> Неопределено
	Тогда
		сИгрок.Амплуа = СерверныйФункции.Амплуа(Слово);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция НовоеСтарье(Новое, Старье, Параметры)
	Итого = 0;
	Для Каждого ТекСтрока Из Старье Цикл
		Номер	= Новое.Получить(ТекСтрока.Игрок);
		Если Номер = Неопределено Или ДобавитьМесяц(Параметры.ДатаНачала, 11) < ТекущаяДатаСеанса() Тогда		//	уволить
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок", Параметры.ДатаНачала, ТекСтрока.Игрок));
		ИначеЕсли Номер <> ТекСтрока.Номер Тогда
			Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(Запись, Новый Структура("Период,Игрок,Команда,Амплуа,Номер", Параметры.ДатаНачала, ТекСтрока.Игрок, ТекСтрока.Команда, ТекСтрока.Амплуа, Номер));
		Иначе
			Продолжить;
		КонецЕсли;
		Записать(Запись);
		
		Итого = Итого + 0.01;
	КонецЦикла;
	Возврат Итого;
КонецФункции

&НаСервере
Функция СтранаНайти(Слово, Глубоко=Ложь)
	Страна = СерверныйФункции.СтранаНайти(Слово);
	Если СтрДлина(Слово) > 10 И Глубоко Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Страны.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Страны КАК Страны
		                      |ГДЕ
		                      |	&Наименование ПОДОБНО ""%"" + Страны.Наименование + ""%""
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	&Наименование ПОДОБНО Страны.Наименование + ""%"" УБЫВ");
		Запрос.УстановитьПараметр("Наименование",			СокрЛП(Слово));
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	Возврат Страна;
КонецФункции

//	https://www.cham pionat. com/football/_england/tournament/6584/teams/268388/players/
&НаСервере
Функция ИмпортИгроковПоСтроке(Гиперссылка, Команда)
	Итого		= 0;
	
	Параметры	= Новый Структура("ДатаНачала", ДатаНачалаСезона("", Команда));
	Параметры.Вставить("Амплуа",		Разделить("вратарь защитник полузащитник нападающий"));
	Параметры.Вставить("Исключения",	Разделить("№ игрок амплуа др рост вес"));
	Старье		= ИгрокиКоманды(Команда, Параметры.ДатаНачала + Сутки());
	Новое		= Новый Соответствие;
	сИгрок		= ИмпортНаполнитель(Команда, Параметры.ДатаНачала);
	Для Каждого Слово Из Разделить(Гиперссылка, "¶") Цикл
		Если ПустаяСтрока(Слово) Тогда
			//
		ИначеЕсли СтрНайти(Слово, Символ(9)) > 0 Тогда
			Для Каждого ПодСтрока Из Разделить(Слово, Символ(9)) Цикл
				Если Параметры.Исключения.Найти(НРег(ПодСтрока)) = Неопределено Тогда
					ИмпортСтроки(сИгрок, ПодСтрока, Параметры);
				КонецЕсли;
			КонецЦикла;
		ИначеЕсли Параметры.Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
			//
		ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
			Если сИгрок.Номер = 0 Тогда
				сИгрок.Номер = СтрокаКакЧисло(Слово);
			ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.ДатаРождения) Тогда
				сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа)
		И Параметры.Амплуа.Найти(НРег(Слово)) <> Неопределено
		Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа(Слово);
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда					// может это страна
				сИгрок.Страна = СтранаНайти(Слово, Истина);
				Если ЗначениеЗаполнено(сИгрок.Страна) Тогда
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			Если СтрНайти(Слово, " ") > 0 Тогда
				сИгрок.Наименование = Слово;
			КонецЕсли;
		КонецЕсли;
		
		Если НЕ ПустаяСтрока(сИгрок.Наименование)
		И ЗначениеЗаполнено(сИгрок.ДатаРождения)
		И ЗначениеЗаполнено(сИгрок.Амплуа)
		И сИгрок.Номер <> 0
		Тогда
			сИгрок.Игрок = ИгрокНайти(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.ДатаРождения, сИгрок.ДатаРождения);
				Если ЗначениеЗаполнено(сИгрок.Страна) Тогда
					ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
				КонецЕсли;
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если Записать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Новое.Вставить(сИгрок.Игрок, Макс(0, сИгрок.Номер));
			
			Если сИгрок.Команда <> СерверныйФункции.КомандаИгрока(сИгрок.Игрок, сИгрок.Период) Тогда
				Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, сИгрок);
				Если Записать(Запись) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить(сИгрок, Истина);
		КонецЕсли;
	КонецЦикла;
	
	Итого = Итого + НовоеСтарье(Новое, Старье, Параметры);
	
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Команда)
	Возврат ?(Год(ТекущаяДатаСеанса()) >= 2022, ИмпортИгроковНаСервере(Гиперссылка, Команда), ИмпортИгроковНаСервере2(Гиперссылка, Команда));
КонецФункции

&НаСервере
Функция ИмпортИгроковНаСервере2(Гиперссылка, Команда)
	Итого	= 0;
	Шагов	= 0;
	
	сИгрок	= Новый Структура("Команда,Период,Номер,ДатаРождения,Наименование,Страна,Игрок", Команда, ДатаНачалаСезона(Гиперссылка, Команда), 0, Дата(1,1,1), "");
	//Амплуа
	
	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Шагов	= Шагов + 1;
		Если Шагов > 321 Тогда
			Прервать;
		ИначеЕсли Шагов = 1 Тогда
			Если СтрСравнить(Слово, Команда.Наименование) <> 0 Тогда	// возможно ошибка урл
				Прервать;
			КонецЕсли;
		ИначеЕсли СтрСравнить(Слово, "-") = 0 Тогда
			сИгрок.Номер = 0;
		//ИначеЕсли Макс(0, СтрокаКакЧисло(Слово)) > 0 Тогда
		//	сИгрок.Номер		= СтрокаКакЧисло(Слово);
		//	сИгрок.Наименование	= "";
		ИначеЕсли сИгрок.Номер = 0 Тогда
			сИгрок.Номер		= СтрокаКакЧисло(Слово);
			сИгрок.Наименование	= "";
		//ИначеЕсли СтрНайти("тур,дата,соперник,голы", НРег(Слово)) > 0 И Шагов > 0 Тогда
		//	Прервать;
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрДлина(Слово) > 7 И Год(СтрокаКакДата(Слово)) > 2000 Тогда
				Прервать;
			ИначеЕсли СтрокаСодержитЧисло(Слово) Тогда
				Прервать;
			ИначеЕсли СтрДлина(Слово) >= 3 Тогда
				сИгрок.Наименование = Слово;
			КонецЕсли;
			
		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			сИгрок.Страна = СтранаНайти(Слово);
			
	//	КонецЕсли;
	//
	//	Если НЕ ПустаяСтрока(сИгрок.Наименование)
	//	И Год(сИгрок.ДатаРождения) > 1
	//	И сИгрок.Номер > 0
	//	И ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны")
	//	Тогда
		ИначеЕсли ТипЗнч(сИгрок.Страна) = Тип("СправочникСсылка.Страны") Тогда
 			сИгрок.Игрок = ИгрокНайти(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.ДатаРождения, сИгрок.ДатаРождения);
				//ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если Записать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			
			Последнее = РегистрыСведений.ПеремещенияИгроков.ПолучитьПоследнее(сИгрок.Период, Новый Структура("Игрок", сИгрок.Игрок));
			Если Последнее.Команда <> Команда
			//Или Последнее.Номер <> сИгрок.Номер
			Тогда
				НЗ = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(НЗ, сИгрок);
				Если Записать(НЗ) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить(сИгрок);
		КонецЕсли;
	КонецЦикла;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ИгрокиКоманды(Команда, Дата)
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок,
	      	               |	ПеремещенияИгроков.Команда КАК Команда,
	      	               |	ПеремещенияИгроков.Амплуа КАК Амплуа,
	      	               |	ПеремещенияИгроков.Номер КАК Номер
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроков
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда");
	Запрос.УстановитьПараметр("Дата",				Дата);
	Запрос.УстановитьПараметр("Команда",			Команда);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаСервере
Функция ИмпортИгроковНаСервере(Гиперссылка, Команда)
	Итого		= 0;
	
	Параметры	= Новый Структура("ДатаНачала", ДатаНачалаСезона(Гиперссылка, Команда));
	Параметры.Вставить("Исключения",	Разделить("-,№,м,г,ж,к,гражданство,год рожд.,игры,голы", ","));
	ВсеПлохо	= НРег(Команда.Наименование);
	Старье		= ИгрокиКоманды(Команда, Параметры.ДатаНачала + Сутки());
	Новое		= Новый Соответствие;

	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка, "font");
	сИгрок	= ИмпортНаполнитель(Команда, Параметры.ДатаНачала);
	Для Каждого Слово Из Слова Цикл
		Если СтрСравнить(Слово, "Соперник") = 0 Тогда
			Прервать;
		ИначеЕсли СтрСравнить(Слово, "Игроки") = 0 Тогда
			сИгрок.Команда	= Неопределено;
			сИгрок.Период	= КонецГода(Параметры.ДатаНачала);
			сИгрок.Амплуа	= Справочники.Амплуа.ПустаяСсылка();
			
		ИначеЕсли СтрЧислоСтрок(Слово) > 1 Тогда
			//
		ИначеЕсли Параметры.Исключения.Найти(НРег(Слово)) <> Неопределено Тогда
			Если ПустаяСтрока(сИгрок.Наименование) Тогда
				сИгрок.Номер = 0;
			КонецЕсли;
			
		ИначеЕсли НЕ ПустаяСтрока(ВсеПлохо) Тогда
			Если СтрНайти2(Слово, ВсеПлохо) > 0 Тогда
				ВсеПлохо = "";
			ИначеЕсли СтрНайти2(Команда.Комментарий, НРег(Слово)) > 0 Тогда
				ВсеПлохо = "";
			КонецЕсли;
		ИначеЕсли СтрЧислоСтрок(Слово) > 1 Тогда
			сИгрок.Номер = 0;
		ИначеЕсли СтрСравнить(Слово, "Вратари") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Вратарь");
		ИначеЕсли СтрСравнить(Слово, "Защитники") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Защитник");
		ИначеЕсли СтрСравнить(Слово, "Полузащитники") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Полузащитник");
		ИначеЕсли СтрСравнить(Слово, "Нападающие") = 0 Тогда
			сИгрок.Амплуа = СерверныйФункции.Амплуа("Нападающий");
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Амплуа) Тогда
			//
		ИначеЕсли сИгрок.Номер = 0 И ЗначениеЗаполнено(сИгрок.Команда) Тогда
			сИгрок.Номер = ?(СтрСравнить(Слово, "n") = 0, -1, Макс(0, СтрокаКакЧисло(Слово)));
			сИгрок.Наименование	= "";
			
		ИначеЕсли ПустаяСтрока(сИгрок.Наименование) Тогда
			Если СтрокаСодержитЧисло(Слово) Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрНайти(Слово, ".") > 0 Тогда
				сИгрок.Номер = 0;
			ИначеЕсли СтрДлина(Слово) >= 3 Тогда
				сИгрок.Наименование = СтрЗаменить(Слово, "  ", " ");
			Иначе
				сИгрок.Номер = 0;
			КонецЕсли;

		ИначеЕсли Год(сИгрок.ДатаРождения) < 2 Тогда
			сИгрок.ДатаРождения = СтрокаКакДата(Слово);
			
		ИначеЕсли НЕ ЗначениеЗаполнено(сИгрок.Страна) Тогда
			Если СтрокаКакЧисло(Слово) <> 0 Тогда Продолжить; КонецЕсли;
			
			сИгрок.Страна = СтранаНайти(Слово);
			//
			сИгрок.Игрок = ИгрокНайти(сИгрок.Наименование, сИгрок.ДатаРождения);
			Если ЗначениеЗаполнено(сИгрок.Игрок) Тогда
				НовыйИгрок = сИгрок.Игрок.ПолучитьОбъект();
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Амплуа, сИгрок.Амплуа);
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.ДатаРождения, сИгрок.ДатаРождения);
				ОбщегоНазначения.УстановитьЗначение(НовыйИгрок.Страна, сИгрок.Страна);
			Иначе
				НовыйИгрок = Справочники.Игроки.СоздатьЭлемент();
				ЗаполнитьЗначенияСвойств(НовыйИгрок, сИгрок);
				НовыйИгрок.УстановитьНовыйКод();
			КонецЕсли;
			Если НовыйИгрок.Модифицированность() Тогда
				Если Записать(НовыйИгрок) Тогда
					сИгрок.Игрок = НовыйИгрок.Ссылка;
				Иначе
					Прервать;
				КонецЕсли;
			КонецЕсли;
			Новое.Вставить(сИгрок.Игрок, Макс(0, сИгрок.Номер));
			
			Если ?(ЗначениеЗаполнено(сИгрок.Команда), сИгрок.Команда <> СерверныйФункции.КомандаИгрока(сИгрок.Игрок, сИгрок.Период), Команда = СерверныйФункции.КомандаИгрока(сИгрок.Игрок)) Тогда
				Запись = РегистрыСведений.ПеремещенияИгроков.СоздатьМенеджерЗаписи();
				ЗаполнитьЗначенияСвойств(Запись, сИгрок);
				Если Записать(Запись) Тогда
					Итого = Итого + 1;
				КонецЕсли;
			КонецЕсли;
			
			Зачистить(сИгрок);
		КонецЕсли;
	КонецЦикла;
	Если Итого > 0 Тогда
		Итого = Итого + НовоеСтарье(Новое, Старье, Параметры);
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Функция ДатаНачалаСезона(Гиперссылка, Команда)
	Если НЕ ПустаяСтрока(Гиперссылка) Тогда
		Слова = Разделить(Гиперссылка, "/");
		Для Каждого Слово Из Слова Цикл
			Год	= СтрокаКакЧисло(Слово);
			Если Год >= 2007 И Год <= 1 + Год(ТекущаяДатаСеанса()) Тогда
				Запрос = Новый Запрос("ВЫБРАТЬ
				                      |	НАЧАЛОПЕРИОДА(ЧемпионатыКоманды.Ссылка.ДатаНачала, МЕСЯЦ) КАК ДатаНачала
				                      |ИЗ
				                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
				                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Страны КАК Страны
				                      |		ПО ЧемпионатыКоманды.Ссылка.Владелец.Страна = Страны.Ссылка
				                      |ГДЕ
				                      |	ЧемпионатыКоманды.Команда = &Команда
				                      |	И ГОД(ЧемпионатыКоманды.Ссылка.ДатаОкончания) = &Год
				                      |	И ЧемпионатыКоманды.Ссылка.ПометкаУдаления = ЛОЖЬ
				                      |	И ЧемпионатыКоманды.Ссылка.Владелец.ОлимпийскаяСистема = ЛОЖЬ");
				Запрос.УстановитьПараметр("Команда",			Команда);
				Запрос.УстановитьПараметр("Год",				Год);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					Возврат Выборка.ДатаНачала;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Чемпионат	= СерверныйФункции.ЧемпионатЛигиПоследний(Команда);
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			Возврат НачалоМесяца(Чемпионат.ДатаНачала);
		КонецЕсли;
	КонецЕсли;
	
	Ответ = Дата(Год(ТекущаяДатаСеанса()), 8, 1);
	Если Месяц(Ответ) < 8 Тогда
		Ответ = ДобавитьМесяц(Ответ, - 12);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Функция УРЛ(Команда)
	УРЛ	= СерверныйФункции.КомментарийКакУРЛ(Команда.Комментарий);
	Если СтрокаСодержитЧисло(УРЛ) Тогда
		Чемпионат	= СерверныйФункции.ЧемпионатЛигиПоследний(Команда);
		Если СтрНайти(УРЛ, "%1") = 0 Тогда
			//Слова	= Разделить(УРЛ, "/");
		Иначе
			Если ЗначениеЗаполнено(Чемпионат.ДатаОкончания) Тогда
				УРЛ	= СтрШаблон(УРЛ, ФорматЧГ(Чемпионат.ДатаОкончания));
			Иначе
				УРЛ	= СтрШаблон(УРЛ, ФорматЧГ(ТекущаяДатаСеанса()));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Возврат УРЛ;
КонецФункции

&НаСервере
Функция ИгрокНайти(Наименование, ДатаРождения)
	Игрок	= СерверныйФункции.ИгрокНайти(Наименование, ДатаРождения);
	Возврат Игрок.Игрок;
КонецФункции

&НаСервере
Функция Записать(Объект)
	Ответ	= Ложь;
	Если Объект.ПроверитьЗаполнение() Тогда
		Попытка
			Объект.Записать();
			Ответ	= Истина;
		Исключение
			ОбщегоНазначения.СообщитьОбОшибке(ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура ГиперссылкаЗаписать(Гиперссылка, Команда)
	Объект = Команда.ПолучитьОбъект();
	Если СтрНайти(Объект.Комментарий, Лев(Гиперссылка, 11)) = 0 Тогда
		Если ПустаяСтрока(Объект.Комментарий) Тогда
			Объект.Комментарий	= Гиперссылка;
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ТекущаяДатаСеанса()), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ТекущаяДатаСеанса()), "%1");
		ИначеЕсли СтрНайти(Гиперссылка, Обернуть(ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "/")) > 0 Тогда
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + СтрЗаменить(Гиперссылка, ФорматЧГ(ДобавитьМесяц(ТекущаяДатаСеанса(), 12)), "%1");
		Иначе
			Объект.Комментарий	= Объект.Комментарий + Разрыв() + Гиперссылка;
		КонецЕсли;
		Записать(Объект);
	КонецЕсли;
КонецПроцедуры
