
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала >= ДатаОкончания Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Наименование	= "";
	Слова			= СтрРазделить(ОбъектКопирования.Наименование, " ", Ложь);
	Для Каждого Слово Из Слова Цикл
		Если СтрНайти("0123456789", Лев(Слово, 1)) > 0 Тогда
			Прервать;
		КонецЕсли;
		Наименование = Наименование + Слово + " ";
	КонецЦикла;
	Наименование = Наименование + Формат(Год(ТекущаяДата()), "ЧГ=0") + "/" + Формат((Год(ТекущаяДата()) + 1) - Цел((Год(ТекущаяДата()) + 1) / 100) * 100, "ЧН=00");
	
	ДатаНачала		= ДобавитьМесяц(ДатаНачала, 12);
	ДатаОкончания	= ДобавитьМесяц(ДатаОкончания, 12);
	
	Команды.Очистить();
	Шаг		= 0;
	Выборка	= СерверныйФункции.ТурнирнаяТаблица(ОбъектКопирования.Ссылка);
	Пока Выборка.Следующий() И Шаг < ОбъектКопирования.Владелец.КоличествоКоманд - ОбъектКопирования.Владелец.КоличествоРотация Цикл
		ТекСтрока = Команды.Добавить();
		ТекСтрока.Команда	= Выборка.Команда;
		
		Шаг = Шаг + 1;
	КонецЦикла;
	Команды.Сортировать("Команда");
КонецПроцедуры
