
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала > ДатаОкончания Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Неверно указаны даты", Отказ, Ссылка);
	ИначеЕсли НЕ ЧислоЧетное(Команды.Количество())
	И Команды.Количество() <> Владелец.КоличествоКоманд
	Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Возможно неверное количество команд",, Ссылка);
	КонецЕсли;
	Если ЗначениеЗаполнено(Владелец.Страна) Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	Клубы.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Команды КАК Клубы
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		                      |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Лига КАК Лига
		                      |			ПО Города.Владелец <> Лига.Страна
		                      |		ПО Клубы.Город = Города.Ссылка
		                      |ГДЕ
		                      |	Лига.Ссылка = &Лига
		                      |	И Клубы.Ссылка В(&Команды)
		                      |	И НЕ Клубы.Ссылка В
		                      |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |					ТурнирнаяТаблица.Команда
		                      |				ИЗ
		                      |					РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		                      |				ГДЕ
		                      |					ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига)");
		Запрос.УстановитьПараметр("Лига",				Владелец);
		Запрос.УстановитьПараметр("Команды",			Команды.ВыгрузитьКолонку(0));
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ОбщегоНазначения.СообщитьОбОшибке(СтрШаблон("Возможно неверно указана команда (%1)", Выборка.Ссылка),, Ссылка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ТекЛига			= ОбъектКопирования.Владелец;
	ЧемпионатЛигиПоследний = СерверныйФункции.ЧемпионатЛигиПоследний(ТекЛига);
	Наименование	= "";
	нГод			= 0;
	Слова			= Разделить(Строка(ЧемпионатЛигиПоследний));
	Для Каждого Слово Из Слова Цикл
		Если СтрокаСодержитЧисло(Слово) Тогда
			нГод = СтрокаКакЧисло(Лев(Слово, 4)) + 1;
			Если нГод > 2000 Тогда
				Прервать;
			Иначе
				нГод = 0;
			КонецЕсли;
		КонецЕсли;
		Наименование = Наименование + Слово + " ";
	КонецЦикла;
	
	Наименование = Наименование + ?(нГод = 0,
		ФорматЧГ(ТекущаяДатаСеанса()) + "/" + Формат((Год(ТекущаяДатаСеанса()) + 1) - Цел((Год(ТекущаяДатаСеанса()) + 1) / 100) * 100, "ЧН=00"),
		ФорматЧГ(нГод) + "/" + ФорматЧГ(нГод + 1));
	
	ДатаНачала		= ДобавитьМесяц(?(нГод = 0, ДатаНачала, ЧемпионатЛигиПоследний.ДатаНачала), 12);
	ДатаОкончания	= ДобавитьМесяц(?(нГод = 0, ДатаОкончания, ЧемпионатЛигиПоследний.ДатаОкончания), 12);
	
	Если ТекЛига.КоличествоРотация > 0 Тогда
		Команды.Очистить();
		Шаг		= 0;
		Выборка	= ТурнирнаяТаблица(ЧемпионатЛигиПоследний);
		Пока Выборка.Следующий() И Шаг < ТекЛига.КоличествоКоманд - ТекЛига.КоличествоРотация Цикл
			ЗаполнитьЗначенияСвойств(Команды.Добавить(), Выборка);
			
			Шаг = Шаг + 1;
		КонецЦикла;
		Команды.Сортировать("Команда");
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Чемпионаты.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Чемпионаты КАК Чемпионаты
	                      |ГДЕ
	                      |	Чемпионаты.Владелец = &Владелец
	                      |	И ГОД(Чемпионаты.ДатаОкончания) = &Год");
	Запрос.УстановитьПараметр("Владелец",			Владелец);
	Запрос.УстановитьПараметр("Год",				Год(ДатаОкончания));
	Выборка = Запрос.Выполнить().Выбрать();
	Пока НЕ Отказ И Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> Ссылка Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрШаблон("Неверно указаны даты (%1)", Выборка.Ссылка),, Ссылка);
		КонецЕсли;
	КонецЦикла;
	Если НЕ Отказ Тогда
		КомандыСвернуть();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Лига") Тогда
		Владелец	= ДанныеЗаполнения;
		Команды.Загрузить(ДанныеЗаполнения.Команды.Выгрузить());
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Владелец") Тогда
			ОбработкаЗаполнения(ДанныеЗаполнения.Владелец, ТекстЗаполнения, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура КомандыСвернуть()
	СерверныйФункции.КомандыСвернуть(Команды);
КонецПроцедуры

Процедура КомандыУпорядочить(Тимз) Экспорт
	Выборка	= ТурнирнаяТаблица(Ссылка);
	Если Выборка.Количество() = 0 Тогда
		Тимз.Сортировать("Команда");
	Иначе
		Тимз.Очистить();
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Тимз.Добавить(), Выборка);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Функция ТурнирнаяТаблица(Чемпионат)
	Возврат СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
КонецФункции
