
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПерейтиПоНавигационнойСсылке(СсылкаСформировать(ПараметрКоманды));
КонецПроцедуры

&НаСервере
Функция СсылкаСформировать(Ссылка)
	Если ЭтоУРЛ(Ссылка.Комментарий) Тогда
		Возврат Ссылка.Комментарий;
	КонецЕсли;
	
	ХашХаш = СокрЛП(Ссылка.Наименование);
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды")
	И СтрНайти(ХашХаш, " F.C.") = 0
	Тогда
		ХашХаш = ХашХаш + " F.C.";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы")
	И СтрНайти(ХашХаш, "стадион") = 0
	Тогда
		ХашХаш = ХашХаш + " стадион";
		
	КонецЕсли;
	Возврат "https://ru.wikipedia.org/wiki/" + ХашХаш;
КонецФункции
