
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор	= Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		Отбор.Вставить("Команда", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") И ЕстьИтоги(ПараметрКоманды) Тогда
		Отбор.Вставить("Чемпионат", ПараметрКоманды);
	КонецЕсли;
	Если ЗначениеЗаполнено(Отбор) Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("РегистрСведений.Итоги.ФормаСписка", Новый Структура("Отбор", Отбор), ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьИтоги(Чемпионат)
	Возврат ЗначениеЗаполнено(СерверныйФункции.Чемпион(Чемпионат));
КонецФункции
