
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Отбор	= Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		Отбор.Вставить("Команда", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") И ЕстьИтоги(ПараметрКоманды) Тогда
		Отбор.Вставить("Чемпионат", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Лига") Тогда
		Отбор.Вставить("Чемпионат", Чемпионаты(ПараметрКоманды));
	КонецЕсли;
	Если ЗначениеЗаполнено(Отбор) Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("РегистрСведений.Итоги.ФормаСписка", Новый Структура("Отбор", Отбор), ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЕстьИтоги(Чемпионат)
	Возврат ЗначениеЗаполнено(СерверныйФункции.Чемпион(Чемпионат));
КонецФункции

&НаСервере
Функция Чемпионаты(Лига)
	Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	                      |	Итоги.Чемпионат КАК Чемпионат
	                      |ИЗ
	                      |	РегистрСведений.Итоги КАК Итоги
	                      |ГДЕ
	                      |	Итоги.Чемпионат.Владелец = &Лига");
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции
