
Функция ОтчетСформировать(Объект, ПоказыватьРазницуМячей=Ложь) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	Объект.Данные.Очистить();
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Противник.Команда КАК Команда,
	      	               |	МАКСИМУМ(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
	      	               |				ТОГДА ТурнирнаяТаблица.Регистратор
	      	               |			ИНАЧЕ NULL
	      	               |		КОНЕЦ) КАК МатчД,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
	      	               |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Дома,
	      	               |	МАКСИМУМ(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
	      	               |				ТОГДА Противник.Регистратор
	      	               |			ИНАЧЕ NULL
	      	               |		КОНЕЦ) КАК МатчВ,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
	      	               |				ТОГДА ТурнирнаяТаблица.КоличествоГолов
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Выезд,
	      	               |	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоЗабито,
	      	               |	СУММА(Противник.КоличествоГолов) КАК КоличествоПропущено,
	      	               |	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА Противник.КоличествоОчков = 0
	      	               |				ТОГДА 1
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Выигрыш,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
	      	               |				ТОГДА 1
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Ничья,
	      	               |	СУММА(ВЫБОР
	      	               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
	      	               |				ТОГДА 1
	      	               |			ИНАЧЕ 0
	      	               |		КОНЕЦ) КАК Проигрыш,
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Противник.Регистратор) КАК КоличествоИгр
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК Противник
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ПО Противник.Регистратор = ТурнирнаяТаблица.Регистратор
	      	               |			И Противник.НомерСтроки <> ТурнирнаяТаблица.НомерСтроки
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.Команда.Город.Владелец = ТурнирнаяТаблица.Тур.Владелец.Владелец.Страна
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	Противник.Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Команда
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЧемпионатыКоманды.Команда КАК Команда,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		               |				ТОГДА ТурнирнаяТаблица.Регистратор
		               |			ИНАЧЕ NULL
		               |		КОНЕЦ) КАК МатчД,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 1
		               |				ТОГДА ТурнирнаяТаблица.КоличествоОчков
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Дома,
		               |	МАКСИМУМ(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
		               |				ТОГДА ТурнирнаяТаблица.Регистратор
		               |			ИНАЧЕ NULL
		               |		КОНЕЦ) КАК МатчВ,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.НомерСтроки = 2
		               |				ТОГДА ТурнирнаяТаблица.КоличествоОчков
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выезд,
		               |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоГолов, 0)) КАК КоличествоЗабито,
		               |	СУММА(ЕСТЬNULL(Противник.КоличествоГолов, 0)) КАК КоличествоПропущено,
		               |	СУММА(ЕСТЬNULL(ТурнирнаяТаблица.КоличествоОчков, 0)) КАК КоличествоОчков,
		               |	СУММА(ВЫБОР
		               |			КОГДА Противник.КоличествоОчков = 0
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Выигрыш,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = Противник.КоличествоОчков
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Ничья,
		               |	СУММА(ВЫБОР
		               |			КОГДА ТурнирнаяТаблица.КоличествоОчков = 0
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Проигрыш,
		               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Противник.Регистратор) КАК КоличествоИгр
		               |ИЗ
		               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
		               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				МатчКоманды.Регистратор КАК Регистратор,
		               |				МатчКоманды.НомерСтроки КАК НомерСтроки,
		               |				МатчКоманды.КоличествоОчков КАК КоличествоОчков,
		               |				МатчКоманды.КоличествоГолов КАК КоличествоГолов
		               |			ИЗ
		               |				РегистрНакопления.ТурнирнаяТаблица КАК МатчКоманды
		               |					ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
		               |					ПО МатчКоманды.Регистратор = ТурнирнаяТаблица.Регистратор
		               |						И МатчКоманды.НомерСтроки <> ТурнирнаяТаблица.НомерСтроки
		               |			ГДЕ
		               |				МатчКоманды.Команда = &Команда
		               |				И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
		               |				И ТурнирнаяТаблица.Тур.ОлимпийскаяСистема = ЛОЖЬ) КАК ТурнирнаяТаблица
		               |			ПО Противник.Регистратор = ТурнирнаяТаблица.Регистратор
		               |		ПО ЧемпионатыКоманды.Команда = Противник.Команда
		               |ГДЕ
		               |	ЧемпионатыКоманды.Ссылка = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ЧемпионатыКоманды.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЧемпионатыКоманды.Команда = &Команда,
		               |	КоличествоОчков УБЫВ,
		               |	КоличествоЗабито УБЫВ,
		               |	КоличествоПропущено,
		               |	КоличествоИгр,
		               |	Команда
		               |АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Чемпионат",				Чемпионат);
	Запрос.УстановитьПараметр("Команда",				Команда);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Лига	= Чемпионат.Владелец;
	ТабДокумент.Вывести(ЗаголовокПолучить(Лига));
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("ШапкаП"));
	ТабДокумент.ФиксацияСверху = 3;
	
	Итого	= Новый Структура("НомерСтроки,Дома,Выезд,КоличествоЗабито,КоличествоПропущено,КоличествоИгр,КоличествоОчков", 0, 0, 0, 0, 0, 0, 0);
	Пока Выборка.Следующий() И Выборка.Команда <> Команда Цикл
		Итого.НомерСтроки	= Итого.НомерСтроки + 1;
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиП|НачалоП");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.Место	= Итого.НомерСтроки;
			ТабДокумент.Вывести(ОбластьМакета);
			Присоединить(ТабДокумент, Макет, Выборка.Дома, Выборка.МатчД);
			Присоединить(ТабДокумент, Макет, Выборка.Выезд, Выборка.МатчВ);
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиП|КонецП");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			Если НЕ ПоказыватьРазницуМячей Тогда
				ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
			КонецЕсли;
			ТабДокумент.Присоединить(ОбластьМакета);
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("ДеталиП1");
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ОбластьМакета.Параметры.Место	= Итого.НомерСтроки;
			Если НЕ ПоказыватьРазницуМячей Тогда
				ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Выборка.КоличествоЗабито, Выборка.КоличествоПропущено);
			КонецЕсли;
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЕсли;
		Если Выборка.Дома > 0 Тогда
			Итого.Дома	= Итого.Дома + Выборка.Дома;
		КонецЕсли;
		Если Выборка.Выезд > 0 Тогда
			Итого.Выезд	= Итого.Выезд + Выборка.Выезд;
		КонецЕсли;
		Итого.КоличествоЗабито		= Итого.КоличествоЗабито + Выборка.КоличествоЗабито;
		Итого.КоличествоПропущено	= Итого.КоличествоПропущено + Выборка.КоличествоПропущено;
		Итого.КоличествоОчков		= Итого.КоличествоОчков + Выборка.КоличествоОчков;
		Итого.КоличествоИгр	 		= Итого.КоличествоИгр + Выборка.КоличествоИгр;
		
		Если ЗначениеЗаполнено(Чемпионат) Тогда
			ЗаполнитьЗначенияСвойств(Объект.Данные.Добавить(),
				Новый Структура("Команда,Выигрыш,Ничья,Проигрыш,КоличествоЗабито,КоличествоПропущено",
				Выборка.Команда,
				?(ЗначениеЗаполнено(Выборка.МатчД) И Выборка.Дома > 1, 1, 0) + ?(ЗначениеЗаполнено(Выборка.МатчВ) И Выборка.Выезд > 1, 1, 0),
				?(ЗначениеЗаполнено(Выборка.МатчД) И Выборка.Дома = 1, 1, 0) + ?(ЗначениеЗаполнено(Выборка.МатчВ) И Выборка.Выезд = 1, 1, 0),
				?(ЗначениеЗаполнено(Выборка.МатчД) И Выборка.Дома = 0, 1, 0) + ?(ЗначениеЗаполнено(Выборка.МатчВ) И Выборка.Выезд = 0, 1, 0),
				Выборка.КоличествоЗабито, Выборка.КоличествоПропущено));
		Иначе
			ЗаполнитьЗначенияСвойств(Объект.Данные.Добавить(), Выборка);
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Объект.Данные.Сортировать(?(ПоказыватьРазницуМячей, "Проигрыш Убыв", "КоличествоЗабито Убыв"));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Выборка	= КомментарииПолучить();
		Пока Выборка.Следующий() Цикл
			Итого.КоличествоОчков	= Итого.КоличествоОчков + Выборка.КоличествоОчков;
		КонецЦикла;
		
		ОбластьМакета = Макет.ПолучитьОбласть("ИтогоП");
		ОбластьМакета.Параметры.Заполнить(Итого);
		Если НЕ ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.КоличествоЗабито	= СтрШаблон("%1-%2", Итого.КоличествоЗабито, Итого.КоличествоПропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		
		Выборка.Сбросить();
		ОбластьМакета = Неопределено;
		Пока Выборка.Следующий() Цикл
			Если ОбластьМакета = Неопределено Тогда
				ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));
				ОбластьМакета = Макет.ПолучитьОбласть("Комментарий");
			КонецЕсли;
			ОбластьМакета.Параметры.Заполнить(Выборка);
			ТабДокумент.Вывести(ОбластьМакета);
		КонецЦикла;
	КонецЕсли;
	
	Если Чемпионат.ДатаОкончания > НачалоМесяца(ТекущаяДатаСеанса())
	И НаСервереПовторно.ПоказыватьПредстоящиеМатчи()
	Тогда
		Выборка = ОставшиесяМатчи();
		Если Выборка.Количество() > 0 Тогда
			Утро	= НачалоДня(ТекущаяДатаСеанса());
			Сегодня	= КонецДня(ТекущаяДатаСеанса());
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));
			Пока Выборка.Следующий() Цикл
				ОбластьМакета = Макет.ПолучитьОбласть(?(Выборка.Дата > Сегодня Или Выборка.Дата = Утро , "Матчи", "Сегодня") + ?(Выборка.МояКоманда, "1", ""));
				ОбластьМакета.Параметры.Заполнить(Выборка);
				ТабДокумент.Вывести(ОбластьМакета);
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ТабДокумент;
КонецФункции

Процедура Присоединить(ТабДокумент, Макет, Значение, Регистратор)
	Если ЗначениеЗаполнено(Регистратор) И Значение >= 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиП|" + ?(Значение>1, "WW", ?(Значение=0, "LL", "DD")));
		ОбластьМакета.Параметры.Заполнить(Новый Структура("Регистратор", Регистратор));
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("ДеталиП|NN");
	КонецЕсли;
	ТабДокумент.Присоединить(ОбластьМакета);
КонецПроцедуры

Функция ЗаголовокПолучить(Лига)
	Если ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,Команда", Лига, Чемпионат, Команда));
	КонецЕсли;
	Возврат СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Команда, Команда, Истина));
КонецФункции

Функция КомментарииПолучить()
	Возврат СерверныйФункции.КомментарииПолучить(Чемпионат, Команда);
КонецФункции

Функция ОставшиесяМатчи()
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 5
	      	               |	ВЫБОР
	      	               |		КОГДА Матч.Ссылка.Дата >= &ДатаК
	      	               |			ТОГДА НАЧАЛОПЕРИОДА(Матч.Ссылка.Дата, ДЕНЬ)
	      	               |		КОГДА НАЧАЛОПЕРИОДА(Матч.Ссылка.Дата, ДЕНЬ) = Матч.Ссылка.Дата
	      	               |			ТОГДА Матч.Ссылка.Дата
	      	               |		ИНАЧЕ ДОБАВИТЬКДАТЕ(Матч.Ссылка.Дата, СЕКУНДА, &Сдвиг)
	      	               |	КОНЕЦ КАК Дата,
	      	               |	ВЫБОР
	      	               |		КОГДА Матч.Ссылка.Дата >= &ДатаК
	      	               |			ТОГДА НАЧАЛОПЕРИОДА(Матч.Ссылка.Дата, ДЕНЬ)
	      	               |		ИНАЧЕ Матч.Ссылка.Дата
	      	               |	КОНЕЦ КАК Период,
	      	               |	Матч.Ссылка.Счет КАК Счет,
	      	               |	Матч.Ссылка КАК Матч,
	      	               |	Противники.Команда = &МояКоманда КАК МояКоманда
	      	               |ИЗ
	      	               |	Документ.Матч.Команды КАК Матч
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК Противники
	      	               |		ПО Матч.Ссылка = Противники.Ссылка
	      	               |			И Матч.НомерСтроки <> Противники.НомерСтроки
	      	               |ГДЕ
	      	               |	Матч.Ссылка.Дата >= &ДатаН
	      	               |	И Матч.Ссылка.Проведен = ЛОЖЬ
	      	               |	И Матч.Ссылка.ПометкаУдаления = ЛОЖЬ
	      	               |	И Матч.Ссылка.Тур.Владелец = &Чемпионат
	      	               |	И Матч.Команда = &Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Период");
	Запрос.УстановитьПараметр("ДатаН",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Запрос.УстановитьПараметр("ДатаК",				НачалоДня(ТекущаяУниверсальнаяДата() + Сутки()));
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Запрос.УстановитьПараметр("Команда",			Команда);
	Запрос.УстановитьПараметр("МояКоманда",			МояКоманда());
	Запрос.УстановитьПараметр("Сдвиг",				ТекущаяДатаСеанса() - ТекущаяУниверсальнаяДата());
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
