
&НаСервере
Функция ДанныеПолучить()
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	                      |	Туры.Владелец КАК Чемпионат,
	                      |	НЕ Текущий.Чемпионат ЕСТЬ NULL КАК Текущий,
	                      |	Туры.Владелец.ДатаОкончания КАК ДатаОкончания
	                      |ПОМЕСТИТЬ ВТ
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ПО Туры.Ссылка = ТурнирнаяТаблица.Тур
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ ПЕРВЫЕ 1
	                      |			ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	                      |		ИЗ
	                      |			РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ГДЕ
	                      |			ТурнирнаяТаблица.Тур.Владелец.Владелец = &Лига
	                      |		
	                      |		УПОРЯДОЧИТЬ ПО
	                      |			ТурнирнаяТаблица.Тур.ДатаОкончания УБЫВ) КАК Текущий
	                      |		ПО Туры.Владелец = Текущий.Чемпионат
	                      |ГДЕ
	                      |	Туры.Владелец.Владелец = &Лига
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Владелец,
	                      |	Туры.Владелец.ДатаОкончания,
	                      |	Текущий.Чемпионат
	                      |
	                      |ИМЕЮЩИЕ
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= ЦЕЛ(0.1 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * (КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) - 1))
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаОкончания УБЫВ
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ.Чемпионат КАК Чемпионат,
	                      |	ВТ.ДатаОкончания КАК Точка,
	                      |	ЧемпионатыКоманды.Команда КАК Команда,
	                      |	ДОБАВИТЬКДАТЕ(ЧемпионатыКоманды.Ссылка.ДатаНачала, МЕСЯЦ, -3) КАК ДатаНачала,
	                      |	ВЫБОР
	                      |		КОГДА ВТ.Текущий
	                      |			ТОГДА ДОБАВИТЬКДАТЕ(ЧемпионатыКоманды.Ссылка.ДатаНачала, МЕСЯЦ, 1)
	                      |		ИНАЧЕ ДОБАВИТЬКДАТЕ(ЧемпионатыКоманды.Ссылка.ДатаОкончания, МЕСЯЦ, -3)
	                      |	КОНЕЦ КАК ДатаОкончания
	                      |ИЗ
	                      |	ВТ КАК ВТ
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |		ПО ВТ.Чемпионат = ЧемпионатыКоманды.Ссылка
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Точка
	                      |ИТОГИ
	                      |	МАКСИМУМ(Точка),
	                      |	МАКСИМУМ(ДатаНачала),
	                      |	МАКСИМУМ(ДатаОкончания)
	                      |ПО
	                      |	Чемпионат");
	Если Отчет.Данные.Количество() = 0 Тогда
		Запрос.УстановитьПараметр("Лига",		Отчет.Лига);
		Чемпионаты = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	&Точка КАК Точка,
		               |	&Чемпионат КАК Чемпионат,
		               |	СрезПоследних.Команда КАК Команда,
		               |	МАКСИМУМ(СрезПоследних.Игрок) КАК Игрок,
		               |	СУММА(ВЫБОР
		               |			КОГДА СрезПоследних.Команда = ПеремещенияИгроков.Команда
		               |				ТОГДА 0
		               |			ИНАЧЕ 1
		               |		КОНЕЦ) КАК Новички,
		               |	СУММА(ВЫБОР
		               |			КОГДА СрезПоследних.Команда = ПеремещенияИгроков.Команда
		               |				ТОГДА 1
		               |			ИНАЧЕ 0
		               |		КОНЕЦ) КАК Старики
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		СрезПоследних.Игрок КАК Игрок,
		               |		СрезПоследних.Команда КАК Команда
		               |	ИЗ
		               |		РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК СрезПоследних
		               |	ГДЕ
		               |		СрезПоследних.Команда В(&Команды)) КАК СрезПоследних
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаН, ) КАК ПеремещенияИгроков
		               |		ПО СрезПоследних.Игрок = ПеремещенияИгроков.Игрок
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	СрезПоследних.Команда";
		Пока Чемпионаты.Следующий() Цикл
			мКлубы	= Новый Массив;
			Выборка	= Чемпионаты.Выбрать();
			Пока Выборка.Следующий() Цикл
				мКлубы.Добавить(Выборка.Команда);
			КонецЦикла;
			Запрос.УстановитьПараметр("ДатаН",		Чемпионаты.ДатаНачала);
			Запрос.УстановитьПараметр("Дата",		Чемпионаты.ДатаОкончания);
			Запрос.УстановитьПараметр("Точка",		Чемпионаты.Точка);
			Запрос.УстановитьПараметр("Чемпионат",	Чемпионаты.Чемпионат);
			Запрос.УстановитьПараметр("Команды",	мКлубы);
			Выборка = Запрос.Выполнить().Выбрать();
			Пока Выборка.Следующий() Цикл
				ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выборка);
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	ВЫБОР
		               |		КОГДА ВТ.Команда = &Команда
		               |			ТОГДА ВТ.Команда
		               |		ИНАЧЕ NULL
		               |	КОНЕЦ КАК Команда,
		               |	ВТ.Игрок КАК Игрок,
		               |	ВТ.Старики КАК Старики,
		               |	ВТ.Новички КАК Новички
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	ВложенныйЗапрос.Игрок КАК Игрок,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Старики, 0) КАК Старики,
		               |	ЕСТЬNULL(ВложенныйЗапрос.Новички, 0) КАК Новички
		               |ИЗ
		               |	ВТ КАК ВТ
		               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			ВТ.Точка КАК Точка,
		               |			ВТ.Команда КАК Команда,
		               |			ВТ.Игрок КАК Игрок,
		               |			СУММА(ВТ.Старики) КАК Старики,
		               |			СУММА(ВТ.Новички) КАК Новички
		               |		ИЗ
		               |			ВТ КАК ВТ
		               |		ГДЕ
		               |			ВТ.Команда = &Команда
		               |		
		               |		СГРУППИРОВАТЬ ПО
		               |			ВТ.Точка,
		               |			ВТ.Команда,
		               |			ВТ.Игрок) КАК ВложенныйЗапрос
		               |		ПО ВТ.Точка = ВложенныйЗапрос.Точка
		               |			И ВТ.Команда = ВложенныйЗапрос.Команда
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
		Запрос.УстановитьПараметр("Команда",	Отчет.Команда);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	ВТ.Старики КАК Старики,
		               |	ВТ.Новички КАК Новички
		               |ПОМЕСТИТЬ ВТ
		               |ИЗ
		               |	&ВТ КАК ВТ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТ.Точка КАК Точка,
		               |	ВТ.Чемпионат КАК Чемпионат,
		               |	СУММА(ВТ.Старики) КАК Старики,
		               |	СУММА(ВТ.Новички) КАК Новички
		               |ИЗ
		               |	ВТ КАК ВТ
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВТ.Точка,
		               |	ВТ.Чемпионат
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Точка";
	КонецЕсли;
	Запрос.УстановитьПараметр("ВТ",	Отчет.Данные.Выгрузить());
	Возврат Запрос.Выполнить().Выбрать();
КонецФункции

&НаСервере
Функция УстановитьТочку(Данные)
	Точка = График.УстановитьТочку(ФорматЧГ(Данные.Точка));
	Точка.Расшифровка = Данные.Чемпионат;
	Возврат Точка;
КонецФункции

&НаСервере
Процедура ГрафикОбновить()
	График.Очистить();
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда Возврат; КонецЕсли;
	
	График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = ?(ЗначениеЗаполнено(Отчет.Команда), 5, 0);
	Старики	= График.УстановитьСерию("Старики");
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		График.ПалитраЦветов = ?(Отчет.Команда = МояКоманда(), ПалитраЦветовДиаграммы.Яркая, ПалитраЦветовДиаграммы.Холодная);
		
		Цвет = СерверныйФункции.ЦветКоманды(Отчет.Команда);
		Если Цвет <> Неопределено Тогда
			Старики.Цвет = Цвет;
			Старики.ПриоритетЦвета = Истина;
		КонецЕсли;
	Иначе
		График.ПалитраЦветов = ПалитраЦветовДиаграммы.Авто;
	КонецЕсли;
	Новички	= График.УстановитьСерию("Новички");
	
	Выборка = ДанныеПолучить();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Старики = 0 И Выборка.Новички = 0 И График.Точки.Количество() = 0 Тогда
			//
		ИначеЕсли ЗначениеЗаполнено(Отчет.Команда) Тогда
			Если Выборка.Новички = 1 Тогда
				График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Выборка.Игрок, Выборка.Игрок);
			ИначеЕсли Выборка.Новички > 1 Тогда
				График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Новый Структура("Дата,Команда", Выборка.Точка, Отчет.Команда));
			КонецЕсли;
			График.УстановитьЗначение(УстановитьТочку(Выборка), Старики, Выборка.Старики, Отчет.Команда);
		Иначе
			График.УстановитьЗначение(УстановитьТочку(Выборка), Новички, Выборка.Новички, Выборка.Чемпионат);
			График.УстановитьЗначение(УстановитьТочку(Выборка), Старики, Выборка.Старики, Выборка.Чемпионат);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.Лига) Тогда
		Отчет.Лига = МояЛига();
	КонецЕсли;
	Если ЗначениеЗаполнено(Отчет.Лига) Тогда
		КлубыЗагрузить();
	КонецЕсли;
	Сформировать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Лига") Тогда
		Отчет.Лига	= Параметры.Лига;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Лига);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции
	
&НаСервереБезКонтекста
Функция МояЛига()
	Возврат СерверныйФункции.Лига(СерверныйФункции.ЧемпионатПолучитьПоследнее());
КонецФункции

&НаКлиенте
Процедура КартинкиЗагрузить() Экспорт
	ОбщегоНазначения.КартинкиЗагрузить(Элементы.Команда.СписокВыбора, Кеш);
КонецПроцедуры

&НаКлиенте
Процедура КлубыЗагрузить(мКоманды=Неопределено)
	Если Клубы.Количество() = 0 Или ТипЗнч(мКоманды) = Тип("Массив") Тогда
		Если мКоманды = Неопределено Тогда мКоманды = КлубыПолучить(Отчет.Лига); КонецЕсли;
		Клубы.ЗагрузитьЗначения(мКоманды);
		Элементы.Команда.СписокВыбора.ЗагрузитьЗначения(СерверныйФункции.КомандыЛиги(Отчет.Лига, Истина));
		ПодключитьОбработчикОжидания("КартинкиЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция КлубыПолучить(Лига)
	Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Тур.Владелец КАК Чемпионат
	      	               |ПОМЕСТИТЬ Чемпионаты
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	      	               |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	      	               |ГДЕ
	      	               |	Туры.Владелец.Владелец = &Лига
	      	               |
	      	               |СГРУППИРОВАТЬ ПО
	      	               |	ТурнирнаяТаблица.Тур.Владелец,
	      	               |	Туры.Владелец.ДатаОкончания
	      	               |
	      	               |ИМЕЮЩИЕ
	      	               |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Регистратор) >= ЦЕЛ(0.1 * КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) * (КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) - 1))
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Туры.Владелец.ДатаОкончания УБЫВ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ТурнирнаяТаблица.Команда КАК Команда
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Тур.Владелец В
	      	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |				Чемпионаты.Чемпионат
	      	               |			ИЗ
	      	               |				Чемпионаты)");
	Запрос.УстановитьПараметр("Лига",			Лига);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ЛигаПриИзменении(Элемент)
	Отчет.Данные.Очистить();
	Отчет.Команда = Неопределено;
	Клубы.Очистить();
	КлубыЗагрузить();
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ГрафикОбновить();
КонецПроцедуры

&НаСервере
Функция ИгрокиПолучить(ПараметрыЗапроса)
	Если ПараметрыЗапроса = Неопределено Тогда Возврат Новый Массив; КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПеремещенияИгроковСрезПоследних.Игрок КАК Игрок
	                      |ПОМЕСТИТЬ ПеремещенияИгроковСрезПоследних
	                      |ИЗ
	                      |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ) КАК ПеремещенияИгроковСрезПоследних
	                      |ГДЕ
	                      |	ПеремещенияИгроковСрезПоследних.Команда = &Команда
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 11
	                      |	ПеремещенияИгроковСрезПоследних.Игрок КАК Игрок
	                      |ИЗ
	                      |	ПеремещенияИгроковСрезПоследних КАК ПеремещенияИгроковСрезПоследних
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПеремещенияИгроков.СрезПоследних(&ДатаН, ) КАК ПеремещенияИгроков
	                      |		ПО ПеремещенияИгроковСрезПоследних.Игрок = ПеремещенияИгроков.Игрок
	                      |ГДЕ
	                      |	ПеремещенияИгроков.Команда <> &Команда
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Игрок
	                      |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("ДатаН",		ДобавитьМесяц(ПараметрыЗапроса.Дата, -15));
	Запрос.УстановитьПараметр("Дата",		ДобавитьМесяц(ПараметрыЗапроса.Дата, -3));
	Запрос.УстановитьПараметр("Команда",	ПараметрыЗапроса.Команда);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура Показать(Данные, СтандартнаяОбработка=Ложь) Экспорт
	НаКлиенте.Показать(Данные, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ТипЗнч(ЗначениеДиаграммы.Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Игроки = ИгрокиПолучить(ЗначениеДиаграммы.Расшифровка);
		Если Игроки.Количество() = 1 Тогда
			Показать(Игроки.Получить(0));
		Иначе
			Список = Новый СписокЗначений;
			Список.ЗагрузитьЗначения(Игроки);
			Список.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("Показать", ЭтотОбъект), "Выберите игрока");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
