
Процедура ИтогиОбновить(Чемпионат) Экспорт
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		//
	ИначеЕсли Чемпионат.Владелец.ОлимпийскаяСистема Тогда
		//
	ИначеЕсли ЧемпионатЗакончен(Чемпионат) Тогда
		ИтогиЗаписать(Чемпионат);
	КонецЕсли;
КонецПроцедуры

Функция ЧемпионатЗакончен(Чемпионат)
	Возврат СерверныйФункции.ЧемпионатЗакончен(Чемпионат);
КонецФункции

Процедура ИтогиЗаписать(Чемпионат)
	Гель	= Новый Структура("Период,Чемпионат,Место", Чемпионат.ДатаОкончания, Чемпионат, 1);
	Выборка	= СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	Пока Выборка.Следующий() Цикл
		НЗ		= РегистрыСведений.Итоги.СоздатьНаборЗаписей();
		НЗ.Отбор.Чемпионат.Установить(Чемпионат);
		НЗ.Отбор.Команда.Установить(Выборка.Команда);
		Запись	= НЗ.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		ЗаполнитьЗначенияСвойств(Запись, Гель);
		НЗ.ОбменДанными.Загрузка	= Истина;
		НЗ.Записать();
		
		Гель.Место	= Гель.Место +1;
	КонецЦикла;
КонецПроцедуры
