
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Физический			= Цвет(1);
	Эмоциональный		= Цвет(2);
	Интеллектуальный	= Цвет(3);
	
	Элементы.Физический.ЦветФона		= Физический;
	Элементы.Эмоциональный.ЦветФона		= Эмоциональный;
	Элементы.Интеллектуальный.ЦветФона	= Интеллектуальный;
КонецПроцедуры

&НаСервере
Функция Цвет(Фаза, Дефолт=Ложь)
	Возврат Биоритмы.Цвет(Фаза, Дефолт);
КонецФункции

&НаКлиенте
Процедура ФизическийПриИзменении(Элемент)
	Элементы.Физический.ЦветФона		= Физический;
КонецПроцедуры

&НаКлиенте
Процедура ФизическийОчистка(Элемент, СтандартнаяОбработка)
	ЦветОчистка(Элемент, СтандартнаяОбработка, Физический, 1);
КонецПроцедуры

&НаКлиенте
Процедура ЦветОчистка(Элемент, СтандартнаяОбработка, Цвет, Нумер=1)
	СтандартнаяОбработка	= Ложь;
	Цвет					= Цвет(Нумер, Истина);
	Элемент.ЦветФона		= Цвет;
КонецПроцедуры

&НаКлиенте
Процедура ЭмоциональныйПриИзменении(Элемент)
	Элементы.Эмоциональный.ЦветФона		= Эмоциональный;
КонецПроцедуры

&НаКлиенте
Процедура ЭмоциональныйОчистка(Элемент, СтандартнаяОбработка)
	ЦветОчистка(Элемент, СтандартнаяОбработка, Эмоциональный, 2);
КонецПроцедуры

&НаКлиенте
Процедура ИнтеллектуальныйПриИзменении(Элемент)
	Элементы.Интеллектуальный.ЦветФона	= Интеллектуальный;
КонецПроцедуры

&НаКлиенте
Процедура ИнтеллектуальныйОчистка(Элемент, СтандартнаяОбработка)
	ЦветОчистка(Элемент, СтандартнаяОбработка, Интеллектуальный, 3);
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	Цвета	= Новый Соответствие;
	Цвета.Вставить(1, Физический);
	Цвета.Вставить(2, Эмоциональный);
	Цвета.Вставить(3, Интеллектуальный);
	Нота = Биоритмы.ЦветаСохранить(Цвета);
	Если НЕ ПустаяСтрока(Нота) Тогда
		ОбщегоНазначения.СообщитьОбОшибке(Нота);
	КонецЕсли;
КонецПроцедуры
