
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = УРЛ(ПараметрКоманды);
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт матча");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Ок = Ложь;
	Если ЭтоУРЛ(УРЛ) Тогда
		Ок = ИмпортНаСервере(УРЛ, ПараметрКоманды);
	ИначеЕсли СтрНайти(УРЛ, "¶") > 0 Тогда
		Слова = Новый Массив;
		Для Каждого Слово Из Разделить(УРЛ, "¶", Истина) Цикл
			Если Слова.Найти(Слово) = Неопределено Тогда
				Слова.Добавить(Слово);
			КонецЕсли;
		КонецЦикла;
		Ок = ИмпортСтрок(Слова, ПараметрКоманды);
	КонецЕсли;
	Если Ок Тогда
		НаКлиенте.Оповещение("Матч", ПараметрКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортСтрок(Слова, Матч)
	Ответ	= Ложь;
	
	сМатч	= Новый Структура("Матч,Дата,Команды,СоставыКоманд,Команда1,Команда2", Матч, Дата(1,1,1), Новый Массив, Новый Массив);
	сМатч.Вставить("Тур",		Матч.Тур);
	сМатч.Вставить("Страна",	СтранаНайти(Матч.Тур));
	Голов1		= -1;
	Пенальти1	= -1;
	Голов2		= -1;
	Пенальти2	= -1;
	
	Для Каждого Слово Из Слова Цикл
		Если СтрНайти2(Слово, "й раунд") > 0 Тогда
			//
		ИначеЕсли СтрокаНачинаетсяЧислом(Слово) Тогда
			Если СтрНайти(Слово, " : ") > 0 Тогда
				Для Каждого Гол Из Разделить(СтрУдалить(Слово, "ДВ"), ":", Истина) Цикл
					Если Голов1 < 0 Тогда
						Если Гол = "0" Тогда
							Голов1 = 0;
						ИначеЕсли СтрокаКакЧисло(Гол) > 0 Тогда
							Голов1 = СтрокаКакЧисло(Гол);
						Иначе
							Прервать;
						КонецЕсли;
					ИначеЕсли Голов2 < 0 Тогда
						Если Гол = "0" Тогда
							Голов2 = 0;
						ИначеЕсли СтрокаКакЧисло(Гол) > 0 Тогда
							Голов2 = СтрокаКакЧисло(Гол);
						Иначе
							Прервать;
						КонецЕсли;
					Иначе
						Если Гол = "0" Тогда
							Пенальти2 = 0;
						ИначеЕсли СтрокаКакЧисло(Гол) > 0 Тогда
							Пенальти2 = СтрокаКакЧисло(Гол);
						КонецЕсли;
						Если Пенальти2 >= 0 Тогда
							Пенальти1	= Голов2 - Голов1 * 10;
							Голов2		= Голов1;
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			ИначеЕсли СтрНайти(Слово, "МСК") > 0 Тогда
				ДД	= 0; ММ = 0; ГГ = 0;
				Для Каждого ЧастьДаты Из Разделить(Разделить(Слово, ",").Получить(0)) Цикл
					Если ДД = 0 Тогда
						ДД = СтрокаКакЧисло(ЧастьДаты);
					ИначеЕсли ММ = 0 Тогда
						ММ = СтрокаКакМесяц(ЧастьДаты);
					ИначеЕсли ГГ = 0 Тогда
						ГГ = СтрокаКакЧисло(ЧастьДаты);
					КонецЕсли;
				КонецЦикла;
				Если ГГ > 2000 И ММ > 0 И ДД > 0 Тогда
					Попытка
						сМатч.Дата = Дата(ГГ, ММ, ДД);
					Исключение
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ПустаяСтрока(сМатч.Команда1) Тогда
			сМатч.Команда1 = КомандаНайти(Слово, Матч.Тур);
		ИначеЕсли ПустаяСтрока(сМатч.Команда2) Тогда
			сМатч.Команда2 = КомандаНайти(Слово, Матч.Тур);
			Если сМатч.Команда2 = сМатч.Команда1 Тогда
				сМатч.Команда2 = Неопределено;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если Голов2 >= 0 И Голов1 >= 0
	И Год(сМатч.Дата) > 2000
	И ЗначениеЗаполнено(сМатч.Команда2) И ЗначениеЗаполнено(сМатч.Команда1)
	Тогда
		сМатч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов,Пенальти", сМатч.Команда1, Голов1, Макс(0, Пенальти1)));
		сМатч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов,Пенальти", сМатч.Команда2, Голов2, Макс(0, Пенальти2)));
		Ответ = МатчСохранить(сМатч);
	КонецЕсли;
	
	Возврат Ответ;
КонецФункции

&НаСервере
Функция ИмпортНаСервере(Гиперссылка, Матч)
	Возврат СерверныйФункции.ИмпортМатча(Гиперссылка, Матч);
КонецФункции

&НаСервере
Функция УРЛ(Матч)
	Возврат ?(ТипЗнч(Матч)=Тип("ДокументСсылка.Матч"), КомментарийКакУРЛ(Матч.Комментарий), "");
КонецФункции

&НаСервере
Функция КомментарийКакУРЛ(Комментарий)
	Возврат СерверныйФункции.КомментарийКакУРЛ(Комментарий);
КонецФункции

&НаСервере
Функция КомандаНайти(Слово, Тур)
	Возврат ?(СтрЧислоСтрок(Слово) = 1, СерверныйФункции.КомандаНайти(Слово, Тур), Справочники.Команды.ПустаяСсылка());
КонецФункции

&НаСервере
Функция СтранаНайти(Тур)
	Возврат СерверныйФункции.СтранаНайти(Тур);
КонецФункции

&НаСервере
Функция СтадионНайти(Параметр)
	Города	= СерверныйФункции.СтадионНайти(Параметр, Истина);
	Возврат ?(Города.Количество() = 1, Города.Получить(0), Справочники.Стадионы.ПустаяСсылка());
КонецФункции

&НаСервере
Функция МатчСохранить(сМатч)
	Возврат СерверныйФункции.МатчСохранить(сМатч);
КонецФункции
