
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	УРЛ = "https://football.kulichki.net/england/2024/cc/matches/79727.htm";
	ПоказатьВводСтроки(Новый ОписаниеОповещения("Импорт", ЭтотОбъект, ПараметрКоманды), УРЛ, "Импорт матча");
КонецПроцедуры

&НаКлиенте
Процедура Импорт(УРЛ, ПараметрКоманды) Экспорт
	Если НЕ ПустаяСтрока(УРЛ) Тогда
		Если ИмпортНаСервере(ПараметрКоманды, УРЛ) Тогда
			Оповестить("Матч", ПараметрКоманды);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ИмпортНаСервере(Матч, Гиперссылка)
	Итого	= 0;
	Шагов	= 0;
	Начала	= 0;
	
	сМатч	= Новый Структура("Матч,Дата,Комментарий,Счет,КоличествоЗрителей,Команда1,Команда2,Команды,СоставыКоманд,Стадион", Матч, Дата(1,1,1), Гиперссылка, "", 0, "", "", Новый Массив, Новый Массив);
	сМатч.Вставить("Страна", Матч.Тур.Владелец.Владелец.Страна);
	Команда1	= "";
	Команда2	= "";
	тКоманда	= Неопределено;
	
	Слова	= СерверныйФункции.ПолучитьЭлементыПоИмени(Гиперссылка);
	Для Каждого Слово Из Слова Цикл
		Шагов	= Шагов + 1;
		Если Шагов > 321 Тогда
			Прервать;
		ИначеЕсли Начала < 2 Тогда
			Если СтрНайти(НРег(Слово), "стадион") > 0 Тогда
				Начала = Начала + 1;
				Если Начала = 2 Тогда
					ШапкаЗаполнить(сМатч, Слово);
				КонецЕсли;
			КонецЕсли;
		ИначеЕсли ПустаяСтрока(сМатч.Счет) Тогда
			Если СтрокаСодержитЧисло(Слово) Тогда
				КомандыЗаполнить(сМатч, Слово);
			КонецЕсли;
		//ИначеЕсли СтрНайти("тур,дата,соперник,голы", НРег(Слово)) > 0 И Шагов > 0 Тогда
		//	Прервать;
		//ИначеЕсли НЕ ЗначениеЗаполнено(сМатч.Страна) Тогда
		//	сМатч.Страна = СерверныйФункции.СтранаНайти(Слово);
		//	
		КонецЕсли;
	
		Если НЕ ПустаяСтрока(сМатч.Счет)
		И Год(сМатч.Дата) > 1
		И сМатч.Команды.Количество() = 2
		Тогда
			Если ПустаяСтрока(Команда1) И ПустаяСтрока(Команда2) Тогда
				ДокМатч = сМатч.Матч.ПолучитьОбъект();
				ЗаполнитьЗначенияСвойств(ДокМатч, сМатч.Матч);
				ДокМатч.Команды.Очистить();
				Для Каждого ТекЭлемент Из сМатч.Команды Цикл
					ЗаполнитьЗначенияСвойств(ДокМатч.Команды.Добавить(), ТекЭлемент);
					Если ПустаяСтрока(Команда1) Тогда
						Команда1 = ТекЭлемент.Команда;
					ИначеЕсли ПустаяСтрока(Команда2) Тогда
						Команда2 = ТекЭлемент.Команда;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли СтрСравнить(Команда1, Слово) = 0 Тогда
				тКоманда = сМатч.Команда1;
			ИначеЕсли СтрСравнить(Команда2, Слово) = 0 Тогда
				тКоманда = сМатч.Команда2;
			Иначе
				Игрок = СерверныйФункции.Игрок(Слово);
				Если ЗначениеЗаполнено(Игрок) Тогда
					сМатч.СоставыКоманд.Добавить(Новый Структура("Игрок,Команда", Игрок, тКоманда));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если НЕ ПустаяСтрока(сМатч.Счет)
	И Год(сМатч.Дата) > 1
	И сМатч.Команды.Количество() = 2
	Тогда
		Для Каждого ТекЭлемент Из сМатч.СоставыКоманд Цикл
			ЗаполнитьЗначенияСвойств(ДокМатч.СоставыКоманд.Добавить(), ТекЭлемент);
		КонецЦикла;
		
			Попытка
				//ДокМатч.Записать();
				Итого = Итого + 1;
			Исключение
			КонецПопытки;
	КонецЕсли;
	Возврат (Итого > 0);
КонецФункции

&НаСервере
Процедура ШапкаЗаполнить(Матч, Слова)
	Город	= Неопределено;
	Ультима	= "";
	Для Каждого Слово Из Разделить(Слова, ".") Цикл
		Если Год(Матч.Дата) < 2 Тогда
			Матч.Дата = СтрокаКакДата(Слово);
			
		ИначеЕсли СтрНайти(НРег(Слово), "стадион") > 0 Тогда
			Если НЕ ПустаяСтрока(Ультима) Тогда
				Город	= СерверныйФункции.ГородНайти(Ультима);
			КонецЕсли;
			//Если ЗначениеЗаполнено(Город) Тогда
				Для Каждого Строка Из Разделить(Слово) Цикл
					Если ЗначениеЗаполнено(Матч.Стадион) Тогда
						Прервать;
					ИначеЕсли СтрНайти(НРег(Строка), "стадион") = 0 Тогда
						Матч.Стадион = СерверныйФункции.СтадионНайти(СтрЗаменить(Строка, """", ""));
						Если НЕ ЗначениеЗаполнено(Матч.Стадион)
						И ЗначениеЗаполнено(Город)
						Тогда
							Матч.Стадион = СерверныйФункции.СтадионНайти(Город);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
			//КонецЕсли;
			
		ИначеЕсли СтрНайти(НРег(Слово), "зрител") > 0 Тогда
			Для Каждого Строка Из Разделить(Слово) Цикл
				Если СтрокаКакЧисло(Строка) > 0 Тогда
					Матч.КоличествоЗрителей = СтрокаКакЧисло(Строка);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			Ультима	= Слово;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура КомандыЗаполнить(Матч, Слова)
	//Матч.Команда1	= Неопределено;
	//Матч.Команда2	= Неопределено;
	Голов1			= -1;
	Голов2			= -1;
	
	Для Каждого Слово Из Разделить(Слова) Цикл
		Если СтрСравнить(Слово, "-") = 0 Тогда
			Продолжить;
		ИначеЕсли Голов2 >= 0 Тогда
			Прервать;
		ИначеЕсли НЕ ЗначениеЗаполнено(Матч.Команда1) Тогда
			Матч.Команда1 = СерверныйФункции.КомандаНайти(Слово);
		ИначеЕсли НЕ ЗначениеЗаполнено(Матч.Команда2) Тогда
			Матч.Команда2 = СерверныйФункции.КомандаНайти(Слово);
		ИначеЕсли СтрНайти(Слово, ":") > 0 Тогда
			Для Каждого Голов Из Разделить(Слово, ":") Цикл
				Если Голов1 < 0 Тогда
					Голов1		= СтрокаКакЧисло(Голов);
				ИначеЕсли Голов2 < 0 Тогда
					Голов2		= СтрокаКакЧисло(Голов);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	Если Голов1 >= 0 И ЗначениеЗаполнено(Матч.Команда1)
	И Голов2 >= 0 И ЗначениеЗаполнено(Матч.Команда2)
	Тогда
		Матч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов", Матч.Команда1, Голов1));
		Матч.Команды.Добавить(Новый Структура("Команда,КоличествоГолов", Матч.Команда2, Голов2));
		Матч.Счет	= Слова;
		
		Если НЕ ЗначениеЗаполнено(Матч.Стадион)
		И ЗначениеЗаполнено(Матч.Команда1)
		Тогда
			Матч.Стадион = СерверныйФункции.СтадионНайти(Матч.Команда1);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДатаНачалаСезона(Гиперссылка="")
	Слова	= СтрРазделить(Гиперссылка, "/");
	Год		= ?(Месяц(ТекущаяДатаСеанса())<8, Год(ТекущаяДатаСеанса()), Год(ТекущаяДатаСеанса()) - 1);
	Для Каждого Слово Из Слова Цикл
		Если СтрокаКакЧисло(Слово) > 2000 Тогда
			Год = СтрокаКакЧисло(Слово) - 1;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Дата(Год, ?(Год = Год(ТекущаяДатаСеанса()), 1, 8), 1);
КонецФункции

&НаСервере
Функция СтрокаКакДата(Знач Слово)
	Ответ = Дата(1,1,1);
	Если СтрНайти(Слово, " ") = 0 Тогда
		Попытка
			Если СтрДлина(Слово) = 10 Тогда
				Ответ = Дата(Сред(Слово, 7, 4) + Сред(Слово, 4, 2) + Лев(Слово, 2));
			Иначе
				Слова = Разделить(Слово, ".");
				Если Слова.Количество() = 3 Тогда
					Ответ = Дата(Слова.Получить(2) + Прав("0" + Слова.Получить(1), 2) + Прав("0" + Слова.Получить(0), 2));
				КонецЕсли;
			КонецЕсли;
		Исключение КонецПопытки;
	Иначе
		Мезе	= 0;
		Жьорно	= 0;
		Для Каждого Строка Из Разделить(Слово) Цикл
			Если Жьорно = 0 Тогда
				Жьорно	= СтрокаКакЧисло(Строка);
			ИначеЕсли СтрокаКакМесяц(Строка) > 0 Тогда
				Мезе	= СтрокаКакМесяц(Строка);
			КонецЕсли;
		КонецЦикла;
		Если Мезе > 0 И Жьорно > 0 Тогда
			Попытка
				Ответ = Дата(Год(ТекущаяДатаСеанса()), Мезе, Жьорно);
				Если Ответ > ТекущаяДатаСеанса() Тогда
					Ответ = Дата(Год(ТекущаяДатаСеанса()) - 1, Мезе, Жьорно);
				КонецЕсли;
			Исключение КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции
