
&НаСервере
Процедура СформироватьНаСервере()
	Если НЕ ПроверитьЗаполнение() Тогда Возврат; КонецЕсли;
	Элементы.ДанныеКоманда.Видимость = (ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки"));
	
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
КонецПроцедуры

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		//
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ссылка") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомандаИлиИгрок);
		Отчет.КомандаИлиИгрок	= Параметры.Ссылка;
	Иначе
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаКлиенте
Процедура КомандаИлиИгрокПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СформироватьНаСервере();
	Иначе
		Отчет.Данные.Очистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаИлиИгрокОчисткаНаСервере(КомандаИлиИгрок)
	Если ТипЗнч(КомандаИлиИгрок) = Тип("СправочникСсылка.Команды") Тогда
		КомандаИлиИгрок = Справочники.Игроки.ПустаяСсылка();
	Иначе
		КомандаИлиИгрок = МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаИлиИгрокОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СтандартнаяОбработка = Ложь;
		КомандаИлиИгрокОчисткаНаСервере(Отчет.КомандаИлиИгрок);
		Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
			СформироватьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(Элемент.ТекущиеДанные.Чемпионат, СтандартнаяОбработка);
КонецПроцедуры
