
&НаСервереБезКонтекста
Функция ИзображениеПолучить(Ссылка)
	Возврат СерверныйФункции.ИзображениеПолучить(Ссылка);
КонецФункции

&НаСервере
Функция ДанныеПолучить()
	Ответ	= Новый Массив;
	
	Отчет.Данные.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Чемпионаты.Ссылка КАК Чемпионат,
	      	               |	Чемпионаты.Владелец КАК Ссылка,
	      	               |	Чемпионаты.Владелец.Код КАК Код,
	      	               |	Чемпионаты.Владелец.Наименование КАК Наименование,
	      	               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
	      	               |	1 КАК Количество,
	      	               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
	      	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
	      	               |	ГОД(Чемпионаты.ДатаОкончания) КАК Период,
	      	               |	Итоги.КоличествоОчков КАК КоличествоОчков,
	      	               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
	      	               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
	      	               |ИЗ
	      	               |	РегистрСведений.Итоги КАК Итоги
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	      	               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
	      	               |ГДЕ
	      	               |	Итоги.Команда = &Ссылка
	      	               |	И Итоги.Место = 1
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЕстьКартинка УБЫВ,
	      	               |	Период УБЫВ
	      	               |ИТОГИ
	      	               |	МАКСИМУМ(Код),
	      	               |	МАКСИМУМ(Наименование),
	      	               |	МАКСИМУМ(ОлимпийскаяСистема),
	      	               |	СУММА(Количество),
	      	               |	МАКСИМУМ(ЕстьКартинка),
	      	               |	МАКСИМУМ(Представление),
	      	               |	МАКСИМУМ(Период)
	      	               |ПО
	      	               |	Ссылка");
	Если ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Чемпионаты.Ссылка КАК Чемпионат,
		               |	Чемпионаты.Владелец КАК Ссылка,
		               |	Чемпионаты.Владелец.Код КАК Код,
		               |	Чемпионаты.Владелец.Наименование КАК Наименование,
		               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
		               |	Итоги.Команда КАК Команда,
		               |	1 КАК Количество,
		               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
		               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
		               |	ГОД(Чемпионаты.ДатаОкончания) КАК Период,
		               |	Итоги.КоличествоОчков КАК КоличествоОчков,
		               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
		               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрСведений.Итоги КАК Итоги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
		               |ГДЕ
		               |	(Итоги.Чемпионат, Итоги.Команда) В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				МатчСоставыКоманд.Ссылка.Тур.Владелец,
		               |				МатчСоставыКоманд.Команда
		               |			ИЗ
		               |				Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |			ГДЕ
		               |				МатчСоставыКоманд.Игрок = &Ссылка)
		               |	И Итоги.Место = 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕстьКартинка УБЫВ,
		               |	Период УБЫВ
		               |ИТОГИ
		               |	МАКСИМУМ(Код),
		               |	МАКСИМУМ(Наименование),
		               |	МАКСИМУМ(ОлимпийскаяСистема),
		               |	СУММА(Количество),
		               |	МАКСИМУМ(ЕстьКартинка),
		               |	МАКСИМУМ(Представление),
		               |	МАКСИМУМ(Период)
		               |ПО
		               |	Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",				Отчет.КомандаИлиИгрок);
	Выборка	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			Элемент = Новый Структура("Ссылка,Код,Наименование,Количество,ЕстьКартинка,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, Выборка);
			Если Выборка.ЕстьКартинка Тогда
				Элемент.Представление	= ИзображениеПолучить(Выборка.Ссылка);
			КонецЕсли;
			Ответ.Добавить(Элемент);
		КонецЕсли;
		Выбор = Выборка.Выбрать();
		Пока Выбор.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выбор);
		КонецЦикла;
	КонецЦикла;
	Возврат Ответ;
КонецФункции

&НаСервере
Процедура СформироватьНаСервере()
	Если НЕ ПроверитьЗаполнение() Тогда Возврат; КонецЕсли;
	Элементы.ДанныеКоманда.Видимость = (ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки"));
	
	ЭлементыОчистить();
	Чемпионы.Очистить();

	Список = ДанныеПолучить();
	Для Каждого Выборка Из Список Цикл
		ЭлементСписка = Чемпионы.Добавить(Выборка.Ссылка, Выборка.Представление);
		
		Элемент = Элементы.Добавить("Декорация" + Выборка.Код, Тип("ПолеФормы"), Элементы.СтраницаЧемпионы);
		Если Выборка.ЕстьКартинка Тогда
			Элемент.Вид			= ВидПоляФормы.ПолеКартинки;
			Элемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Низ;
			Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Представление", Чемпионы.Количество() - 1);
			Элемент.Заголовок	= СтрШаблон("%1 (%2)", Выборка.Наименование, Выборка.Количество);
		Иначе
			Элемент.ПутьКДанным	= СтрШаблон("Чемпионы[%1].Значение", Чемпионы.Количество() - 1);
			Элемент.Заголовок	= СтрШаблон("(%1)", Выборка.Количество);
		КонецЕсли;
		//Элемент.Высота		= 6;
		//Элемент.Ширина		= 14;
		//Элемент.АвтоВысотаЯчейки		= Истина;
		Элемент.АвтоМаксимальнаяВысота	= Ложь;
		Элемент.МаксимальнаяВысота		= 6;
		Элемент.АвтоМаксимальнаяШирина	= Ложь;
		Элемент.МаксимальнаяШирина		= 16;
		Элемент.Гиперссылка				= Истина;
		Элемент.Подсказка				= Выборка.Представление;
		Элемент.РасширеннаяПодсказка.Заголовок = Выборка.Ссылка;
		Элемент.УстановитьДействие("Нажатие", "ДекорацияНажатие");
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЭлементыОчистить()
	Пока Элементы.СтраницаЧемпионы.ПодчиненныеЭлементы.Количество() > 0 Цикл
		Элементы.Удалить(Элементы.СтраницаЧемпионы.ПодчиненныеЭлементы.Получить(0));
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияНажатие(Элемент, СтандартнаяОбработка)
	Для Каждого Чемпион Из Чемпионы Цикл
		Если Чемпион.Представление = Элемент.Подсказка Тогда
			Показать(Чемпион.Значение, СтандартнаяОбработка);
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Показать(Значение, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Значение) = Тип("Строка") Тогда
		//
	Иначе
		НаКлиенте.Показать(Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	СформироватьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Ссылка") Тогда
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.КомандаИлиИгрок);
		Отчет.КомандаИлиИгрок	= Параметры.Ссылка;
	Иначе
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		Отчет.КомандаИлиИгрок	= МояКоманда();
	КонецЕсли;
	
	СформироватьНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Функция МояКоманда()
	Возврат СерверныйФункции.МояКомандаПолучить();
КонецФункции

&НаКлиенте
Процедура КомандаИлиИгрокПриИзменении(Элемент)
	Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СформироватьНаСервере();
	Иначе
		Отчет.Данные.Очистить();
		ЭлементыОчистить();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура КомандаИлиИгрокОчисткаНаСервере(КомандаИлиИгрок)
	Если ТипЗнч(КомандаИлиИгрок) = Тип("СправочникСсылка.Команды") Тогда
		КомандаИлиИгрок = Справочники.Игроки.ПустаяСсылка();
	Иначе
		КомандаИлиИгрок = МояКоманда();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаИлиИгрокОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
		СтандартнаяОбработка = Ложь;
		КомандаИлиИгрокОчисткаНаСервере(Отчет.КомандаИлиИгрок);
		Если ЗначениеЗаполнено(Отчет.КомандаИлиИгрок) Тогда
			СформироватьНаСервере();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДанныеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Показать(Элемент.ТекущиеДанные.Чемпионат, СтандартнаяОбработка);
КонецПроцедуры
