
&НаСервере
Процедура СформироватьНаСервере(ТолькоОтчет=Ложь)
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет, Все);
		
		Если ТолькоОтчет Тогда
			//
		ИначеЕсли Элементы.ГруппаДиаграммы.Видимость Тогда
			ГрафикОбновитьНаСервере();
			ГрафикОбновитьНаСервере2();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновитьНаСервере(Пошагам=Ложь)
	Если ?(Пошагам, Список.Количество() = 0, Истина) Тогда
		График.Очистить();
		
		ТЧ = Отчет.Данные.Выгрузить(, "Команда,КоличествоОчков");
		ТЧ.Свернуть("Команда", "КоличествоОчков");
		ТЧ.Сортировать("КоличествоОчков УБЫВ");
		Для Каждого ТекСтрока Из ТЧ Цикл
			Точка = График.УстановитьТочку(ТекСтрока.Команда);
			Точка.Расшифровка = ТекСтрока.Команда;
		КонецЦикла;
		График.ОбластьПостроения.ШкалаЗначений.ШагШкалы = 2 * НаСервереПовторно.Победа(Отчет.Чемпионат);
	КонецЕсли;
	
	ТурКод = 0;
	Если Пошагам Тогда
		Поисковик = Новый Структура("Команда");
		Для Итератор = 0 По 3 Цикл
			Поисковик.Команда = Неопределено;
			Для Каждого ТекСтрока Из Отчет.Данные Цикл
				Если ТурКод = 0 Тогда ТурКод = ТекСтрока.ТурКод; КонецЕсли;
				Если Список.НайтиПоЗначению(ТекСтрока.Команда) = Неопределено Тогда
					Список.Добавить(ТекСтрока.Команда, ТекСтрока.Команда);
					
					ЗаполнитьЗначенияСвойств(Поисковик, ТекСтрока);
					Прервать;
				КонецЕсли;
			КонецЦикла;
			мСтроки = Отчет.Данные.НайтиСтроки(Поисковик);
			Для Каждого ТекСтрока Из мСтроки Цикл
				Если ТурКод = ТекСтрока.ТурКод Тогда
					График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.ТурКод), ТекСтрока.КоличествоОчков, Новый Структура("Команда,Проведен", ТекСтрока.Команда, Истина));
				Иначе
					График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.ТурКод), ТекСтрока.КоличествоОчков, Новый Структура("Команда,Проведен", ТекСтрока.Команда, Ложь));
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	Иначе
		Для Каждого ТекСтрока Из Отчет.Данные Цикл
			Если ТурКод = 0 Тогда ТурКод = ТекСтрока.ТурКод; КонецЕсли;
			Если ТурКод = ТекСтрока.ТурКод Тогда
				График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.ТурКод), ТекСтрока.КоличествоОчков, Новый Структура("Команда,Проведен", ТекСтрока.Команда, Истина));
			Иначе
				График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.ТурКод), ТекСтрока.КоличествоОчков, Новый Структура("Команда,Проведен", ТекСтрока.Команда, Ложь));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГрафикОбновитьНаСервере2()
	Диаграмма.Очистить();
	
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	ВТ.Команда КАК Команда,
	      	               |	ВТ.КоличествоОчков КАК КоличествоОчков,
	      	               |	ВТ.ТурКод КАК ТурКод
	      	               |ПОМЕСТИТЬ ВТ
	      	               |ИЗ
	      	               |	&ВТ КАК ВТ
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	ЧемпионатыКоманды.Команда КАК Команда,
	      	               |	ЕСТЬNULL(ВТ.КоличествоОчков, 0) КАК КоличествоОчков,
	      	               |	ЕСТЬNULL(ПериодМин.Период, ЧемпионатыКоманды.Ссылка.ДатаНачала) КАК Начало,
	      	               |	ЕСТЬNULL(ВТ.ТурКод, 0) КАК ТурКод
	      	               |ПОМЕСТИТЬ Старт
	      	               |ИЗ
	      	               |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ КАК ВТ
	      	               |		ПО ЧемпионатыКоманды.Команда = ВТ.Команда
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |			ТурнирнаяТаблица.Команда КАК Команда,
	      	               |			МИНИМУМ(ТурнирнаяТаблица.Период) КАК Период
	      	               |		ИЗ
	      	               |			РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |		ГДЕ
	      	               |			ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |		
	      	               |		СГРУППИРОВАТЬ ПО
	      	               |			ТурнирнаяТаблица.Команда) КАК ПериодМин
	      	               |		ПО ЧемпионатыКоманды.Команда = ПериодМин.Команда
	      	               |ГДЕ
	      	               |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	      	               |	И ЕСТЬNULL(ВТ.ТурКод, 0) В
	      	               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |				Туры.ТурКод КАК ТурКод
	      	               |			ИЗ
	      	               |				ВТ КАК Туры
	      	               |			ГДЕ
	      	               |				НЕ Туры.ТурКод В
	      	               |						(ВЫБРАТЬ
	      	               |							МАКСИМУМ(Туры.ТурКод)
	      	               |						ИЗ
	      	               |							ВТ КАК Туры))
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	Данные.Команда КАК Команда,
	      	               |	Данные.КоличествоОчков КАК КоличествоОчков,
	      	               |	Данные.Начало КАК Начало,
	      	               |	Данные.Проведен КАК Проведен
	      	               |ИЗ
	      	               |	(ВЫБРАТЬ
	      	               |		Старт.Команда КАК Команда,
	      	               |		Старт.КоличествоОчков КАК КоличествоОчков,
	      	               |		Старт.Начало КАК Начало,
	      	               |		ИСТИНА КАК Проведен
	      	               |	ИЗ
	      	               |		Старт КАК Старт
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |				Финиш.Команда КАК Команда,
	      	               |				МАКСИМУМ(Финиш.ТурКод) КАК ТурКод
	      	               |			ИЗ
	      	               |				Старт КАК Финиш
	      	               |			
	      	               |			СГРУППИРОВАТЬ ПО
	      	               |				Финиш.Команда) КАК Финиш
	      	               |			ПО Старт.Команда = Финиш.Команда
	      	               |				И Старт.ТурКод = Финиш.ТурКод
	      	               |	
	      	               |	ОБЪЕДИНИТЬ
	      	               |	
	      	               |	ВЫБРАТЬ
	      	               |		Старт.Команда,
	      	               |		Финиш.КоличествоОчков,
	      	               |		ДОБАВИТЬКДАТЕ(Старт.Начало, ДЕНЬ, Старт.КоличествоОчков),
	      	               |		ЛОЖЬ
	      	               |	ИЗ
	      	               |		Старт КАК Старт
	      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ КАК Финиш
	      	               |			ПО Старт.Команда = Финиш.Команда
	      	               |				И Старт.ТурКод < Финиш.ТурКод) КАК Данные
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |			ВТ.Команда КАК Команда,
	      	               |			СУММА(ВТ.КоличествоОчков) КАК Количество
	      	               |		ИЗ
	      	               |			ВТ КАК ВТ
	      	               |		
	      	               |		СГРУППИРОВАТЬ ПО
	      	               |			ВТ.Команда) КАК ВТ
	      	               |		ПО Данные.Команда = ВТ.Команда
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ВТ.Количество УБЫВ,
	      	               |	Команда,
	      	               |	Проведен УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",	Отчет.Чемпионат);
	Запрос.УстановитьПараметр("ВТ",			Отчет.Данные.Выгрузить());
	Выборка	= Запрос.Выполнить().Выбрать();
	
	Место	= Новый Соответствие;
	Серия	= Диаграмма.УстановитьСерию(Отчет.Чемпионат);
	Серия.Текст	= Отчет.Чемпионат;
	Пока Выборка.Следующий() Цикл
		Место.Вставить(Выборка.Команда, ?(Место.Получить(Выборка.Команда) = Неопределено, Выборка.КоличествоОчков, Выборка.КоличествоОчков + Место.Получить(Выборка.Команда)));
		Точка	= Диаграмма.УстановитьТочку(Выборка.Команда);
		
		Значение		= Диаграмма.ПолучитьЗначение(Точка, Серия);
		Значение.Текст	= Место.Получить(Выборка.Команда);
		
		Интервал	= Значение.Добавить();
		ЗаполнитьЗначенияСвойств(Интервал, Новый Структура("Начало,Конец,Текст,Расшифровка",
			Выборка.Начало, Выборка.Начало + Сутки(Выборка.КоличествоОчков), Формат(Выборка.КоличествоОчков, "ЧГ=0"), Новый Структура("Команда,Проведен", Выборка.Команда, Выборка.Проведен)));
		Если Выборка.Проведен Тогда
			Точка.Текст			= СтрШаблон("%1. %2", Место.Количество(), Выборка.Команда);
			Точка.Расшифровка	= Выборка.Команда;
			Точка.Картинка		= СерверныйФункции.ИзображениеПолучить(Выборка.Команда, Истина);
		Иначе
			Интервал.Цвет	= ЦветаСтиля.ЦветОсобогоТекста;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЧемпионатПолучитьПоследнее()
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее();
КонецФункции

&НаКлиенте
Процедура ЧемпионатОчистка(Элемент, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		СтандартнаяОбработка	= Ложь;
		Отчет.Чемпионат = ЧемпионатПолучитьПоследнее();
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ВидимостьУстановить()
	Элементы.Все.Видимость			= (Отчет.Чемпионат.Владелец.ОлимпийскаяСистема = Ложь);
	Элементы.График.Видимость		= (НЕ Элементы.ФормаКомандаДиаграмма.Пометка);
	Элементы.Диаграмма.Видимость	= Элементы.ФормаКомандаДиаграмма.Пометка;
	Элементы.Фазы.Видимость			= Элементы.ФормаПросмотрИсходныхДанных.Пометка;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент=Неопределено)
	ВидимостьУстановить();
	СформироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбновить() Экспорт
	Если НЕ Элементы.ГруппаДиаграммы.Видимость Или Отчет.Данные.Количество() = 2 * Список.Количество() Тогда
		ОтключитьОбработчикОжидания("ГрафикОбновить");
	Иначе
		ГрафикОбновитьНаСервере(Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ФормаПриОткрытии() Экспорт
	Если НаКлиенте.ФормаПриОткрытии(ЭтаФорма) Тогда
		ПоложениеКоманднойПанели	= ПоложениеКоманднойПанелиФормы.Нет;
	КонецЕсли;
	ВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключитьОбработчикОжидания("ФормаПриОткрытии", 0.1, Истина);
	
	Если ЗначениеЗаполнено(Отчет.Чемпионат)
	И Элементы.ГруппаПараметры.Видимость
	И Чемпионаты.НайтиПоЗначению(Отчет.Чемпионат) = Неопределено
	Тогда
		Отчет.Чемпионат = Неопределено;
	КонецЕсли;
	Если Элементы.ГруппаПараметры.Видимость Тогда
		Сформировать();
	ИначеЕсли ПроверитьЗаполнение() Тогда
		СформироватьНаСервере(Истина);
		ГрафикОбновить();
		ПодключитьОбработчикОжидания("ГрафикОбновить", 1);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧемпионатыЗагрузитьНаСервере();
	Если Параметры.Свойство("Чемпионат") Тогда
		Если Чемпионаты.НайтиПоЗначению(Параметры.Чемпионат) = Неопределено Тогда
			Отказ = Истина;
		Иначе
			Отчет.Чемпионат	= Параметры.Чемпионат;
		КонецЕсли;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.ГруппаПараметры);
	КонецЕсли;
	Если Параметры.Свойство("График") Тогда
		Элементы.ГруппаДиаграммы.Видимость = Параметры.График;
		Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Элементы.График.Видимость			= Ложь;
			Элементы.Диаграмма.Видимость		= Ложь;
		КонецЕсли;
	Иначе
		Элементы.ГруппаДиаграммы.Видимость = Ложь;
	КонецЕсли;
	Элементы.ФормаКомандаДиаграмма.Пометка	= НаСервереПовторно.ВыводитьЛоготипыКоманд();
	Элементы.Фазы.Видимость					= Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") Тогда
		ПодключитьОбработчикОжидания("ЧемпионатыЗагрузить", 0.1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатыЗагрузить() Экспорт
	ЧемпионатыЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузитьНаСервере()
	Отчет.Данные.Очистить();
	Элементы.Чемпионат.СписокВыбора.Очистить();
	
	Чемпионаты.ЗагрузитьЗначения(СерверныйФункции.ЧемпионатыАктивные(Истина));
	Для Каждого Элемент Из Чемпионаты Цикл
		Элементы.Чемпионат.СписокВыбора.Добавить(Элемент.Значение);
		Если Элементы.Чемпионат.СписокВыбора.Количество() = 11 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИгрокиПолучить(Клуб, Чемпионат)
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	ПеремещенияИгроков.Игрок КАК Игрок,
	      	               |	ВЫБОР
	      	               |		КОГДА (МатчСоставыКоманд.Игрок ЕСТЬ NULL) = ЛОЖЬ
	      	               |			ТОГДА 2
	      	               |		КОГДА ПеремещенияИгроков.Игрок.ПометкаУдаления = ЛОЖЬ
	      	               |			ТОГДА 1
	      	               |		ИНАЧЕ 0
	      	               |	КОНЕЦ КАК Порядок
	      	               |ПОМЕСТИТЬ Игроки
	      	               |ИЗ
	      	               |	РегистрСведений.ПеремещенияИгроков.СрезПоследних(&Дата, ГОД(Игрок.ДатаРОждения) >= 1900) КАК ПеремещенияИгроков
	      	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	      	               |			МатчСоставыКоманд.Игрок КАК Игрок,
	      	               |			МатчСоставыКоманд.Команда КАК Команда
	      	               |		ИЗ
	      	               |			Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
	      	               |		ГДЕ
	      	               |			МатчСоставыКоманд.Игрок.ПометкаУдаления = ЛОЖЬ
	      	               |			И МатчСоставыКоманд.Ссылка.Дата В
	      	               |					(ВЫБРАТЬ
	      	               |						МАКСИМУМ(Составы.Ссылка.Дата)
	      	               |					ИЗ
	      	               |						РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |							ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.СоставыКоманд КАК Составы
	      	               |							ПО
	      	               |								ТурнирнаяТаблица.Регистратор = Составы.Ссылка
	      	               |									И ТурнирнаяТаблица.Команда = Составы.Команда
	      	               |					ГДЕ
	      	               |						ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |						И ТурнирнаяТаблица.Команда = &Команда
	      	               |					СГРУППИРОВАТЬ ПО
	      	               |						ТурнирнаяТаблица.Команда)) КАК МатчСоставыКоманд
	      	               |		ПО ПеремещенияИгроков.Игрок = МатчСоставыКоманд.Игрок
	      	               |			И ПеремещенияИгроков.Команда = МатчСоставыКоманд.Команда
	      	               |ГДЕ
	      	               |	ПеремещенияИгроков.Команда = &Команда
	      	               |;
	      	               |
	      	               |////////////////////////////////////////////////////////////////////////////////
	      	               |ВЫБРАТЬ
	      	               |	Игроки.Игрок КАК Игрок
	      	               |ИЗ
	      	               |	Игроки КАК Игроки
	      	               |ГДЕ
	      	               |	Игроки.Порядок В
	      	               |			(ВЫБРАТЬ
	      	               |				МАКСИМУМ(Игроки.Порядок)
	      	               |			ИЗ
	      	               |				Игроки)
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Игрок
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Запрос.УстановитьПараметр("Команда",			Клуб);
	Запрос.УстановитьПараметр("Чемпионат",			Чемпионат);
	Запрос.УстановитьПараметр("Дата",				НачалоДня(ТекущаяУниверсальнаяДата()));
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
КонецФункции

&НаКлиенте
Процедура ПослеВыбора(Элемент, ПараметрКоманды=Неопределено) Экспорт
	НаКлиенте.Показать(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаРасшифровки(Расшифровка, СтандартнаяОбработка=Ложь)
	Если ТипЗнч(Расшифровка) = Тип("СправочникСсылка.Команды") Тогда
		Игроки.ЗагрузитьЗначения(ИгрокиПолучить(Расшифровка, Отчет.Чемпионат));
		Если Игроки.Количество() > 0 Тогда
			СтандартнаяОбработка = Ложь;
			
			Игроки.Добавить(Расшифровка);
			Игроки.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите игрока");
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Расшифровка) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;
		
		Матчи = МатчиПолучить(Расшифровка.Команда, Расшифровка.Проведен);
		Если Матчи.Количество() = 1 Тогда
			ПослеВыбора(Матчи.Получить(0));
		ИначеЕсли Матчи.Количество() > 1 Тогда
			Матчи.ПоказатьВыборЭлемента(Новый ОписаниеОповещения("ПослеВыбора", ЭтотОбъект), "Выберите матч");
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	ОбработкаРасшифровки(ЗначениеДиаграммы, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка=Ложь, ДополнительныеПараметры=Неопределено)
	ОбработкаРасшифровки(Расшифровка, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрИсходныхДанных(Команда)
	Элементы.ФормаПросмотрИсходныхДанных.Пометка = (НЕ Элементы.ФормаПросмотрИсходныхДанных.Пометка);
	ВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаДиаграмма(Команда)
	Элементы.ФормаКомандаДиаграмма.Пометка = (НЕ Элементы.ФормаКомандаДиаграмма.Пометка);
	ВидимостьУстановить();
КонецПроцедуры

&НаСервере
Функция МатчиПолучить(Команда, Проведен)
	Матчи = Новый СписокЗначений;
	Если Проведен Тогда
		Запрос	= Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 11
	      	               |	ТурнирнаяТаблица.Регистратор КАК Значение
	      	               |ИЗ
	      	               |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	      	               |ГДЕ
	      	               |	ТурнирнаяТаблица.Команда = &Команда
	      	               |	И ТурнирнаяТаблица.Тур.Владелец = &Чемпионат
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ТурнирнаяТаблица.Период УБЫВ");
		Запрос.УстановитьПараметр("Чемпионат",	Отчет.Чемпионат);
		Запрос.УстановитьПараметр("Команда",	Команда);
		Матчи.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
	Иначе
		Для Каждого ТекСтрока Из Отчет.Фазы Цикл
			Если Матчи.Количество() = 11 Тогда
				Прервать;
			ИначеЕсли ТекСтрока.Команда = Команда Или ТекСтрока.Противник = Команда Тогда
				Матчи.Добавить(ТекСтрока.Матч, СтрШаблон("%1	%2 - %3", ТекСтрока.Матч, ТекСтрока.Фаза, ТекСтрока.ФазаП));
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	Возврат Матчи;
КонецФункции

&НаКлиенте
Процедура ЧемпионатНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	ПараметрКоманды = Новый Структура("РежимВыбора,Отбор,ТолькоТекущие", Истина, Новый Структура("Ссылка", Чемпионаты.ВыгрузитьЗначения()), Истина);
	Если ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		ПараметрКоманды.Вставить("ТекущаяСтрока", Отчет.Чемпионат);
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Справочник.Чемпионаты.ФормаВыбора", ПараметрКоманды, Элемент, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ФазыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	НаКлиенте.Показать(Элемент.ТекущиеДанные.Матч, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ДиаграммаВыбор(Элемент, Значения, СтандартнаяОбработка, Дата)
	Если ТипЗнч(Значения) = Тип("Массив") Тогда
		СтандартнаяОбработка = Ложь;
		Для Каждого Значение Из Значения Цикл
			Если ТипЗнч(Значение.Расшифровка) = Тип("Структура") Тогда
				ОбработкаРасшифровки(Значение.Расшифровка);
				Прервать;
			КонецЕсли;
		КонецЦикла;
	Иначе
		ОбработкаРасшифровки(Значения.Значение, СтандартнаяОбработка);
	КонецЕсли;
КонецПроцедуры
