
&НаСервере
Процедура СформироватьНаСервере()
	Результат = РеквизитФормыВЗначение("Отчет").ОтчетСформировать(Отчет);
	
	График.Очистить();
	Для Каждого ТекСтрока Из Отчет.Данные Цикл
		График.УстановитьЗначение(График.УстановитьТочку(ТекСтрока.Команда), График.УстановитьСерию(ТекСтрока.Тур), ТекСтрока.КоличествоОчков);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сформировать(Команда=Неопределено)
	Если ПроверитьЗаполнение() Тогда
		СформироватьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	Сформировать();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Сформировать();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЧемпионатыЗагрузить();
КонецПроцедуры

&НаСервере
Процедура ЧемпионатыЗагрузить()
	Чемпионаты.ЗагрузитьЗначения(СерверныйФункции.ЧемпионатыТекущие(Истина));
КонецПроцедуры
