
&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Города") Тогда
		Объект.Город = Объект.Владелец;
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
		Объект.Город = Объект.Владелец.Город;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент=Неопределено)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если Объект.Ссылка.Пустая() Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Стадионы.Ссылка КАК Ссылка
		                      |ИЗ
		                      |	Справочник.Стадионы КАК Стадионы
		                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		                      |		ПО Стадионы.Город = Города.Ссылка
		                      |ГДЕ
		                      |	Стадионы.Город = &Город
		                      |	И (Стадионы.Наименование = &Наименование
		                      |			ИЛИ Стадионы.Комментарий ПОДОБНО &Комментарий)");
		Запрос.УстановитьПараметр("Наименование",		Объект.Наименование);
		Запрос.УстановитьПараметр("Комментарий",		"%" + СокрЛП(Объект.Наименование) + "%");
		Запрос.УстановитьПараметр("Город",				Объект.Город);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ОбщегоНазначения.СообщитьОбОшибке("Уже есть стадион с таким названием", Отказ, Объект.Ссылка, "Наименование");
		Иначе	//Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
			Запрос.Текст = "ВЫБРАТЬ
			               |	Стадионы.Ссылка КАК Ссылка
			               |ИЗ
			               |	Справочник.Стадионы КАК Стадионы
			               |ГДЕ
			               |	Стадионы.Владелец = &Владелец";
			Запрос.УстановитьПараметр("Владелец",			Объект.Владелец);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				Если ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Команды") Тогда
					ОбщегоНазначения.СообщитьОбОшибке("У команды уже есть один стадион", Отказ, Объект.Ссылка, "Владелец");
				Иначе
					ОбщегоНазначения.СообщитьОбОшибке("У города уже есть один стадион",, Объект.Ссылка, "Владелец");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ВидимостьДоступностьУстановить();
КонецПроцедуры

&НаСервере
Процедура ВидимостьДоступностьУстановить()
	Если ЕстьИстория(Объект.Ссылка) Тогда
		Элементы.Владелец.ТолькоПросмотр			= Истина;
		Элементы.Город.ТолькоПросмотр				= Истина;
	ИначеЕсли ТипЗнч(Объект.Владелец) = Тип("СправочникСсылка.Города") Тогда
		Элементы.Город.ТолькоПросмотр				= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕстьИстория(Ссылка)
	Возврат СерверныйФункции.ЕстьИстория(Ссылка);
КонецФункции
