
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.ВидыСпорта") Тогда
		Владелец	= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Города") Тогда
		Город		= ДанныеЗаполнения;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Владелец") Тогда
			ОбработкаЗаполнения(ДанныеЗаполнения.Владелец, ТекстЗаполнения, Ложь);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(Комментарий)
	И ЗначениеЗаполнено(Город)
	Тогда
		Комментарий	= НаименованиеСтрана();
	КонецЕсли;
КонецПроцедуры

Функция НаименованиеСтрана() Экспорт
	Возврат ?(ЗначениеЗаполнено(Город), СтрШаблон("%1 (%2)", СокрЛП(Наименование), Город.Владелец), "");
КонецФункции
