
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Чемпионат") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Чемпионат", Параметры.Чемпионат);
	ИначеЕсли Параметры.Свойство("ТекущаяСтрока") Тогда
		Список.Параметры.УстановитьЗначениеПараметра("Чемпионат", ЧемпионатПолучитьПоследнее(Параметры.ТекущаяСтрока));
	Иначе
		Список.Параметры.УстановитьЗначениеПараметра("Чемпионат", Справочники.Чемпионаты.ПустаяСсылка());
		Отказ	= Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЧемпионатПолучитьПоследнее(Клуб)
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее(Клуб);
КонецФункции
