
&НаСервере
Процедура ГрафикОбновитьНаСервере()
	График.Очистить();
	График.БазовоеЗначение	= 0;
	//График.ТипДиаграммы	= ?(ТипГрафика = 2, ТипДиаграммы.Гистограмма, ТипДиаграммы.График);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Стадион",		Отчет.Стадион);
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	_Мини	= 0;	_Макс	= 0;
	Если ЗначениеЗаполнено(Отчет.Стадион) Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Матч.Дата КАК Период,
		               |	СУММА(Матч.КоличествоЗрителей) КАК КоличествоЗрителей
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
		               |		ПО Матч.Стадион = Стадионы.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО Матч.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Матч.Стадион = &Стадион
		               |	И Матч.Проведен = ИСТИНА
		               |	И Матч.КоличествоЗрителей > 0
		               |	И Туры.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Матч.Дата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период";
		Серия	= График.УстановитьСерию(Отчет.Стадион);
		
		//Детали	= Запрос.Выполнить().Выбрать();
		//Пока Детали.Следующий() Цикл
		//	График.УстановитьЗначение(График.УстановитьТочку(Формат(Детали.Период, "ДФ=dd.MM")), Серия, Детали.КоличествоЗрителей);
		//	_Мини	= ?(_Мини = 0, Детали.КоличествоЗрителей, Мин(_Мини, Детали.КоличествоЗрителей));
		//	_Макс	= Макс(_Макс, Детали.КоличествоЗрителей);
		//КонецЦикла;
	//Иначе
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	Стадионы.Ссылка КАК Стадион,
	//	               |	Туры.ДатаНачала КАК Период,
	//	               |	СУММА(Матч.КоличествоЗрителей) КАК КоличествоЗрителей
	//	               |ИЗ
	//	               |	Справочник.Туры КАК Туры
	//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
	//	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Стадионы КАК Стадионы
	//	               |			ПО Матч.Стадион = Стадионы.Ссылка
	//	               |		ПО Туры.Ссылка = Матч.Тур
	//	               |ГДЕ
	//	               |	Матч.Проведен = ИСТИНА
	//	               |	И Матч.КоличествоЗрителей > 0
	//	               |	И Туры.Владелец = &Чемпионат
	//	               |
	//	               |СГРУППИРОВАТЬ ПО
	//	               |	Стадионы.Ссылка,
	//	               |	Туры.ДатаНачала
	//	               |
	//	               |УПОРЯДОЧИТЬ ПО
	//	               |	Стадион,
	//	               |	Период
	//	               |ИТОГИ
	//	               |	СУММА(КоличествоЗрителей)
	//	               |ПО
	//	               |	Стадион";
	//	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	//	Пока Выборка.Следующий() Цикл
	//		Серия	= График.УстановитьСерию(Выборка.Стадион);
	//		
	//		Детали	= Выборка.Выбрать();
	//		Пока Детали.Следующий() Цикл
	//			График.УстановитьЗначение(График.УстановитьТочку(Формат(Детали.Период, "ДФ=dd.MM")), Серия, Детали.КоличествоЗрителей, Выборка.Стадион);
	//			_Мини	= ?(_Мини = 0, Детали.КоличествоЗрителей, Мин(_Мини, Детали.КоличествоЗрителей));
	//			_Макс	= Макс(_Макс, Детали.КоличествоЗрителей);
	//		КонецЦикла;
	//	КонецЦикла;
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	Матч.Дата КАК Период,
		               |	СУММА(Матч.КоличествоЗрителей) КАК КоличествоЗрителей
		               |ИЗ
		               |	Документ.Матч КАК Матч
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		               |		ПО Матч.Тур = Туры.Ссылка
		               |ГДЕ
		               |	Матч.Проведен = ИСТИНА
		               |	И Матч.КоличествоЗрителей > 0
		               |	И Туры.Владелец = &Чемпионат
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	Матч.Дата
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Период";
		Серия	= График.УстановитьСерию(Отчет.Чемпионат);
	КонецЕсли;
	Детали	= Запрос.Выполнить().Выбрать();
	Пока Детали.Следующий() Цикл
		График.УстановитьЗначение(График.УстановитьТочку(Формат(Детали.Период, "ДФ=dd.MM")), Серия, Детали.КоличествоЗрителей);
		_Мини	= ?(_Мини = 0, Детали.КоличествоЗрителей, Мин(_Мини, Детали.КоличествоЗрителей));
		_Макс	= Макс(_Макс, Детали.КоличествоЗрителей);
	КонецЦикла;
	График.БазовоеЗначение	= Макс(0, _Мини - Цел(0.1 * (_Макс - _Мини)));
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Чемпионат") Тогда
		ЭтаФорма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		Отчет.Чемпионат	= Параметры.Чемпионат;
	
	ИначеЕсли Параметры.Свойство("Стадион") Тогда
		ЭтаФорма.АвтоматическоеСохранениеДанныхВНастройках = АвтоматическоеСохранениеДанныхФормыВНастройках.НеИспользовать;
		Отчет.Стадион	= Параметры.Стадион;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
		Отчет.Чемпионат = СерверныйФункции.ЧемпионатПолучитьПоследнее(Отчет.Стадион);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГрафикОбновитьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ПустаяСтрока(Отчет.Стадион)
	И ТипЗнч(ЗначениеДиаграммы.Значение) = Тип("СправочникСсылка.Стадионы")
	Тогда
		Отчет.Стадион	= ЗначениеДиаграммы.Значение;
		ГрафикОбновитьНаСервере();
	КонецЕсли;
КонецПроцедуры
