
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Чемпионат", ПараметрКоманды);
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Лига") Тогда
		ПараметрыФормы.Чемпионат = Чемпионат(ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		ПараметрыФормы.Вставить("Команда", ПараметрКоманды);
		ПараметрыФормы.Чемпионат = Чемпионат(ПараметрКоманды);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыФормы.Чемпионат) Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Гражданство.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Чемпионат(Параметр)
	Возврат СерверныйФункции.ЧемпионатЛигиПоследний(Параметр);
КонецФункции
