
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура("Лига", ПараметрКоманды);
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Лига") Тогда
		ПараметрыФормы.Лига = ПараметрКоманды;
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") Тогда
		ПараметрыФормы.Лига = Лига(ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		ПараметрыФормы.Вставить("Команда", ПараметрКоманды);
		ПараметрыФормы.Лига = Лига(ПараметрКоманды);
	КонецЕсли;
	Если ЗначениеЗаполнено(ПараметрыФормы.Лига) Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Гражданство.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция Лига(ПараметрКоманды)
	Возврат ?(ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты"), ПараметрКоманды.Владелец, СерверныйФункции.ЛигаКоманды(ПараметрКоманды));
КонецФункции
