
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыФормы = Новый Структура;
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		ПараметрыФормы.Вставить("Команда", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Лига") Тогда
		ПараметрыФормы.Вставить("Лига", ПараметрКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") Тогда
		ПараметрыФормы.Вставить("Лига", Лига(ПараметрКоманды));
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Гражданство.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция Лига(ПараметрКоманды)
	Возврат ПараметрКоманды.Владелец;
КонецФункции
