
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Параметр = Новый Структура("Чемпионат", ПараметрКоманды);
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Команды") Тогда
		Параметр.Чемпионат = ЧемпионатПолучитьПоследнее(ПараметрКоманды);
	КонецЕсли;
	НаКлиенте.ОбработкаКомандыОткрытьФорму("Отчет.Хронология.Форма", Параметр, ПараметрыВыполненияКоманды);
КонецПроцедуры

&НаСервере
Функция ЧемпионатПолучитьПоследнее(Команда)
	Возврат СерверныйФункции.ЧемпионатПолучитьПоследнее(Команда);
КонецФункции
