
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Если НЕ Данные.ПометкаУдаления Тогда
		СтандартнаяОбработка = Ложь;
		Представление = СтрШаблон(Данные.Наименование + " %1", Данные.Владелец);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
    Поля.Добавить("ПометкаУдаления");
    Поля.Добавить("Наименование");
    Поля.Добавить("Владелец");
КонецПроцедуры

Функция ТурНайти(Код, Чемпионат)
	Возврат СерверныйФункции.ТурНайти(Код, Чемпионат);
КонецФункции

Функция Заполнить(Чемпионат) Экспорт
	Если НЕ ЗначениеЗаполнено(Чемпионат) Тогда
		Возврат Ложь;
	ИначеЕсли Чемпионат.Владелец.ОлимпийскаяСистема Тогда
		Возврат Ложь;
	КонецЕсли;
	оТур	= Неопределено;
	Для Итератор = 1 По Чемпионат.Команды.Количество() * 2 - 2 Цикл
		Тур		= ТурНайти(Итератор, Чемпионат);
		Если НЕ ЗначениеЗаполнено(Тур) Тогда
			оТур	= Справочники.Туры.СоздатьЭлемент();
			ЗаполнитьЗначенияСвойств(оТур, Новый Структура("Владелец,ДатаНачала,ДатаОкончания", Чемпионат, Чемпионат.ДатаНачала, Чемпионат.ДатаОкончания));
			оТур.Код			= Итератор;
			оТур.Наименование	= оТур.НаименованиеПолучить();
			оТур.Записать();
		КонецЕсли;
	КонецЦикла;
	Возврат (оТур <> Неопределено);
КонецФункции
