
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала >= ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Владелец = ДанныеЗаполнения;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Туры.Код КАК Код,
		                      |	Туры.ДатаНачала КАК ДатаНачала,
		                      |	Туры.ДатаОкончания КАК ДатаОкончания
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |ГДЕ
		                      |	Туры.Владелец = &Владелец
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ДатаОкончания УБЫВ");
		Запрос.УстановитьПараметр("Владелец", ДанныеЗаполнения);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Код < ДанныеЗаполнения.Команды.Количество() - 2 Тогда
				Код				= Выборка.Код + 1;
				ДатаНачала		= Выборка.ДатаНачала + 7 * 86400;
				ДатаОкончания	= Выборка.ДатаОкончания + 7 * 86400;
			КонецЕсли;
			
		Иначе
			Код	= 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
