
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала > ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	Иначе
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Команда) КАК Количество
		                      |ИЗ
		                      |	Справочник.Чемпионаты.Команды КАК Команды
		                      |ГДЕ
		                      |	Команды.Ссылка = &Владелец");
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.Количество * 2 - 2 < Код Тогда
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Владелец = ДанныеЗаполнения;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Туры.Код КАК Код,
		                      |	Туры.ДатаНачала КАК ДатаНачала,
		                      |	Туры.ДатаОкончания КАК ДатаОкончания
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |ГДЕ
		                      |	Туры.Владелец = &Владелец
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ДатаОкончания УБЫВ");
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Код < Владелец.Команды.Количество() * 2 - 2 Тогда
				Код				= Выборка.Код + 1;
				ДатаНачала		= Выборка.ДатаНачала + Сутки(7);
				ДатаОкончания	= Выборка.ДатаОкончания + Сутки(7);
			КонецЕсли;
			
		Иначе
			Код	= 1;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Туры") Тогда
		Владелец = ДанныеЗаполнения.Владелец;
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		                      |	Туры.Код КАК Код,
		                      |	Туры.ДатаНачала КАК ДатаНачала,
		                      |	Туры.ДатаОкончания КАК ДатаОкончания
		                      |ИЗ
		                      |	Справочник.Туры КАК Туры
		                      |ГДЕ
		                      |	Туры.Владелец = &Владелец
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ДатаОкончания УБЫВ");
		Запрос.УстановитьПараметр("Владелец", Владелец);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Если Выборка.Код < Владелец.Команды.Количество() * 2 - 2 Тогда
				Код				= Выборка.Код + 1;
				ДатаНачала		= Выборка.ДатаНачала + Сутки(7);
				ДатаОкончания	= Выборка.ДатаОкончания + Сутки(7);
			КонецЕсли;
			
		Иначе
			Код	= 1;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Код				= 0;
	Наименование	= "";
	ДатаНачала		= Дата(1,1,1);
	ДатаОкончания	= Дата(1,1,1);
	Комментарий		= "";
КонецПроцедуры
