
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ДатаНачала > ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаНачала > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания < Владелец.ДатаНачала Тогда
		Отказ = Истина;
	ИначеЕсли ДатаОкончания > Владелец.ДатаОкончания Тогда
		Отказ = Истина;
	//ИначеЕсли ОлимпийскаяСистема Тогда
	//	//
	//Иначе
	//	Запрос = Новый Запрос("ВЫБРАТЬ
	//	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Команды.Команда) КАК Количество
	//	                      |ИЗ
	//	                      |	Справочник.Чемпионаты.Команды КАК Команды
	//	                      |ГДЕ
	//	                      |	Команды.Ссылка = &Владелец");
	//	Запрос.УстановитьПараметр("Владелец", Владелец);
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() И Справочники.Туры.КоличествоМакс(Выборка.Количество) < Код Тогда
	//		Отказ = Истина;
	//	КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Чемпионаты") Тогда
		Владелец			= ДанныеЗаполнения;
		ОлимпийскаяСистема	= ДанныеЗаполнения.Владелец.ОлимпийскаяСистема;
		
		ТурПоследний = ТурПоследний();
		Если ТурПоследний.Код = 0 Тогда
			Код	= 1;
			Наименование	= НаименованиеПолучить();
			ДатаНачала		= ДанныеЗаполнения.ДатаНачала;
			ДатаОкончания	= ДанныеЗаполнения.ДатаОкончания;
		Иначе
			Если ОлимпийскаяСистема Тогда
				УстановитьНовыйКод(ТурПоследний.Код + 1);
			ИначеЕсли ТурПоследний.Код < Справочники.Туры.КоличествоМакс(Владелец.Команды.Количество()) Тогда
				УстановитьНовыйКод(ТурПоследний.Код + 1);
			КонецЕсли;
			Наименование	= НаименованиеПолучить();
			ДатаНачала		= Мин(ДанныеЗаполнения.ДатаОкончания, ДатаНачала(ТурПоследний.ДатаОкончания));
			ДатаОкончания	= Мин(ДанныеЗаполнения.ДатаОкончания, ДатаНачала + Сутки());
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Туры") Тогда
		ОбработкаЗаполнения(ДанныеЗаполнения.Владелец, ТекстЗаполнения, Ложь);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
		Если ЗначениеЗаполнено(Владелец) Тогда
			ОлимпийскаяСистема	= Владелец.Владелец.ОлимпийскаяСистема;
		КонецЕсли;
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатаНачала) Тогда
		ТурПоследний	= ТурПоследний();
		Если ТурПоследний.Код = 0 Тогда
			ДатаНачала		= ТурПоследний.ДатаНачала;
			ДатаОкончания	= ТурПоследний.ДатаОкончания;
		Иначе
			ДатаНачала		= ДатаНачала(ТурПоследний.ДатаОкончания);
			ДатаОкончания	= ДатаНачала + Сутки();
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ДатаНачала(Знач Дата)
	Дата	= Дата + Сутки();
	Пока ДеньНедели(Дата) <> 6 Цикл
		Дата	= Дата + Сутки();
	КонецЦикла;
	Возврат Дата;
КонецФункции

Процедура ПриКопировании(ОбъектКопирования)
	Код				= КодНовыйПолучить();
	Наименование	= "";
	Комментарий		= "";
	ДатаНачала		= Владелец.ДатаНачала;
	ДатаОкончания	= Владелец.ДатаОкончания;
	
	Заполнить(ОбъектКопирования.Владелец);
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Новый Структура("Код", Префикс));
КонецПроцедуры

Функция КодНовыйПолучить() Экспорт
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		Владелец = СерверныйФункции.ЧемпионатЛигиПоследний(Владелец.Владелец);
	КонецЕсли;
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(МАКСИМУМ(Туры.Код), 0) КАК Код
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ");
	Запрос.УстановитьПараметр("Чемпионат",						Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(), Выборка.Код + 1, 1);
КонецФункции

Функция НаименованиеПолучить() Экспорт
	Если НЕ ОлимпийскаяСистема Тогда
		Возврат СтрШаблон("%1-й тур", Макс(1, Код));
	КонецЕсли;
	
	Ответ = "Финал";
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Туры.Код + 1 КАК Код,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТурнирнаяТаблица.Команда) / 2 КАК Количество
	                      |ИЗ
	                      |	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
	                      |		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
	                      |ГДЕ
	                      |	Туры.Владелец = &Чемпионат
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	Туры.Код
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	1,
	                      |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЧемпионатыКоманды.Команда) / 2
	                      |ИЗ
	                      |	Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
	                      |ГДЕ
	                      |	ЧемпионатыКоманды.Ссылка = &Чемпионат
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Код УБЫВ");
	Запрос.УстановитьПараметр("Чемпионат",			Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Код = 1 И Выборка.Количество > 16 Тогда
			Ответ = СтрШаблон("%1-й раунд", Выборка.Код);
		ИначеЕсли Выборка.Код = 1 И Выборка.Количество = 1 Тогда
			//
		ИначеЕсли Выборка.Код = 1 Тогда
			Ответ = СтрШаблон("1/%1 финала", Выборка.Количество);
		ИначеЕсли Выборка.Количество > 16 Тогда
			Ответ = СтрШаблон("%1-й раунд", Выборка.Код);
		ИначеЕсли Выборка.Количество > 4 Тогда
			Ответ = СтрШаблон("1/%1 финала", Окр(Выборка.Количество / 2));
		ИначеЕсли Выборка.Количество = 4 Тогда
			Ответ = "Полуфиналы";
		КонецЕсли;
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Функция ТурПоследний()
	Ответ = Новый Структура("Код,ДатаНачала,ДатаОкончания,Финал", 0, Владелец.ДатаНачала, Владелец.ДатаОкончания, Ложь);
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                      |	Туры.Код КАК Код,
	                      |	Туры.ДатаНачала КАК ДатаНачала,
	                      |	Туры.ДатаОкончания КАК ДатаОкончания,
	                      |	Туры.Ссылка КАК Финал
	                      |ИЗ
	                      |	Справочник.Туры КАК Туры
	                      |ГДЕ
	                      |	Туры.Владелец = &Владелец
	                      |	И Туры.ПометкаУдаления = ЛОЖЬ
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ДатаОкончания УБЫВ,
	                      |	Код УБЫВ");
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Ответ, Выборка);
	КонецЕсли;
	Возврат Ответ;
КонецФункции

Процедура ДатыУстановить(Объект) Экспорт
	Если Объект.Ссылка.Пустая() Тогда
		ОбщегоНазначения.УстановитьЗначение(Объект.ДатаНачала, Объект.Владелец.ДатаНачала);
		ОбщегоНазначения.УстановитьЗначение(Объект.ДатаОкончания, Объект.Владелец.ДатаОкончания);
	Иначе
		Запрос	= Новый Запрос("ВЫБРАТЬ
		      	               |	МИНИМУМ(Матч.Проведен) КАК Проведен,
		      	               |	МИНИМУМ(Матч.Дата) КАК ДатаНачала,
		      	               |	МАКСИМУМ(Матч.Дата) КАК ДатаОкончания
		      	               |ИЗ
		      	               |	Документ.Матч КАК Матч
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
		      	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты.Команды КАК ЧемпионатыКоманды
		      	               |			ПО Туры.Владелец = ЧемпионатыКоманды.Ссылка
		      	               |		ПО Матч.Тур = Туры.Ссылка
		      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч.Команды КАК МатчКоманды
		      	               |		ПО Матч.Ссылка = МатчКоманды.Ссылка
		      	               |ГДЕ
		      	               |	Матч.Тур = &Тур
		      	               |	И Матч.ПометкаУдаления = ЛОЖЬ
		      	               |	И МатчКоманды.Команда = ЧемпионатыКоманды.Команда
		      	               |	И МатчКоманды.НомерСтроки = 2");
		Запрос.УстановитьПараметр("Тур",			Объект.Ссылка);
		Выборка	= Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() И Выборка.Проведен И ЗначениеЗаполнено(Выборка.ДатаНачала) Тогда
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаНачала, Выборка.ДатаНачала);
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаОкончания, Выборка.ДатаОкончания);
		Иначе
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаНачала, Объект.Владелец.ДатаНачала);
			ОбщегоНазначения.УстановитьЗначение(Объект.ДатаОкончания, Объект.Владелец.ДатаОкончания);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
