
&НаКлиенте
Процедура ФотоПолучить() Экспорт
	ТекущиеДанные	= Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Изображение	= "";
		ТекущийКлуб = Неопределено;
	ИначеЕсли ТекущийКлуб = ТекущиеДанные.Ссылка Тогда
		Если Кеш.НайтиПоЗначению(ТекущийКлуб) = Неопределено Тогда
			ФотоПолучитьНаСервере();
		КонецЕсли;
	Иначе
		ТекущийКлуб = ТекущиеДанные.Ссылка;
		ФотоПолучитьНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ФотоПолучитьНаСервере()
	Элемент	= Кеш.НайтиПоЗначению(ТекущийКлуб);
	Если Элемент = Неопределено Тогда
		Изображение	= СерверныйФункции.ИзображениеПолучить(ТекущийКлуб);
		Кеш.Добавить(ТекущийКлуб, Изображение);
	Иначе
		Изображение	= Элемент.Представление;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ПодключитьОбработчикОжидания("ФотоПолучить", 0.1, Истина);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Команды") Тогда
		Виктим = Кеш.НайтиПоЗначению(Параметр);
		Если Виктим <> Неопределено Тогда
			Кеш.Удалить(Виктим);
		КонецЕсли;
		Если ТекущийКлуб = Параметр Тогда
			ФотоПолучить();
			Элементы.Изображение.Обновить();
		КонецЕсли;
		Элементы.Список.Обновить();
	КонецЕсли;
КонецПроцедуры
