
Функция ОтчетСформировать(Отчет) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	Отчет.Данные.Очистить();
	
	Макет  = ПолучитьОбщийМакет("ТурнирнаяТаблица");
	//ТабДокумент.Вывести(СерверныйФункции.ЗаголовокПолучить(Новый Структура("Лига,Чемпионат,ВыводитьЧемпионат", Отчет.КомандаИлиИгрок, Отчет.КомандаИлиИгрок, Истина)));
	//ТабДокумент.ФиксацияСверху = 3;
	
	Итератор	= 0;
	Список		= ДанныеПолучить(Отчет);
	Для Каждого Выборка Из Список Цикл
		ОбластьМакета = Макет.ПолучитьОбласть("Графика|Матч");
		ОбластьМакета.Параметры.Заполнить(Выборка);
		Если Выборка.ЕстьКартинка Тогда
			СерверныйФункции.КартинкаУстановить(ОбластьМакета, Выборка.Ссылка);
		КонецЕсли;
		Если Итератор = 0 Тогда
			ТабДокумент.Вывести(ОбластьМакета);
		Иначе
			ТабДокумент.Присоединить(ОбластьМакета);
		КонецЕсли;
		
		Итератор	= Итератор + 1;
		Если Итератор < 6 Тогда
			ТабДокумент.Присоединить(Макет.ПолучитьОбласть("Графика|Пусто"));
		Иначе
			ТабДокумент.Вывести(Макет.ПолучитьОбласть("Пробел"));
			Итератор = 0;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ДанныеПолучить(Отчет)
	Ответ	= Новый Массив;
	
	Отчет.Данные.Очистить();
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Чемпионаты.Ссылка КАК Чемпионат,
	      	               |	Чемпионаты.Владелец КАК Ссылка,
	      	               |	Чемпионаты.Владелец.Код КАК Код,
	      	               |	Чемпионаты.Владелец.Наименование КАК Наименование,
	      	               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
	      	               |	1 КАК Количество,
	      	               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
	      	               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
	      	               |	ГОД(Чемпионаты.ДатаОкончания) КАК Период,
	      	               |	Итоги.КоличествоОчков КАК КоличествоОчков,
	      	               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
	      	               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
	      	               |ИЗ
	      	               |	РегистрСведений.Итоги КАК Итоги
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
	      	               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
	      	               |ГДЕ
	      	               |	Итоги.Команда = &Ссылка
	      	               |	И Итоги.Место = 1
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	ЕстьКартинка УБЫВ,
	      	               |	Период УБЫВ
	      	               |ИТОГИ
	      	               |	МАКСИМУМ(Код),
	      	               |	МАКСИМУМ(Наименование),
	      	               |	МАКСИМУМ(ОлимпийскаяСистема),
	      	               |	СУММА(Количество),
	      	               |	МАКСИМУМ(ЕстьКартинка),
	      	               |	МАКСИМУМ(Представление),
	      	               |	МАКСИМУМ(Период)
	      	               |ПО
	      	               |	Ссылка");
	Если ТипЗнч(Отчет.КомандаИлиИгрок) = Тип("СправочникСсылка.Игроки") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	Чемпионаты.Ссылка КАК Чемпионат,
		               |	Чемпионаты.Владелец КАК Ссылка,
		               |	Чемпионаты.Владелец.Код КАК Код,
		               |	Чемпионаты.Владелец.Наименование КАК Наименование,
		               |	Чемпионаты.Владелец.ОлимпийскаяСистема КАК ОлимпийскаяСистема,
		               |	Итоги.Команда КАК Команда,
		               |	1 КАК Количество,
		               |	РАЗМЕРХРАНИМЫХДАННЫХ(Чемпионаты.Владелец.Изображение) >= 64 КАК ЕстьКартинка,
		               |	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Чемпионаты.Владелец) КАК Представление,
		               |	ГОД(Чемпионаты.ДатаОкончания) КАК Период,
		               |	Итоги.КоличествоОчков КАК КоличествоОчков,
		               |	Итоги.КоличествоЗабито КАК КоличествоЗабито,
		               |	Итоги.КоличествоПропущено КАК КоличествоПропущено
		               |ИЗ
		               |	РегистрСведений.Итоги КАК Итоги
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Чемпионаты КАК Чемпионаты
		               |		ПО Итоги.Чемпионат = Чемпионаты.Ссылка
		               |ГДЕ
		               |	(Итоги.Чемпионат, Итоги.Команда) В
		               |			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |				МатчСоставыКоманд.Ссылка.Тур.Владелец,
		               |				МатчСоставыКоманд.Команда
		               |			ИЗ
		               |				Документ.Матч.СоставыКоманд КАК МатчСоставыКоманд
		               |			ГДЕ
		               |				МатчСоставыКоманд.Игрок = &Ссылка)
		               |	И Итоги.Место = 1
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ЕстьКартинка УБЫВ,
		               |	Период УБЫВ
		               |ИТОГИ
		               |	МАКСИМУМ(Код),
		               |	МАКСИМУМ(Наименование),
		               |	МАКСИМУМ(ОлимпийскаяСистема),
		               |	СУММА(Количество),
		               |	МАКСИМУМ(ЕстьКартинка),
		               |	МАКСИМУМ(Представление),
		               |	МАКСИМУМ(Период)
		               |ПО
		               |	Ссылка";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",				Отчет.КомандаИлиИгрок);
	Выборка	= Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока Выборка.Следующий() Цикл
		Если Выборка.Количество > 0 Тогда
			Элемент = Новый Структура("Ссылка,Код,Наименование,Количество,ЕстьКартинка,Представление");
			ЗаполнитьЗначенияСвойств(Элемент, Выборка);
			Если Выборка.ЕстьКартинка Тогда
				Элемент.Представление	= СерверныйФункции.ИзображениеПолучить(Выборка.Ссылка);
			КонецЕсли;
			Ответ.Добавить(Элемент);
		КонецЕсли;
		Выбор = Выборка.Выбрать();
		Пока Выбор.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Выбор);
		КонецЦикла;
	КонецЦикла;
	Возврат Ответ;
КонецФункции
