
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Туры") Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Документ.Матч.ФормаСписка", Новый Структура("Отбор", Новый Структура("Тур", ПараметрКоманды)), ПараметрыВыполненияКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Чемпионаты") Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Документ.Матч.ФормаСписка", Новый Структура("Отбор", Новый Структура("Тур", ТурыЧемпионата(ПараметрКоманды))), ПараметрыВыполненияКоманды);
	ИначеЕсли ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Стадионы") Тогда
		НаКлиенте.ОбработкаКомандыОткрытьФорму("Документ.Матч.ФормаСписка", Новый Структура("Отбор", Новый Структура("Стадион", ПараметрКоманды)), ПараметрыВыполненияКоманды);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТурыЧемпионата(Чемпионат)
	Возврат СерверныйФункции.ТурыЧемпионата(Чемпионат);
КонецФункции
