
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Если ТипЗнч(ПараметрКоманды) = Тип("СправочникСсылка.Туры") Тогда
		ОткрытьФорму("Документ.Матч.ФормаСписка", Новый Структура("Отбор", Новый Структура("Тур,ПометкаУдаления", ПараметрКоманды, Ложь)), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	Иначе
		ОткрытьФорму("Документ.Матч.ФормаСписка", Новый Структура("Отбор", Новый Структура("Тур,ПометкаУдаления", ТурыЧемпионата(ПараметрКоманды), Ложь)), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТурыЧемпионата(Чемпионат)
	Возврат СерверныйФункции.ТурыЧемпионата(Чемпионат);
КонецФункции
