
Функция ОтчетСформировать(Знач Чемпионат, ПоказыватьРазницуМячей=Ложь) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	
	Выборка = СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	
	Макет  = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Чемпионат	= Чемпионат;
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка"));
	
	НаВылет		= Выборка.Количество() - Чемпионат.Владелец.КоличествоРотация;
	НомерСтроки	= 0;
	Пятерка		= 0;
	Пока Выборка.Следующий() Цикл
		НомерСтроки	= НомерСтроки + 1;
		
		Если НомерСтроки > 5 Тогда
			Если НомерСтроки > НаВылет Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
				
			ИначеЕсли Пятерка = Выборка.КоличествоОчков Тогда
				ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
				ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
				
			Иначе
				ОбластьМакета = Макет.ПолучитьОбласть("Детали");
			КонецЕсли;
			
		Иначе
			ОбластьМакета = Макет.ПолучитьОбласть("Пятерка");
			ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
			
			Пятерка = Выборка.КоличествоОчков;
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Место	= НомерСтроки;
		Если НЕ ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.Разница	= Строка(Выборка.Забито) + "-" + Строка(Выборка.Пропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции
