
Функция ОтчетСформировать(Знач Чемпионат, ПоказыватьРазницуМячей=Ложь) Экспорт
	ТабДокумент = Новый ТабличныйДокумент;
	
	Выборка = СерверныйФункции.ТурнирнаяТаблица(Чемпионат);
	
	Макет  = ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ОбластьМакета.Параметры.Чемпионат	= Чемпионат;
	ТабДокумент.Вывести(ОбластьМакета);
	ТабДокумент.Вывести(Макет.ПолучитьОбласть("Шапка|Основа"));
	
	НаВылет		= Выборка.Количество() - Чемпионат.Владелец.КоличествоРотация;
	НомерСтроки	= 0;
	Пятерка		= 0;
	Пока Выборка.Следующий() Цикл
		НомерСтроки	= НомерСтроки + 1;
		
		Если НомерСтроки > 5 Тогда
			Если НомерСтроки > НаВылет Тогда
				ОбластьМакета = ПолучитьОбласть(Макет, 5);
				
			ИначеЕсли Пятерка = Выборка.КоличествоОчков Тогда
				ОбластьМакета = ПолучитьОбласть(Макет, 5);
				ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
				
			Иначе
				ОбластьМакета = ПолучитьОбласть(Макет);
			КонецЕсли;
			
		Иначе
			ОбластьМакета = ПолучитьОбласть(Макет, 5);
			ТабДокумент.ФиксацияСверху = 3 + НомерСтроки;
			
			Пятерка = Выборка.КоличествоОчков;
		КонецЕсли;
		ОбластьМакета.Параметры.Заполнить(Выборка);
		ОбластьМакета.Параметры.Место	= НомерСтроки;
		Если НЕ ПоказыватьРазницуМячей Тогда
			ОбластьМакета.Параметры.Разница	= Строка(Выборка.Забито) + "-" + Строка(Выборка.Пропущено);
		КонецЕсли;
		ТабДокумент.Вывести(ОбластьМакета);
		//
		//ОбластьМакета = Макет.ПолучитьОбласть("Цвет");
		//ОбластьМакета.ТекущаяОбласть.ЦветФона = WebЦвета.ЗеленоватоЛимонный;
		//ТабДокумент.Присоединить(ОбластьМакета);
	КонецЦикла;
	
	Возврат ТабДокумент;
КонецФункции

Функция ПолучитьОбласть(Макет, Параметр=0)
	Если Параметр = 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("Детали|Основа");
	Иначе
		ОбластьМакета = Макет.ПолучитьОбласть("Пятерка|Основа");
	КонецЕсли;
	Возврат ОбластьМакета;
КонецФункции
