
Процедура ПередЗаписью(Отказ)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Страны.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.Страны КАК Страны
	                      |ГДЕ
	                      |	Страны.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование",	Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.Ссылка <> Ссылка Тогда
			ОбщегоНазначения.СообщитьОбОшибке(СтрШаблон("Есть такая страна (%1)", Выборка.Ссылка), Отказ);
		КонецЕсли;
	КонецЦикла;
	
	Если Отказ Тогда
		//
	ИначеЕсли ПустаяСтрока(Код) Тогда
		Код	= ВРег(Код);
	КонецЕсли;
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Код	= "";
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры
