
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	Попытка
		ПерейтиПоНавигационнойСсылке(СсылкаСформировать(ПараметрКоманды));
	Исключение
		Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецПроцедуры

&НаСервере
Функция СсылкаСформировать(Ссылка)
	ХашХаш = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
	Если НЕ ПустаяСтрока(ХашХаш) Тогда
		Возврат ХашХаш;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Матч") Тогда
		Возврат СтрШаблон("https://yandex.ru/search/?text=%1 %2", КодироватьСтроку(Ссылка.Счет, СпособКодированияСтроки.КодировкаURL), Формат(Ссылка.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	ХашХаш = СокрЛП(Ссылка.Наименование);
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		Если СтрНайти(ХашХаш, " ") > 0 Тогда
			//
		ИначеЕсли СерверныйФункции.СтранаКоманды(Ссылка) = Англия() Тогда
			Если СтрНайти(ХашХаш, " F.C.") = 0 Тогда
				ХашХаш = ХашХаш + " F.C.";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы")
	И СтрНайти(ХашХаш, "стадион") = 0
	Тогда
		ХашХаш = ХашХаш + " стадион";
		
	КонецЕсли;
	Возврат "https://ru.wikipedia.org/wiki/" + ХашХаш;
КонецФункции

&НаСервере
Функция Англия()
	Возврат СерверныйФункции.СтранаНайти("eng");
КонецФункции
