
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НаКлиенте.ПоНавигационнойСсылкеПерейти(СсылкаСформировать(ПараметрКоманды));
КонецПроцедуры

&НаСервере
Функция СсылкаСформировать(Ссылка)
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Страны") Тогда
		Возврат Вики() + Ссылка.Наименование;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Города") Тогда
		Возврат СтрШаблон("%1%2,%3", Вики(), Ссылка.Наименование, Ссылка.Владелец);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Лига") Тогда
		УРЛ = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
		Возврат ?(ПустаяСтрока(УРЛ), СтрШаблон("%1%2,%3", Вики(), Ссылка.Наименование, Ссылка.Страна), УРЛ);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Чемпионаты") Тогда
		УРЛ = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
		Возврат ?(ПустаяСтрока(УРЛ), СтрШаблон("%1%2,%3", Вики(), Ссылка.Наименование, Ссылка.Владелец.Страна), УРЛ);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Игроки") Тогда
		УРЛ = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
		Возврат ?(ПустаяСтрока(УРЛ), СтрШаблон("%1%2,%3", Я(), Кодировать(?(ПустаяСтрока(СтрПолучитьСтроку(Ссылка.Комментарий, 1)), Ссылка.Наименование, СтрПолучитьСтроку(Ссылка.Комментарий, 1))), Кодировать(Ссылка.Страна)), УРЛ);
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		УРЛ = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий, Истина);
		Если ПустаяСтрока(УРЛ) Тогда
			//
		ИначеЕсли СтрНайти(УРЛ, "%1") > 0 Тогда
			Возврат СтрЗаменить(УРЛ, "%1", ТекущийГод(Ссылка));
		Иначе
			Возврат УРЛ;
		КонецЕсли;
	КонецЕсли;
	ХашХаш = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
	Если НЕ ПустаяСтрока(ХашХаш) Тогда
		Возврат ХашХаш;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Матч") Тогда
		Возврат СтрШаблон("%1%2%3", Я(), Кодировать(Ссылка.Счет), Формат(Ссылка.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	ХашХаш = СтрЗаменить(СокрЛП(Ссылка.Наименование), " ", "_");
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		Если СерверныйФункции.СтранаКоманды(Ссылка) = Англия()
		И СтрНайти(ХашХаш, "F.C.") > 0
		Тогда
			//
		Иначе
			ХашХаш = СтрШаблон("%1 клуб, %2", ХашХаш, Ссылка.Город);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы")
	И СтрНайти(ХашХаш, "стадион") = 0
	Тогда
		ХашХаш = СтрШаблон("%1 стадион, %2", ХашХаш, Ссылка.Владелец);
		
	КонецЕсли;
	Возврат Вики() + ХашХаш;
КонецФункции

&НаСервере
Функция Англия()
	Возврат СерверныйФункции.СтранаНайти("eng");
КонецФункции

&НаСервере
Функция Вики()
	Возврат "https://ru.wikipedia.org/wiki/";
КонецФункции

&НаСервере
Функция Я()
	Возврат "https://yandex.ru/search/?text=";
КонецФункции

&НаСервере
Функция Кодировать(Слово)
	Возврат КодироватьСтроку(Слово, СпособКодированияСтроки.КодировкаURL);
КонецФункции

&НаСервере
Функция ТекущийГод(Ссылка)
	Возврат СерверныйФункции.ТекущийГод(Ссылка);
КонецФункции
