
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПерейтиПоНавигационнойСсылке(СсылкаСформировать(ПараметрКоманды));
КонецПроцедуры

&НаСервере
Функция СсылкаСформировать(Ссылка)
	ХашХаш = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
	Если НЕ ПустаяСтрока(ХашХаш) Тогда
		Возврат ХашХаш;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Матч") Тогда
		Возврат СтрШаблон("https://yandex.ru/search/?text=%1 %2", КодироватьСтроку(Ссылка.Счет, СпособКодированияСтроки.КодировкаURL), Формат(Ссылка.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	ХашХаш = СокрЛП(Ссылка.Наименование);
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды")
	И СтрНайти(ХашХаш, " F.C.") = 0
	Тогда
		ХашХаш = ХашХаш + " F.C.";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы")
	И СтрНайти(ХашХаш, "стадион") = 0
	Тогда
		ХашХаш = ХашХаш + " стадион";
		
	КонецЕсли;
	Возврат "https://ru.wikipedia.org/wiki/" + ХашХаш;
КонецФункции
