
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НаКлиенте.ПоНавигационнойСсылкеПерейти(СсылкаСформировать(ПараметрКоманды));
КонецПроцедуры

&НаСервере
Функция СсылкаСформировать(Ссылка)
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Страны") Тогда
		Возврат Вики() + Ссылка.Наименование;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Города") Тогда
		Возврат Вики() + Ссылка.Наименование;
	КонецЕсли;
	ХашХаш = СерверныйФункции.КомментарийКакУРЛ(Ссылка.Комментарий);
	Если НЕ ПустаяСтрока(ХашХаш) Тогда
		Возврат ХашХаш;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.Матч") Тогда
		Возврат СтрШаблон("https://yandex.ru/search/?text=%1 %2", КодироватьСтроку(Ссылка.Счет, СпособКодированияСтроки.КодировкаURL), Формат(Ссылка.Дата, "ДЛФ=DD"));
	КонецЕсли;
	
	ХашХаш = СтрЗаменить(СокрЛП(Ссылка.Наименование), " ", "_");
	Если ТипЗнч(Ссылка) = Тип("СправочникСсылка.Команды") Тогда
		Если СерверныйФункции.СтранаКоманды(Ссылка) = Англия() Тогда
			Если СтрНайти(ХашХаш, "F.C.") = 0 Тогда
				ХашХаш = ХашХаш + "_F.C.";
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Ссылка) = Тип("СправочникСсылка.Стадионы")
	И СтрНайти(ХашХаш, "стадион") = 0
	Тогда
		ХашХаш = ХашХаш + "_стадион";
		
	КонецЕсли;
	Возврат Вики() + ХашХаш;
КонецФункции

&НаСервере
Функция Англия()
	Возврат СерверныйФункции.СтранаНайти("eng");
КонецФункции

&НаСервере
Функция Вики()
	Возврат "https://ru.wikipedia.org/wiki/";
КонецФункции
