
&НаСервере
Процедура ДоступностьВидимостьУстановить()
	Элементы.ВидСпорта.Доступность	= (НЕ ЗначениеЗаполнено(Запись.Команда) И НЕ ЗначениеЗаполнено(Запись.Противник));
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	ВидСпортаУстановить();
	ГородаЗагрузить();
	Если Параметры.Ключ.Пустой() Тогда
		ДоступностьВидимостьУстановить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаПриИзмененииНаСервере()
	ГородаЗагрузить();
	ДоступностьВидимостьУстановить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистка(Элемент, СтандартнаяОбработка)
	КомандаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидСпортаУстановить()
	Если ЗначениеЗаполнено(Запись.Команда) Тогда
		ВидСпорта = Запись.Команда.Владелец;
	Иначе
		ВидСпорта = СерверныйФункции.Футбол();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГородаЗагрузить()
	Запрос	= Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
	      	               |	Города.Ссылка КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Города КАК Города
	      	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Команды КАК Команды
	      	               |		ПО Города.Ссылка = Команды.Город
	      	               |ГДЕ
	      	               |	Города.ПометкаУдаления = ЛОЖЬ
	      	               |	И Города.Владелец В
	      	               |			(ВЫБРАТЬ
	      	               |				Команды.Город.Владелец КАК ГородВладелец
	      	               |			ИЗ
	      	               |				Справочник.Команды КАК Команды
	      	               |			ГДЕ
	      	               |				Команды.Ссылка В (&Ссылка))");
	Ссылка	= Новый Массив;
	Если ЗначениеЗаполнено(Запись.Команда) Тогда
		Ссылка.Добавить(Запись.Команда);
	ИначеЕсли ЗначениеЗаполнено(Запись.Противник) Тогда
		Ссылка.Добавить(Запись.Противник);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |	Команды.Город КАК Ссылка
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |		ПО Команды.Город = Города.Ссылка
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Города.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДоступностьВидимостьУстановить();
КонецПроцедуры
