
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ.Пустой() Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры.ЗначенияЗаполнения);
	КонецЕсли;
	ВидСпортаУстановить();
	ГородаЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаПриИзменении(Элемент)
	ГородаЗагрузить();
КонецПроцедуры

&НаКлиенте
Процедура КомандаОчистка(Элемент, СтандартнаяОбработка)
	ГородаЗагрузить();
КонецПроцедуры

&НаСервере
Процедура ВидСпортаУстановить()
	Если ЗначениеЗаполнено(Запись.Противник) Тогда
		ВидСпорта = Запись.Противник.Владелец;
	ИначеЕсли ЗначениеЗаполнено(Запись.Команда) Тогда
		ВидСпорта = Запись.Команда.Владелец;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ГородаЗагрузить()
	Запрос	= Новый Запрос("ВЫБРАТЬ
	      	               |	Города.Ссылка КАК Ссылка
	      	               |ИЗ
	      	               |	Справочник.Города КАК Города
	      	               |ГДЕ
	      	               |	Города.ПометкаУдаления = ЛОЖЬ
	      	               |	И Города.Владелец В
	      	               |			(ВЫБРАТЬ
	      	               |				Команды.Город.Владелец КАК ГородВладелец
	      	               |			ИЗ
	      	               |				Справочник.Команды КАК Команды
	      	               |			ГДЕ
	      	               |				Команды.Ссылка В (&Ссылка))
	      	               |
	      	               |УПОРЯДОЧИТЬ ПО
	      	               |	Ссылка
	      	               |АВТОУПОРЯДОЧИВАНИЕ");
	Ссылка	= Новый Массив;
	Если ЗначениеЗаполнено(Запись.Противник) Тогда
		Ссылка.Добавить(Запись.Противник);
	ИначеЕсли ЗначениеЗаполнено(Запись.Команда) Тогда
		Ссылка.Добавить(Запись.Команда);
	Иначе
		Запрос.Текст = "ВЫБРАТЬ
		               |	Команды.Город КАК Ссылка
		               |ИЗ
		               |	Справочник.Команды КАК Команды
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Города КАК Города
		               |		ПО Команды.Город = Города.Ссылка
		               |ГДЕ
		               |	Команды.ПометкаУдаления = ЛОЖЬ";
	КонецЕсли;
	Запрос.УстановитьПараметр("Ссылка",		Ссылка);
	Города.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку(0));
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.ВидСпорта.Доступность	= (НЕ ЗначениеЗаполнено(Запись.Команда) И НЕ ЗначениеЗаполнено(Запись.Противник));
	Элементы.Команда.Доступность	= (НЕ ЗначениеЗаполнено(Запись.Команда));
	Элементы.Противник.Доступность	= (НЕ ЗначениеЗаполнено(Запись.Противник));
КонецПроцедуры
