
&НаСервере
Процедура ГрафикОбновитьНаСервере()
	Отчет.Данные.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Команда",		Отчет.Команда);
	Запрос.УстановитьПараметр("Чемпионат",		Отчет.Чемпионат);
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если ТипГрафика = 6 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.Регистратор КАК Матч,
			|	Матч.Представление КАК Подсказка,
			|	ВЫБОР
			|		КОГДА ТурнирнаяТаблица1.КоличествоГолов = 0
			|			ТОГДА ТурнирнаяТаблица.КоличествоГолов
			|		ИНАЧЕ 0
			|	КОНЕЦ КАК КоличествоЗабито,
			|	0 - ТурнирнаяТаблица1.КоличествоГолов КАК КоличествоПропущено
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			|		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Регистратор = ТурнирнаяТаблица1.Регистратор
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И Туры.Владелец = &Чемпионат
			|	И ТурнирнаяТаблица1.Команда <> &Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		ИначеЕсли ТипГрафика = 5 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
			|	ТурнирнаяТаблица1.КоличествоГолов КАК КоличествоГолов
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Регистратор = ТурнирнаяТаблица1.Регистратор
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|	И Туры.Владелец = &Чемпионат
			|	И ТурнирнаяТаблица1.Команда <> &Команда
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И ТурнирнаяТаблица1.КоличествоГолов = 0
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков >= 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|			И (ТурнирнаяТаблица.КоличествоГолов > 0)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) >= 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Окна.Период КАК Период,
			|	Макси.Количество КАК КоличествоЗабито
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		ИначеЕсли ТипГрафика = 4 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|	И Туры.Владелец = &Чемпионат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И (ТурнирнаяТаблица1.КоличествоОчков = 3)
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков = 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|			И (ТурнирнаяТаблица.КоличествоОчков < 3)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) > 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Окна.Период КАК Период,
			|	Макси.Количество КАК КоличествоЗабито
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		ИначеЕсли ТипГрафика = 3 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|	И Туры.Владелец = &Чемпионат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И (ТурнирнаяТаблица1.КоличествоОчков > 0)
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.КоличествоОчков = 0)
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) > 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Окна.Период КАК Период,
			|	Макси.Количество КАК КоличествоЗабито
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
		ИначеЕсли ТипГрафика > 0 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Матч.Дата КАК Период,
			|	ТурнирнаяТаблица.Регистратор КАК Матч,
			|	Матч.Представление КАК Подсказка,
			|	ТурнирнаяТаблица.КоличествоГолов КАК КоличествоЗабито,
			|	Противник.КоличествоГолов КАК КоличествоПропущено
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК Противник
			|		ПО ТурнирнаяТаблица.Регистратор = Противник.Регистратор
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			|		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И Туры.Владелец = &Чемпионат
			|	И Противник.Команда <> &Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
			
		Иначе
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Матч.Дата КАК Период,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоЗабито,
			|	ТурнирнаяТаблица.Регистратор КАК Матч,
			|	Матч.Представление КАК Подсказка
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			|		ПО ТурнирнаяТаблица.Регистратор = Матч.Ссылка
			|ГДЕ
			|	ТурнирнаяТаблица.Команда = &Команда
			|	И Туры.Владелец = &Чемпионат
			|
			|УПОРЯДОЧИТЬ ПО
			|	Период";
		КонецЕсли;

	ИначеЕсли ТипГрафика = 6 Тогда
			Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 9
			|	ТурнирнаяТаблица.Команда КАК Команда,
			|	СУММА(1) КАК КоличествоЗабито
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Регистратор = ТурнирнаяТаблица1.Регистратор
			|			И ТурнирнаяТаблица.Команда <> ТурнирнаяТаблица1.Команда
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|	И ТурнирнаяТаблица1.КоличествоГолов = 0
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТурнирнаяТаблица.Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоЗабито УБЫВ,
			|	Команда
			|АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 5 Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.Команда КАК Команда,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков,
			|	ТурнирнаяТаблица1.КоличествоГолов КАК КоличествоГолов
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Регистратор = ТурнирнаяТаблица1.Регистратор
			|			И ТурнирнаяТаблица.Команда <> ТурнирнаяТаблица1.Команда
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1,
			|	ТурнирнаяТаблица.Команда КАК Команда
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Команда = ТурнирнаяТаблица1.Команда
			|			И ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И (ТурнирнаяТаблица1.КоличествоГолов = 0)
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков >= 1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Команда КАК Команда,
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Комбинации.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|			И (ТурнирнаяТаблица.КоличествоГолов > 0)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Команда,
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество,
			|	Окна.Команда КАК Команда
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период,
			|	Окна.Команда
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) >= 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 9
			|	МАКСИМУМ(Макси.Количество) КАК КоличествоЗабито,
			|	Окна.Команда КАК Команда
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|			И Окна.Команда = Макси.Команда
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоЗабито УБЫВ,
			|	Команда
			|АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 4 Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.Команда КАК Команда,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1,
			|	ТурнирнаяТаблица.Команда КАК Команда
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Команда = ТурнирнаяТаблица1.Команда
			|			И ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И (ТурнирнаяТаблица1.КоличествоОчков = 3)
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков = 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Команда КАК Команда,
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Комбинации.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|			И (ТурнирнаяТаблица.КоличествоОчков < 3)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Команда,
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество,
			|	Окна.Команда КАК Команда
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период,
			|	Окна.Команда
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) > 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 9
			|	МАКСИМУМ(Макси.Количество) КАК КоличествоЗабито,
			|	Окна.Команда КАК Команда
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|			И Окна.Команда = Макси.Команда
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоЗабито УБЫВ,
			|	Команда
			|АВТОУПОРЯДОЧИВАНИЕ";
	ИначеЕсли ТипГрафика = 3 Тогда
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ТурнирнаяТаблица.Команда КАК Команда,
			|	ТурнирнаяТаблица.КоличествоОчков КАК КоличествоОчков
			|ПОМЕСТИТЬ ТурнирнаяТаблица
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ТурнирнаяТаблица.Период КАК Период,
			|	ЕСТЬNULL(ТурнирнаяТаблица1.Период, ТурнирнаяТаблица.Период) КАК Период1,
			|	ТурнирнаяТаблица.Команда КАК Команда
			|ПОМЕСТИТЬ Комбинации
			|ИЗ
			|	ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица1
			|		ПО ТурнирнаяТаблица.Команда = ТурнирнаяТаблица1.Команда
			|			И ТурнирнаяТаблица.Период >= ТурнирнаяТаблица1.Период
			|			И (ТурнирнаяТаблица1.КоличествоОчков > 0)
			|ГДЕ
			|	ТурнирнаяТаблица.КоличествоОчков > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Комбинации.Команда КАК Команда,
			|	Комбинации.Период1 КАК Период1,
			|	МАКСИМУМ(Комбинации.Период) КАК Период
			|ПОМЕСТИТЬ Окна
			|ИЗ
			|	Комбинации КАК Комбинации
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Комбинации.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.КоличествоОчков = 0)
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Комбинации.Период1 И Комбинации.Период)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Комбинации.Период = Комбинации.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Комбинации.Команда,
			|	Комбинации.Период1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Окна.Период КАК Период,
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) КАК Количество,
			|	Окна.Команда КАК Команда
			|ПОМЕСТИТЬ Макси
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период1 И Окна.Период)
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Период,
			|	Окна.Команда
			|
			|ИМЕЮЩИЕ
			|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Окна.Период1) > 3
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ ПЕРВЫЕ 9
			|	МАКСИМУМ(Макси.Количество) КАК КоличествоЗабито,
			|	Окна.Команда КАК Команда
			|ИЗ
			|	Окна КАК Окна
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Макси КАК Макси
			|		ПО Окна.Период = Макси.Период
			|			И Окна.Команда = Макси.Команда
			|		ЛЕВОЕ СОЕДИНЕНИЕ ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ПО Окна.Команда = ТурнирнаяТаблица.Команда
			|			И (ТурнирнаяТаблица.Период МЕЖДУ Окна.Период И Окна.Период1)
			|ГДЕ
			|	ВЫБОР
			|			КОГДА Окна.Период = Окна.Период1
			|				ТОГДА ИСТИНА
			|			ИНАЧЕ ТурнирнаяТаблица.Период ЕСТЬ NULL
			|		КОНЕЦ
			|
			|СГРУППИРОВАТЬ ПО
			|	Окна.Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоЗабито УБЫВ,
			|	Команда
			|АВТОУПОРЯДОЧИВАНИЕ";
		
	Иначе
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 5
			|	ТурнирнаяТаблица.Команда КАК Команда,
			|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
			|	СУММА(ТурнирнаяТаблица.КоличествоГолов) КАК КоличествоГолов,
			|	СУММА(ТурнирнаяТаблица.КоличествоОчков) КАК КоличествоОчков
			|ПОМЕСТИТЬ Топ5
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТурнирнаяТаблица
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТурнирнаяТаблица.Тур = Туры.Ссылка
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|	И ТИПЗНАЧЕНИЯ(ТурнирнаяТаблица.Регистратор) = ТИП(Документ.Матч)
			|
			|СГРУППИРОВАТЬ ПО
			|	ТурнирнаяТаблица.Команда
			|
			|УПОРЯДОЧИТЬ ПО
			|	КоличествоОчков УБЫВ,
			|	КоличествоГолов УБЫВ
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ТТ.Команда КАК Команда,
			|	ТТ.КоличествоОчков КАК КоличествоПропущено,
			|	ТТ.КоличествоГолов КАК КоличествоЗабито,
			|	Туры.ДатаНачала КАК Период,
			|	Матч.Ссылка КАК Матч,
			|	Матч.Представление КАК Подсказка
			|ИЗ
			|	РегистрНакопления.ТурнирнаяТаблица КАК ТТ
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Топ5 КАК Топ5
			|		ПО ТТ.Команда = Топ5.Команда
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Туры КАК Туры
			|		ПО ТТ.Тур = Туры.Ссылка
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Матч КАК Матч
			|		ПО ТТ.Регистратор = Матч.Ссылка
			|ГДЕ
			|	Туры.Владелец = &Чемпионат
			|
			|УПОРЯДОЧИТЬ ПО
			|	Топ5.НомерЗаписи,
			|	Период
			|ИТОГИ ПО
			|	Команда";
		Если ТипГрафика > 0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Очков УБЫВ", "Голов УБЫВ");
		КонецЕсли;
	КонецЕсли;
	
	Детали	= Запрос.Выполнить().Выбрать();
	Пока Детали.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Отчет.Данные.Добавить(), Детали);
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ГрафикОбновить()
	ГрафикОбновитьНаСервере();
	
	График.Очистить();
	График.ТипДиаграммы	= ?(ТипГрафика > 2, ТипДиаграммы.Гистограмма, ТипДиаграммы.График);
	Если ЗначениеЗаполнено(Отчет.Команда) Тогда
		Если ТипГрафика = 6 Тогда
			Для Итератор = 0 По 1 Цикл
				Серия	= График.УстановитьСерию(?(Итератор=0, "Забито", "Пропущено"));
				Для Каждого Детали Из Отчет.Данные Цикл
					Точка				= График.УстановитьТочку(Детали.Период);
					Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
					Если Итератор = 0 Тогда
						График.УстановитьЗначение(Точка, Серия, Детали.КоличествоЗабито, Детали.Матч);
					Иначе
						График.УстановитьЗначение(Точка, Серия, Детали.КоличествоПропущено, Детали.Матч, Детали.Подсказка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		ИначеЕсли ТипГрафика > 2 Тогда
			Серия	= График.УстановитьСерию(Отчет.Команда);
			Для Каждого Детали Из Отчет.Данные Цикл
				Точка				= График.УстановитьТочку(Детали.Период);
				Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
				График.УстановитьЗначение(Точка, Серия, Детали.КоличествоЗабито);
			КонецЦикла;
			
		ИначеЕсли ТипГрафика = 2 Тогда
			Для Итератор = 0 По 1 Цикл
				Итого	= 0;
				Забито	= 0;
				Серия	= График.УстановитьСерию(?(Итератор=0, "Забито", "Средняя результативность"));
				Для Каждого Детали Из Отчет.Данные Цикл
					Точка				= График.УстановитьТочку(Детали.Период);
					Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
					Забито	= Забито + Детали.КоличествоЗабито;
					Итого	= Итого + 1;
					Если Итератор = 0 И Детали.КоличествоЗабито = 0 Тогда
						График.УстановитьЗначение(Точка, Серия, ?(Итератор=0, Детали.КоличествоЗабито, Окр(Забито / Итого, 2)));
					Иначе
						График.УстановитьЗначение(Точка, Серия, ?(Итератор=0, Детали.КоличествоЗабито, Окр(Забито / Итого, 2)), Детали.Матч, Детали.Подсказка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
			
		ИначеЕсли ТипГрафика = 1 Тогда
			Для Итератор = 0 По 1 Цикл
				Итого	= 0;
				Серия	= График.УстановитьСерию(?(Итератор=0, "Забито", "Пропущено"));
				Для Каждого Детали Из Отчет.Данные Цикл
					Точка				= График.УстановитьТочку(Детали.Период);
					Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
					Итого = Итого + ?(Итератор = 0, Детали.КоличествоЗабито, Детали.КоличествоПропущено);
					Если ?(Итератор = 0, Детали.КоличествоЗабито = 0, Детали.КоличествоПропущено = 0) Тогда
						График.УстановитьЗначение(Точка, Серия, Итого, Детали.Матч);
					Иначе
						График.УстановитьЗначение(Точка, Серия, Итого, Детали.Матч, Детали.Подсказка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		Иначе
			Для Итератор = 0 По 1 Цикл
				Итого	= 0;
				Серия	= График.УстановитьСерию(?(Итератор = 0, "Набрано", "Упущено"));
				Для Каждого Детали Из Отчет.Данные Цикл
					Точка				= График.УстановитьТочку(Детали.Период);
					Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
					Итого = Итого + ?(Итератор = 0, Детали.КоличествоЗабито, 3 - Детали.КоличествоЗабито);
					Если ?(Итератор = 0, Детали.КоличествоЗабито = 0, Детали.КоличествоЗабито = 3) Тогда
						График.УстановитьЗначение(Точка, Серия, Итого, Детали.Матч);
					Иначе
						График.УстановитьЗначение(Точка, Серия, Итого, Детали.Матч, Детали.Подсказка);
					КонецЕсли;
				КонецЦикла;
			КонецЦикла;
		КонецЕсли;
		
	ИначеЕсли ТипГрафика >= 3 Тогда
		Для Каждого Детали Из Отчет.Данные Цикл
			Серия	= УстановитьСерию(График, Детали.Команда);
			График.УстановитьЗначение(График.УстановитьТочку(Детали.КоличествоЗабито), Серия, Детали.КоличествоЗабито);
		КонецЦикла;
		
	ИначеЕсли ТипГрафика = 2 Тогда
		Итого	= 0;
		Забито	= 0;
		Для Каждого Детали Из Отчет.Данные Цикл
			Если ЗначениеЗаполнено(Детали.Период) Тогда
				Итого	= Итого + 1;
				Забито	= Забито + Детали.КоличествоЗабито;
				Если Итого > 1 Тогда
					Точка				= График.УстановитьТочку(Детали.Период);
					Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
					График.УстановитьЗначение(Точка, Серия, ?(Итератор=0, Детали.КоличествоЗабито, Окр(Забито / Итого, 2)), Детали.Матч, Детали.Подсказка);
				КонецЕсли;
			Иначе
				Серия	= УстановитьСерию(График, Детали.Команда);
				Итого	= 0;
				Забито	= 0;
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		Итого	= 0;
		Для Каждого Детали Из Отчет.Данные Цикл
			Если ЗначениеЗаполнено(Детали.Период) Тогда
				Точка				= График.УстановитьТочку(Детали.Период);
				Точка.Текст			= Формат(Детали.Период, "ДФ=dd.MM");
				Итого = Итого + ?(ТипГрафика = 0, Детали.КоличествоПропущено, Детали.КоличествоЗабито);
				График.УстановитьЗначение(Точка, Серия, Итого, Детали.Матч, Детали.Подсказка);
			Иначе
				Серия	= УстановитьСерию(График, Детали.Команда);
				Итого	= 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	График.ОбластьЛегенды.Расположение	= ?(График.Серии.Количество() = 1 И ЗначениеЗаполнено(Отчет.Команда), РасположениеЛегендыДиаграммы.Нет, РасположениеЛегендыДиаграммы.Авто);
КонецПроцедуры

&НаКлиенте
Функция УстановитьСерию(График, Команда)
	Серия	= График.УстановитьСерию(Команда);
	Цвет	= Цвет(Команда);
	Если ЗначениеЗаполнено(Цвет) Тогда
		Серия.Цвет			= Цвет;
	КонецЕсли;
	Возврат Серия;
КонецФункции

&НаСервереБезКонтекста
Функция Цвет(Команда)
	Возврат Команда.Цвет.Получить();
КонецФункции

&НаКлиенте
Процедура ЧемпионатПриИзменении(Элемент)
	ГрафикОбновить();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Чемпионат") Тогда
		Отчет.Чемпионат	= Параметры.Чемпионат;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Чемпионат);
	
	ИначеЕсли Параметры.Свойство("Команда") Тогда
		Отчет.Команда	= Параметры.Команда;
		Если НЕ ЗначениеЗаполнено(Отчет.Чемпионат) Тогда
			Отчет.Чемпионат = СерверныйФункции.ЧемпионатПолучитьПоследнее(Отчет.Команда);
		КонецЕсли;
		ОбщегоНазначения.ЗаголовокСкрыть(ЭтаФорма, Элементы.Команда);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ГрафикОбновить();
КонецПроцедуры

&НаКлиенте
Процедура ГрафикВыбор(Элемент, ЗначениеДиаграммы, СтандартнаяОбработка)
	Если ПустаяСтрока(Отчет.Команда)
	И ТипЗнч(ЗначениеДиаграммы.Значение) = Тип("СправочникСсылка.Команды")
	Тогда
		Отчет.Команда	= ЗначениеДиаграммы.Значение;
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ТипЗнч(Параметр) = Тип("СправочникСсылка.Чемпионаты") И Параметр = Отчет.Чемпионат Тогда
		ГрафикОбновить();
	КонецЕсли;
КонецПроцедуры
