
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОткрытьФорму("Справочник.Чемпионаты.ФормаСписка", Новый Структура("Отбор", Новый Структура("Ссылка", ЧемпионатыСтраны(ПараметрКоманды))), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
КонецПроцедуры

&НаСервере
Функция ЧемпионатыСтраны(Ссылка)
	Возврат СерверныйФункции.ЧемпионатыСтраны(Ссылка);
КонецФункции
